[
  {
    "id": 1,
    "chapter_name": "1.Çfarë duhet thënë kur të zgjohemi nga gjumi",
    "invocations": [
      {
        "id": 1,
        "audio": "/audios/001_01.mp3",
        "arabic": "الْحَمْدُ للهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
        "latin": "Elhamdulil-lahil-ledhi ahjana ba’de ma ematena, ve ilejhin-nushur",
        "albanian": "Falënderimi i takon Allahut, i Cili na ringjalli pasi na bëri të vdekur dhe tek Ai është ringjallja (tubimi Ditën e Gjykimit).",
        "reference": "Buhariu “Fet’hul-Bari” 11/113 dhe Muslimi 4/2083"
      },
      {
        "id": 2,
        "audio": "/audios/001_02.mp3",
        "arabic": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدَ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. سُبْحَانَ اللهِ، وَالْحَمْدُ للهِ، ولَا إِلَهَ إِلَّا\\n\\nاللهُ، وَاللهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ العَلِيِّ الْعَظيِمِ، ربِّ اغْفِرلِي",
        "latin": "La ilahe il-lAll-llahu vahdehu la sherike leh, lehul-mulku ve lehul-hamdu ve huve ala kul-li shej’in kadir. SubhanAll-llah, vel-hamdulil-lah, ve la ilahe il-laAll-llah, vAll-llahu Ekber, ve la havle ve la kuvvete il-la bil-lahil Alij-jil Adhim. Rabbigfir li.",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut, të Vetëm e i pa rival. Atij i takon Sundimi dhe Lavdërimi dhe Ai është i Gjithëfuqishëm mbi çdo gjë. I Madhërishëm qoftë Allahu, Falënderimi i përket vetëm Allahut, nuk ka hyjni që meriton të adhurohet përveç Allahut, Allahu është më i Madhi, nuk ka ndryshim e as forcë pa ndihmën e Allahut të Lartmadhëruar, Zoti im më fal.",
        "reference": "“Kush e thotë këtë (lutje) do t’i falen mëkatet, e nëse lutet do t’i pranohet lutja, e nëse ngritët e merr abdes dhe falet do t’i pranohet namazi.” Shënon Buhariu."
      },
      {
        "id": 3,
        "audio": "/audios/001_03.mp3",
        "arabic": "الْحَمْدُ للهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لِي بِذِكْرِهِ",
        "latin": "Elhamdulil-lahil-ledhi a’fani fi xhesedi, ve redde alejje ruhi, ve edhine li bi dhikrihi",
        "albanian": "Falënderimi i takon Allahut, i Cili më fali shëndetin në trupin tim, ma ktheu shpirtin tim dhe më dha mundësi që ta përmendi Atë.",
        "reference": "Tirmidhiu 5/473 “Sahih et-Tirmidhi” 3/144"
      },
      {
        "id": 4,
        "audio": "/audios/001_04.mp3",
        "arabic": "  إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِأُولِي الْأَلْبَابِ  ۞ الَّذِينَ يَذْكُرُونَ اللهَ قِيَامًا وَقُعُودًا\\n\\nوَعَلَى جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ ۞ رَبَّنَا إِنَّكَ\\n\\nمَنْ تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنْصَارٍ ۞ رَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا رَبَّنَا\\n\\nفَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ ۞ رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَى رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا\\n\\nتُخْلِفُ الْمِيعَادَ ۞ فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لَا أُضِيعُ عَمَلَ عَامِلٍ مِنْكُمْ مِنْ ذَكَرٍ أَوْ أُنْثَى بَعْضُكُمْ مِنْ بَعْضٍ فَالَّذِينَ هَاجَرُوا\\n\\nوَأُخْرِجُوا مِنْ دِيَارِهِمْ وَأُوذُوا فِي سَبِيلِي وَقَاتَلُوا وَقُتِلُوا لَأُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ وَلَأُدْخِلَنَّهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا\\n\\nالْأَنْهَارُ ثَوَابًا مِنْ عِنْدِ اللهِ وَاللهُ عِنْدَهُ حُسْنُ الثَّوَابِ ۞ لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُوا فِي الْبِلَادِ ۞ مَتَاعٌ قَلِيلٌ ثُمَّ مَأْوَاهُمْ\\n\\nجَهَنَّمُ وَبِئْسَ الْمِهَادُ ۞ لَكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا نُزُلًا مِنْ عِنْدِ اللهِ وَمَا\\n\\nعِنْدَ اللهِ خَيْرٌ لِلْأَبْرَارِ ۞ وَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَنْ يُؤْمِنُ بِاللهِ وَمَا أُنْزِلَ إِلَيْكُمْ وَمَا أُنْزِلَ إِلَيْهِمْ خَاشِعِينَ للهِ لَا يَشْتَرُونَ\\n\\nبِآيَاتِ اللهِ ثَمَنًا قَلِيلًا أُولَئِكَ لَهُمْ أَجْرُهُمْ عِنْدَ رَبِّهِمْ إِنَّ اللهَ سَرِيعُ الْحِسَابِ ۞ يَا أَيُّهَا الَّذِينَ آمَنُوا اصْبِرُوا وَصَابِرُوا\\n\\nوَرَابِطُوا وَاتَّقُوا اللهَ لَعَلَّكُمْ تُفْلِحُونَ",
        "latin": "",
        "albanian": "Me të vërtetë, në krijimin e qiejve dhe të Tokës dhe në ndërrimin e natës e të ditës, ka shenja për mendarët, për ata që e përmendin Allahun duke qëndruar në këmbë, ndenjur ose shtrirë dhe që meditojnë për krijimin e qiejve dhe të Tokës (duke thënë): “O Zoti Ynë! Ti nuk i ke krijuar kot këto - lartësuar qofsh (nga çdo e metë)! Prandaj na ruaj nga ndëshkimi i zjarrit. O Zoti Ynë, cilindo që Ti e fut në zjarr, Ti e ke poshtëruar atë. Dhe për mohuesit nuk do të ketë kurrfarë ndihmuesi. O Zoti Ynë! Ne dëgjuam një thirrës që na ftonte në besim: “Besoni Zotin tuaj!” Dhe kështu besuam. O Zoti Ynë! Na i fal gjynahet tona, na i shlyej gabimet dhe bëna që të vdesim me të mirët! O Zoti Ynë! Na e jep shpërblimin që na ke premtuar nëpërmjet të dërguarve të Tu dhe mos na poshtëro në Ditën e Kiametit! Se Ti, me të vërtetë, nuk e shkel premtimin e dhënë!” Dhe Zoti iu përgjigj lutjes së tyre: “Unë nuk do t’ia humb mundin askujt nga ju që ka bërë vepra, qoftë mashkull apo femër. Ju jeni njëlloj (në shpërblim). Atyre që u shpërngulën, u dëbuan nga vatrat e tyre, u munduan në rrugën Time, luftuan dhe u vranë, Unë do t’ua mbuloj veprat e këqija dhe do t’i shpie në kopshte, nëpër të cilat rrjedhin lumenj, si shpërblim nga Allahu. Shpërblimi më i mirë është tek Allahu.” Ti (o Muhamed) mos u mashtro nga bredhja e jobesimtarëve nëpër botë! Kjo mirëqenie është e shkurtër; pastaj, strehimi i tyre është Xhehenemi. Eh, sa shtrat i keq është ai vend! Por, ata që i frikësohen Zotit të tyre do të kenë kopshte nëpër të cilat rrjedhin lumenj dhe ku do të banojnë përjetësisht, si dhuratë prej Allahut. Dhe ajo që është tek Allahu, është dhurata më e mirë për besimtarët e vërtetë. Midis ithtarëve të Librit, me siguri ka të atillë që e besojnë Allahun dhe atë që ju është shpallur juve, si dhe atë që u është shpallur atyre, duke qenë të përulur para Allahut dhe pa i këmbyer shpalljet e Tij me ndonjë vlerë të paktë. Ata do të kenë shpërblimin e tyre te Zoti i tyre. Vërtet, Allahu është i shpejtë në llogari! O besimtarë! Bëhuni të durueshëm dhe nxiteni njëri-tjetrin të jeni të tillë; bëhuni të vendosur dhe vigjilentë (në vepra të mira dhe në ruajtjen e kufijve) dhe kijeni frikë Allahun, që të shpëtoni!",
        "reference": "Ali Imran, 190-200, Buhariu “Fet’hul-Bari” 8/237, Muslimi 1/530"
      }
    ]
  },
  {
    "id": 2,
    "chapter_name": "2.Duaja kur të veshim rrobat",
    "invocations": [
      {
        "id": 5,
        "audio": "/audios/002_01.mp3",
        "arabic": "الْحَمْدُ للهِ الَّذِي كَسَانِي هَذَا (الثَّوبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
        "latin": "Elhamdulil-lahil-ledhi kesani hadha (eth-thevbe) ve rezekanihi min gajri havlin minni ve la kuvvetin...",
        "albanian": "Falënderimi i takon Allahut, i Cili ma mundësoi ta vesh këtë rrobë dhe më furnizoi me lehtësi me të, pa ndihmën dhe fuqinë time...",
        "reference": "Ebu Davudi, Tirmidhiu dhe Ibën Maxheh “Irvaul-Galil” 7/47"
      }
    ]
  },
  {
    "id": 3,
    "chapter_name": "3.Duaja kur të veshim rroba të reja",
    "invocations": [
      {
        "id": 6,
        "audio": "/audios/003_01.mp3",
        "arabic": "اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ",
        "latin": "All-llahumme lekel-hamdu ente kesevtenihi, es-eluke min hajrihi, ve hajri ma suni-a lehu, ve eudhu bike min sherrihi ve sherri ma suni-a lehu",
        "albanian": "O Zoti im, Ty të takon Falënderimi, Ti je Ai i Cili më furnizove me të, Të lutem ma dhuro të mirën e saj dhe të mirën për çfarë është punuar. Kërkoj mbrojtjen tënde nga e keqja e saj dhe nga e keqja për çfarë është punuar ajo.",
        "reference": "Ebu Davudi, Tirmidhiu dhe Begaviu, “Muhtesar Shemail et-Tirmidhi”, nga shejh Albani, fq. 47."
      }
    ]
  },
  {
    "id": 4,
    "chapter_name": "4.Duaja për atë i cili vesh rroba të reja",
    "invocations": [
      {
        "id": 7,
        "audio": "/audios/004_01.mp3",
        "arabic": "تُبْلِي وَيُخْلِفُ اللهُ تَعَالَى",
        "latin": "Tubli ve juhlifull-llahu teala",
        "albanian": "E vjetrofsh dhe Allahu i Lartmadhëruar ta zëvendësoftë me tjetrën.",
        "reference": "Ebu Davudi 4/41 “Sahih Ebi Davud” 2/760."
      },
      {
        "id": 8,
        "audio": "/audios/004_02.mp3",
        "arabic": "الْبَسْ جَدِيداً، وَعِشْ حَمِيداً، وَمُتْ شَهِيداً",
        "latin": "Ilbis xhediden ve ish hamiden ve mut shehiden",
        "albanian": "Vishe të re, jeto Falënderues dhe vdis si dëshmor në rrugën e Allahut.",
        "reference": "Ibën Maxheh 2/1178 dhe Begaviu 12/41 “Sahih Sunen Ibën Maxheh” 2/275."
      }
    ]
  },
  {
    "id": 5,
    "chapter_name": "5.Çfarë duhet thënë kur heqim rrobat",
    "invocations": [
      {
        "id": 9,
        "audio": "/audios/005_01.mp3",
        "arabic": "بِسْمِ اللهِ",
        "latin": "Bismil-lah",
        "albanian": "Me emrin e Allahut.",
        "reference": "Tirmidhiu 2/505 dhe të tjerë “Irvaul-Galil” nr. 49 dhe “Sahih el-Xhamiu” nr: 3/203."
      }
    ]
  },
  {
    "id": 6,
    "chapter_name": "6.Duaja para se të hyjmë në tualet (wc)",
    "invocations": [
      {
        "id": 10,
        "audio": "/audios/006_01.mp3",
        "arabic": "(بِسْمِ الله) اللّهُـمَّ إِنِّـي أَعـوذُ بِـكَ مِـنَ الْخُـبْثِ وَالْخَبائِث",
        "latin": "[[Bismil-lah] All-llahumme inni eudhu bike minel-hubthi vel-habaithi",
        "albanian": "Me emrin e Allahut, O Zoti im kërkoj që të më mbrosh nga të fëlliqurit (shejtanët) dhe të fëlliqurat (xhinët).",
        "reference": "Buhariu 1/45 dhe Muslimi 1/283, shtojcën (Bismil-lahin) në fillim të hadithit e shënon Seid ibën Mensuri “Fet’hul-Bari” 1/244."
      }
    ]
  },
  {
    "id": 7,
    "chapter_name": "7.Duaja kur të dalim nga tualeti (wc)",
    "invocations": [
      {
        "id": 11,
        "audio": "/audios/007_01.mp3",
        "arabic": "غُفْرَانَكَ",
        "latin": "Gufraneke",
        "albanian": "Kërkoj faljen tënde o Allah.",
        "reference": "Transmetojnë autorët e katër Suneneve përveç Nesaiut i cili këtë hadith e shënon në librin e tij “Amel el-Jevmi ve Lejleh” “Zadul-Mead” 2/387."
      }
    ]
  },
  {
    "id": 8,
    "chapter_name": "8.Dhikri para abdesit",
    "invocations": [
      {
        "id": 12,
        "audio": "/audios/008_01.mp3",
        "arabic": "بِسْمِ اللهِ",
        "latin": "Bismil-lah",
        "albanian": "Me emrin e Allahut.",
        "reference": ""
      }
    ]
  },
  {
    "id": 9,
    "chapter_name": "9.Dhikri pas abdesit",
    "invocations": [
      {
        "id": 13,
        "audio": "/audios/009_01.mp3",
        "arabic": "أَشْهَدُ أَنْ لَا إِلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
        "latin": "Eshhedu en la Ilahe il-lAll-llahu vahdehu la sherike lehu ve eshhedu enne Muhammeden abduhu ve resuluhu",
        "albanian": "Dëshmoj se nuk ka hyjni që meriton të adhurohet përveç Allahut, të Vetëm e i pa rival, si dhe dëshmoj që Muhamedi është robi dhe i Dërguari i Tij.",
        "reference": "Muslimi 1/209."
      },
      {
        "id": 14,
        "audio": "/audios/009_02.mp3",
        "arabic": "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
        "latin": "All-llahumme-xh’alni minet-tevvabine vexh-alni minel-mutetahirin",
        "albanian": "O Allahu im, më bëj mua prej atyre që pendohen dhe më bëj mua nga ata që pastrohen nga gjynahet dhe papastërtitë.",
        "reference": "Tirmidhiu 1/78, “Sahih et-Tirmidhi” 3/151."
      },
      {
        "id": 15,
        "audio": "/audios/009_03.mp3",
        "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ",
        "latin": "Subhaneke All-llahumme ve bihamdike, Eshhedu en la ilahe il-la Ente estagfiruke ve etubu ilejke",
        "albanian": "I Lartësuar, i pa të meta je Ti o Allahu im, Ty të takon Falënderimi, dëshmoj se nuk ka hyjni që meriton të adhurohet përveç Teje, kërkoj falje nga Ti dhe tek Ti pendohem.",
        "reference": "Nesaiu në librin e tij “Amel el-jevmi ve lejleh” fq.173, “Irvaul-Galil” 1/135 dhe 2/94."
      }
    ]
  },
  {
    "id": 10,
    "chapter_name": "10.Dhikri gjatë daljes nga shtëpia",
    "invocations": [
      {
        "id": 17,
        "audio": "/audios/010_01.mp3",
        "arabic": "بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
        "latin": "Bismil-lahi, tevekkeltu ala All-llahi, ve la havle ve la kuvvete il-la bil-lah",
        "albanian": "Me emrin e Allahut, në Allahun u mbështeta, nuk ka ndryshim e as forcë pa ndihmën e Allahut.",
        "reference": "Ebu Davudi 4/325, Tirmidhiu 5/490 “Sahih et-Tirmidhi” 3/151."
      },
      {
        "id": 18,
        "audio": "/audios/010_02.mp3",
        "arabic": "الَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ، أّوْ أُضَلَّ، أَوْ أَزِلَّ، أَوْ أُزَلَّ، أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
        "latin": "All-llahumme inni eudhu bike en edil-le ev udal-le, ev ezil-le ev uzel-le, ev adhlime ev udhleme, ev exh-hele ev juxh-hele alejje",
        "albanian": "O Allahu im, kërkoj mbrojtje tek Ti, që të mos devijoj e as të tjerët të më devijojnë, që të mos i poshtëroj të tjerët e as të mos më poshtërojnë mua, të mos bëj padrejtësi e as të mos më bëhet padrejtësi, të mos i shpërfillë të tjerët e as të mos më shpërfillin mua.",
        "reference": "Transmetojnë autorët e katër Suneneve, “Sahih et-Tirmidhi” 3/153, “Sahih Ibën Maxheh” 2/336."
      }
    ]
  },
  {
    "id": 11,
    "chapter_name": "11.Dhikri gjatë hyrjes në shtëpi",
    "invocations": [
      {
        "id": 19,
        "audio": "/audios/011_01.mp3",
        "arabic": "بِسْمِ اللهِ وَلَجْنَا، وَ بِسْمِ اللهِ خَرَجْنَا، وَعَلَى رَبِّنَا تَوَكَّلْنَا",
        "latin": "Bismil-lahi velexhna ve bismil-lahi harexhna ve ala Rabbina tevekkelna",
        "albanian": "Me emrin e Allahut hyjmë dhe me emrin e Allahut dalim, si dhe vetëm Allahut, Zotit tonë i mbështetemi. Pastaj përshëndet familjen e tij.\\n",
        "reference": "Ebu Davudi 4/325, Ibën Bazi në librin e tij “Tuhfetul-Ahjar” fq. 28 dhe thotë: ‘Senedi i këtij hadithi është i mirë dhe transmetohet në hadith të vërtetë se i Dërguari ka thënë: “Kur njeriu hynë në shtëpinë e tij dhe e përmend Allahun gjatë hyrjes si dhe gjatë ngrënies së ushqimit shejtani, u thotë (shejtanëve të tjerë): Sot për ju s’ka vend për fjetje e as ushqim.” Shënon Muslimi, hadithi #2018."
      }
    ]
  },
  {
    "id": 12,
    "chapter_name": "12.Duaja e shkuarjes në xhami",
    "invocations": [
      {
        "id": 20,
        "audio": "/audios/012_01.mp3",
        "arabic": "اللّهُـمَّ اجْعَـلْ في قَلْبـي نورا ، وَفي لِسـاني نورا، وَاجْعَـلْ في سَمْعي نورا، وَاجْعَـلْ في بَصَري نورا، وَاجْعَـلْ مِنْ خَلْفي نورا، وَمِنْ أَمامـي نورا، وَاجْعَـلْ مِنْ فَوْقـي نورا ، وَمِن تَحْتـي نورا.اللّهُـمَّ أَعْطِنـي نورا.",
        "latin": "All-llahumme-xh’al fi kalbi nuren, ve fi lisani nuren, ve fi sem’i nuren, ve fi besari nuren, ve min fevki nuren, ve min tahti nuren, ve an jemini nuren, ve an shimali nuren, ve min emami nuren, ve min halfi nuren, vexh’al fi nefsi nuren, ve adhim li nuren, ve adh-dhem li nuren, ve-xh’al-li nuren, vexh’alni nuren, All-llahumme aëtini nuren, vexh’al fi asabi nuren, ve fi lahmi nuren, ve fi demi nuren ve fi sha’ri nuren ve fi besheri nuren",
        "albanian": "O Allah, ndriçoje zemrën time, ndriçoje gjuhën time, ndriçoje dëgjimin tim, ndriçoje shikimin tim, ndriçoje mbi mua, ndriçoje nën mua, ndriçoje nga e djathta ime, ndriçoje nga e majta ime, ndriçoje para meje, ndriçoje prapa meje, ndriçoje veten time dhe ma zmadho mua ndriçimin, bëj për mua ndriçim dhe më bëj mua ndriçim. O Allah më ndriço mua, mi ndriço venat e mia, ma ndriço mishin tim, ma ndriço gjakun tim, m’i ndriço flokët tim dhe ma ndriço lëkurën time.",
        "reference": "Buhariu 11/116, Muslimi 1/526, 529, 530."
      },
      {
        "id": 275,
        "audio": "/audios/012_02.mp3",
        "arabic": "اَللَّهُمَّ اجْعَلْ لِي نُوراً فِي قَبْرِي... وَنُوراً فِي عِظَامِي وَزِدْنِي نُوراً، وَزِدْنِي نُوراً، وَزِدْنِي نُوراً وَهَبْ لِي نُوراً عَلَى نُورٍ",
        "latin": "All-llahumme-xh’al-li nuren fi kabri.., ve nuren fi idhami. [ve zidni nuren, ve zidni nuren, ve zidni nuren], [ve heb li nuren ala nurin]",
        "albanian": "O Allah ma ndriço varrin tim dhe mi driço eshtrat e mia , ma shto mua ndriçimin, ma shto mua ndriçimin, ma shto mua ndriçimin dhe më dhuro mua dritë mbi dritë.",
        "reference": "Tirmidhiu 5/483.\\nBuhariu në librin “Edebul-Mufred” hadithi #695 fq. 258, isnadin e këtij hadithi e ka vërtetuar Albani në librin “Sahih Edebul-Mufred” hadithi #459.\\nKëtë hadith e ka përmend Ibën Haxheri në “Fet’hul-Bari” dhe thotë se e ka cekur këtë Ibën Ebi Asim në librin e duave, 11/118 dhe thotë: nga transmetimet e ndryshme janë përmbledhur njëzet e pesë cilësi.\\n"
      }
    ]
  },
  {
    "id": 13,
    "chapter_name": "13.Duaja e hyrjes në xhami",
    "invocations": [
      {
        "id": 21,
        "audio": "/audios/013_01.mp3",
        "arabic": "  أَعُوذُ بِاللهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ. [بِسْمِ اللهِ، وَالصَّلَاةُ وَالسَّلَّامُ عَلَى\\n\\nرَسُولِ اللهِ] اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
        "latin": "Eudhu bil-lahil-adhim, ve bi vexhhihil-kerim, ve sultanihil-kadim, minesh-shejtanir-raxhim",
        "albanian": "Kërkoj mbrojtjen e Allahut të Madhërishëm, me Fytyrën e Tij të ndershme dhe me sundimin e Tij të përjetshëm nga shejtani i mallkuar.",
        "reference": "Ebu Davudi, “Sahih el-Xhamiu” hadithi: #4591."
      },
      {
        "id": 276,
        "audio": "/audios/013_02.mp3",
        "arabic": "بِسْمِ اللهِ، وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللهِ ",
        "latin": "Bismil-lah, ves-salatu ves-selamu ala resulil-lah",
        "albanian": "Me emrin e Allahut, përshëndetjet dhe shpëtimi i Allahut qoftë mbi të Dërguarin e Tij.",
        "reference": "Ibën Sunij hadithi nr. 88, shejh Albani thotë se hadithi është i mirë (hasen), Ebu Davudi 1/126, “Sahih el-Xhamiu” 1/528”."
      },
      {
        "id": 277,
        "audio": "/audios/013_03.mp3",
        "arabic": "اَللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
        "latin": "All-llahumme-ftah li ebvabe rahmetike",
        "albanian": "O Allahu im, m’i hap dyert e mëshirës Tënde.",
        "reference": "Muslimi1/494."
      }
    ]
  },
  {
    "id": 14,
    "chapter_name": "14.Duaja e daljes nga xhamia",
    "invocations": [
      {
        "id": 22,
        "audio": "/audios/014_01.mp3",
        "arabic": "بِسْمِ اللهِ، وَالصَّلَاةُ وَالسَّلَّامُ عَلَى رَسُولِ اللهِ، اللَّهُمَّ إَنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللَّهُمَّ اعصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ",
        "latin": "Bismil-lah ves-salatu ves-selamu ala resulil-lah, All-llahumme inni es-eluke min fadlike, All-llahumme aësimni minesh-shejtanir-raxhim",
        "albanian": "Me emrin e Allahut, përshëndetjet dhe shpëtimi i Allahut qoftë mbi të Dërguarin e Tij, o Allah unë kërkoj nga mirësitë Tua, O Allah, më mbroj nga shejtani i mallkuar.",
        "reference": "Ibën Maxheh. Shih “Sahih Ibën Maxheh” 1/129."
      }
    ]
  },
  {
    "id": 15,
    "chapter_name": "15.Lutjet e ezanit",
    "invocations": [
      {
        "id": 23,
        "audio": "/audios/015_01.mp3",
        "arabic": "Thotë atë që e thotë myezini, përpos aty ku ai thotë:\\nحَيَّ عَلَى الصَّلَاةِ وَحَيَّ عَلَى الْفَلَاحِ\\nHajje ales-salah, hajje alel felah]\\n\"Ejani në namaz, ejani në shpëtim.”\\nDuhet të thotë:\\n",
        "latin": "La havle, ve la kuvvete il-la bil-lah",
        "albanian": "Nuk ka ndryshim e as forcë pa ndihmën e Allahut.",
        "reference": "Buhariu 1/152, Muslimi 1/288."
      },
      {
        "id": 24,
        "audio": "/audios/015_02.mp3",
        "arabic": "وَأَنا أَشْـهَدُ أَنْ لا إِلـهَ إِلاّ اللهُ وَحْـدَهُ لا شَـريكَ لَـه ، وَأَنَّ محَمّـداً عَبْـدُهُ وَرَسـولُه ، رَضيـتُ بِاللهِ رَبَّاً ، وَبِمُحَمَّـدٍ رَسـولاً وَبِالإِسْلامِ دينَـاً",
        "latin": "Ve ene eshhedu en La Ilahe il-lAll-llahu vahdehu la sherike leh, ve enne Muhammeden abduhu ve resuluhu, raditu bil-lahi Rabben ve bi Muhammedin resulen, ve bil-Islami dinen",
        "albanian": "Edhe unë dëshmoj se askush tjetër dhe asgjë tjetër nuk meriton të adhurohet përveç Allahut, të Vetëm e të Pashoq; dëshmoj që Muhamedi  është robi dhe i dërguari i Tij. Jam i kënaqur që Allahu është Zoti im, që Muhamedi është Pejgamberi im dhe që Islami është feja ime.” \\nKëtë duhet thënë pasi të thotë myezini: “Eshhedu en lá Iláhe il-lallah, Eshhedu enne Muhammeden Resúlull-llah.",
        "reference": "Muslimi 1/290.\\nIbën Huzejme 1/220.\\n"
      },
      {
        "id": 25,
        "audio": "/audios/015_03.mp3",
        "arabic": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلَاةِ الْقَائِمَةِ، آتِ مُحَمَّداً الْوَسِيلَةَ وَالْفَضِيلَةَ، وَابْعَثْهُ مَقَاماً مَحْمُوداً الَّذِي وَعَدْتَهُ،\\n\\n[إَنَّكَ لَا تُخْلِفُ الْمِيعَادَ]",
        "latin": "All-llahumme Rabbe hadhihi ed-da’vetit-tammeh ves-salatil-kaimeh, ati Muhammedenil-vesilete vel-fadileh, veb’ath-hu mekamen mahmuden el-ledhi ve’adteh, [inneke la tuhliful-miad]",
        "albanian": "Pas mbarimit të ezanit duhet thënë:\\n\\nO Allahu im, Zot i kësaj thirrjeje të plotë dhe i namazit që do të falet, jepi Muhamedit ndërmjetësimin dhe nderimin, si dhe dërgoje atë në vendin e lavdishëm të cilin ia ke premtuar. Pa dyshim, Ti e mban premtimin e dhënë.  Me të vërtetë Ti nuk e thyen premtimin.” \\n\\nBëj dua ndërmjet ezanit dhe ikametit, ngase me të vërtetë duaja në ketë kohë nuk refuzohet.\\n",
        "reference": "Buhariu 1/152.\\nKjo është shtojcë e Bejhekiut 1/410. Dijetari AbdulAziz Ibën Baz, senedin e këtij hadithi e ka bërë të mirë (hasen), “Tuhfetul Ahjar”, fq.38”.\\nTirmidhiu, Ebu Davudi dhe Ahmedi, “Irvaul-Galil” 1/262.\\n"
      }
    ]
  },
  {
    "id": 16,
    "chapter_name": "16.Duaja në fillim të namazit",
    "invocations": [
      {
        "id": 26,
        "audio": "/audios/016_01.mp3",
        "arabic": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ، كَمَا يُنَقَّى الثَّوْبُ الْأَ\\n\\nبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ بِالثَّلْجِ وّالْمَاءِ وَالْبَرَدِ",
        "latin": "All-llahumme ba’id bejni ve bejne hatajaje kema ba’adte bejnel-meshriki vel-magrib, All-llahumme nekkini min hatajaje kema junekka eth-thevbul-ebjedu mined-denesi, All-llahumme Igsilni min hatajaje bil mai veth-thelxhi vel-beredi",
        "albanian": "O Allahu im, më largo mua nga mëkatet e mia, ashtu siç e ke larguar lindjen prej perëndimit. O Zoti im, më pastro mua prej mëkateve të mia, ashtu siç pastrohet rroba e bardhë prej njollave të zeza. O Zoti im, më pastro mua prej mëkateve të mia me borë, ujë dhe akull.",
        "reference": "Buhariu 1/181, Muslimi 1/419."
      },
      {
        "id": 27,
        "audio": "/audios/016_02.mp3",
        "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلَهَ غَيْرُكَ",
        "latin": "Subhaneke Allahumme ve bihamdike ve tebarekesmuke ve teala xhedduke ve la Ilahe gajruke.",
        "albanian": "I Lartësuar qofsh o Zoti im dhe për Ty është falënderimi, i Lartësuar qoftë emri Yt dhe e Lartësuar qoftë Madhëria Jote, s’ka të adhuruar tjetër përveç Teje.",
        "reference": "Transmetojnë autorët e katër Suneneve, “Sahih et-Tirmidhi” 1/77, “Sahih Ibën Maxheh” 1/135."
      },
      {
        "id": 28,
        "audio": "/audios/.mp3",
        "arabic": "وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّموَاتِ وَالْأَرْضَ حَنِيفاً وَمَا أَنَا مِنَ الْمُشْرِكِينَ، إِنَّ صَلَاتِي، وَنُسُكِي، وَمَحْيَايَ، وَمَمَاتِي\\n\\nللهِ رَبِّ الْعَالَمِينَ، لَا شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ. اللَّهُمَّ أَنْتَ الْمَلِكُ لَا إِلَهَ إِلَّا أَنْتَ، أَنْتَ رَبِّي وَأَنَا عَبْدُكَ،\\n\\nظَلَمْتُ نَفْسِي وَاعْتَرَفْتُ بَذَنْبِي فَاغْفِرْ لِي ذُنُوبِي جَمِيعاً إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، وَاهْدِنِي لأّحْسَنِ الْأَخْلَاقِ لَا يَهْدِي\\n\\nلأَحْسَنِهَا إِلَّا أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا لَا يَصْرِفُ عَنِّي سَيِّئَهَا إِلَّا أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ\\n\\nلَيْسَ إِلَيْكَ، أَنَا بِكَ وَإِلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ",
        "latin": "Vexh-xhehtu vexh-hije lil-ledhi fetares-semavati vel-erda hanifen ve ma ene minel-mushrikin, inne salati ve nusuki ve mahjaje ve memati lil-lahi Rabbil-alemin la sherike Lehu ve bi dhalike umirtu ve ene minel-muslimin. All-llahumme Entel-Meliku la Ilahe il-la Ente. Ente Rabbi ve ene abduke, dhalemtu nefsi va’tereftu bi dhenbi fagfir li dhunubi xhemian innehu la jagfirudh-dhunube il-la Ente. Ve ihdini li Ahsenil-Ahlaki la jehdi li ahseniha il-la Ente, vesrif anni sejjieha, la jasrifu anni sejjieha il-la Ente, lebejke ve sa’dejk, vel-hajru kul-luhu bi jedejke, vesh-sherru lejse ilejke, ene bike ve ilejke, tebarekte ve te alejt, estagfiruke ve etubu ilejke",
        "albanian": "E ktheva fytyrën time me besim të sinqertë nga Allahu, i Cili i ka krijuar qiejt dhe tokën sepse unë nuk jam prej idhujtarëve. Me të vërtetë namazi im, adhurimi im, jeta ime dhe vdekja ime janë vetëm për Allahun, Zotin e të gjitha botëve. Nuk ka si Allahu, kështu jam i urdhëruar që të bëj sepse unë jam prej muslimanëve. O Zoti im, Ti je Sunduesi i çdo gjëje, s’ka të adhuruar tjetër përveç Teje, Ti je Zoti im dhe unë jam robi Yt. I kam bërë dëm vetvetes dhe i pranoj mëkatet e mia, m’i fal mua të gjitha mëkatet e mia, sepse mëkatet nuk i fal askush tjetër përveç Teje. Më udhëzo mua në moralin më të mirë, sepse në atë nuk më udhëzon askush tjetër përveç Teje dhe largo nga unë sjelljen e keqe, sepse atë s’e largon askush tjetër përveç Teje; Ty të përgjigjem dhe Ty të Madhëroj; e gjithë e mira është në duart Tua, kurse e keqja s’ka vend te Ti; ekzistenca dhe rikthimi im janë në duart Tua. I Madhëruar dhe i Lartësuar je o Allah, kërkoj falje nga Ti dhe te ti pendohem.",
        "reference": "Muslimi 1/135."
      },
      {
        "id": 29,
        "audio": "/audios/016_04.mp3",
        "arabic": "اللَّهُمَّ رَبَّ جِبْرَائِيلَ، وَمِيكَائِيلَ، وَإِسْرَافِيلَ فَاطِرَ السَّماوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، أَنْتَ تَحْكُمُ عِبَادِكَ فِيمَا\\n\\nكَانُوا فِيهِ يَخْتَلِفُونَ. اهْدِنِي لِمَا اخْتُلِفَ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلى صِرَاطٍ مُسْتَقِيمٍ",
        "latin": "All-llahumme Rabbe Xhibrail ve Mikail, ve Israfil fatires-semavati vel-erd, alimel-gajbi vesh-shehadeh, Ente tahkumu bejne ibadike fi ma kanu fíhi jahtelifun. Ihdini lima ihtulife fihi minel-hakki bi idhnike inneke tehdi men teshau ila siratin mustekim",
        "albanian": "O Allahu im, Zoti i Xhebrailit, Mikailit dhe Israfilit, Krijuesi i qiejve dhe i tokës, Ti je Ai që e di të fshehtën dhe të tanishmen, Ti je Ai që gjykon ndërmjet robërve Tu në atë që janë kundërshtuar, më udhëzo mua në të vërtetën nga ajo që janë kundërshtuar. Me të vërtetë, Ti udhëzon në rrugën e drejtë atë që dëshiron.",
        "reference": "Muslimi 1/534."
      },
      {
        "id": 30,
        "audio": "/audios/016_05.mp3",
        "arabic": "اللهُ أَكْبَرُ كَبِيراً، اللهُ أَكْبَرُ كَبِيراً، اللهُ أَكْبَرُ كَبِيراً، وَالْحَمْدُ للهِ كَثِيراً, وَالْحَمْدُ للهِ كَثِيراً, وَالْحَمْدُ للهِ كَثِيراً, وَسُبْحَانَ اللهِ بُكْرَةً\\n\\nوَأَصِيلاً ثَلَاثاً أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْخِهِ، وَنَفْثِهِ، وَهَمْزِهِ",
        "latin": "All-llahu Ekberu Kebira, All-llahu Ekberu Kebira, Allahu Ekberu Kebira, vElhamdulil-lahi kethira, vElhamdulil-lahi kethira, vElhamdulil-lahi kethira, ve subhanAll-llahi bukreten ve esila, (3 herë). Eudhu bil-lahi minesh-shejtani: min nefhihi, ve nefthihi, ve hemzihi. (3 herë)",
        "albanian": "Allahu është më i madhi, Allahu është më i madhi, Allahu është më i madhi, falënderime të shumta i takojnë Allahut dhe i Lartësuar qoftë Allahu mëngjes dhe mbrëmje (tre herë) \\n(Kërkoj mbrojtjen e Allahut prej shejtanit: prej fryrjes së tij, pëshpëritjes së tij dhe cytjeve të tij.\\n",
        "reference": "Ebu Davudi 1/203, Ibën Maxheh 1/265 dhe Ahmedi 4/85. Gjithashtu, Muslimi shënon ngjashëm me këtë 1/420."
      },
      {
        "id": 31,
        "audio": "/audios/.mp3",
        "arabic": "اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَاوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَاوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ، [وَلَكَ\\n\\nالْحَمْدُ أَنْتَ رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ] [وَلَكَ الْحَمْدُ لَكَ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ] [وَلَكَ الْحَمْدُ أَنْتَ\\n\\nمَلِكُ السَّمَاوَاتِ وَالْأَرْضِ] [لَكَ الْحَمْدُ] [أَنْتَ الْحَقُّ، وَوَعْدُكَ الْحَقُّ، وَقَوْلُكَ الْحَقُّ، وَلِقَاؤُكَ الْحَقُّ، وَالْجَنَّةُ حَقٌّ، وَالنَّارُ\\n\\nحَقٌّ، وَالنَّبِيُّونَ حَقٌّ، وَمُحَمَّدٌ صَلَى اللهُ عَلِيهِ وَسَلَّمَ حَقٌّ، وَالسَّاعَةُ حَقٌّ] [اللّهُـمَّ لَكَ أَسْلَمت ، وَعَلَـيْكَ تَوَكَّلْـت ، وَبِكَ آمَنْـت ، وَإِلَـيْكَ أَنَبْـت ، وَبِـكَ خاصَمْت ، وَإِلَـيْكَ حاكَمْـت. فاغْفِـرْ لي مـا قَدَّمْتُ ، وَما أَخَّـرْت ، وَما أَسْـرَرْت ، وَما أَعْلَـنْت]\\n\\n [أَنْتَ إِلَهِي لَا إِلَهَ إّلَّا أَنْتَ]",
        "latin": "All-llahumme lekel-hamdu Ente Nurus-semavati vel-erdi ve men fi hinne, ve lekel-hamdu Ente Kajjimus-semavati vel-erdi ve men fi hinne [ve lekel-hamdu Ente Rabbus-semavati vel-erdi ve men fi hinne], [ve lekel-hamdu leke Mulkus-semavati vel-erdi ve men fi hinne], [ve lekel-hamdu Ente Málikus-semavati vel-erdi], [ve lekel-hamdu], [Entel-Hakku ve va’dukel-hakku, ve kavlukel-hakku, ve likaukel-hakku, vel-xhenetu hakkun, ven-naru hakkun, ven-nebijjune hakkun, ve Muhammedun   hakkun, ves-saatu hakkun], [All-llahumme leke eslemtu ve alejke tevekeltu, ve bike amentu, ve ilejke enebtu, ve bike hasamtu, ve ilejke hakemtu, fagfirli ma kaddemtu ve ma ehartu, ve ma esrertu ve ma a’lentu], [ Ennte el-Mukaddimu ve Ente el-Muah-hiru la ilahe il-la Ente], [Ente Ilahi la ilahe il-la Ente]",
        "albanian": "O Allahu im, Ty të takon Falënderimi, Ti je Ndriçuesi i qiejve dhe i tokës, si dhe i asaj ç’ka në to, Ty të takon Falënderimi. Ti je ngritës i qiejve dhe i tokës, si dhe asaj ç’ka në to, Ty të takon Falënderimi. Ti je Zot i qiejve dhe i tokës, si dhe i asaj ç’ka në to, Ty të takon Falënderimi. I Yti është Sundimi i qiejve dhe i tokës, si dhe i asaj ç’ka në to, Ty të takon Falënderimi. Ti je Sundues i qiejve dhe i tokës, Ty të takon Falënderimi. Ti je i vërtetë dhe premtimi Yt është i vërtetë, fjala Jote është e vërtetë dhe takimi Yt është i vërtetë, Xheneti është i vërtetë dhe Xhehenemi është i vërtetë, Pejgamberët janë të vërtetë dhe Muhamedi   është i vërtetë, si dhe Kiameti është i vërtetë. O Zoti im, Ty të jam nënshtruar dhe në Ty jam mbështetur, Ty të kam besuar dhe Ty të drejtohem, për Ty hasmohem dhe te Ti kthehem për gjykim, m’i fal mëkatet e mia të mëparshmet dhe të tanishmet, ato që i kam bërë fshehurazi dhe haptazi. Ti je i Pari dhe Ti je i Fundit, s’ka të adhuruar tjetër përveç teje; Ti je Zoti im, s’ka Zot tjetër përveç Teje.",
        "reference": "Buhariu “Fet’hul-Bari” 3/3, 1/116, 13/371, 423, 465, Muslimi në version të shkurtuar ngjashëm me këtë 1/83."
      }
    ]
  },
  {
    "id": 17,
    "chapter_name": "17.Duatë në ruku",
    "invocations": [
      {
        "id": 32,
        "audio": "/audios/017_01.mp3",
        "arabic": "سُبْحَانَ رَبِّيَ الْعَظِيمِ",
        "latin": "Subhane Rabbijel-adhim (3 herë)",
        "albanian": "I Lartësuar qoftë Zoti im i Madhërishëm.",
        "reference": "Transmetojnë autorët e katër suneneve dhe Ahmedi “Sahih et-Tirmidhi” 1/83."
      },
      {
        "id": 33,
        "audio": "/audios/017_02.mp3",
        "arabic": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي",
        "latin": "Subhaneke All-llahumme Rabbena ve bihamdike, All-llahumme-gfir li",
        "albanian": "I Lartësuar qofsh o Allah, Zoti ynë, Ty të takon Falënderimi. O Allah, më fal mua.",
        "reference": "Buhariu 1/99, Muslimi 1/350."
      },
      {
        "id": 34,
        "audio": "/audios/017_03.mp3",
        "arabic": "سُبُّوحٌ، قُدُوسٌ، رَبُّ الْمَلَائِكَةِ وَالرُّوحِ",
        "latin": "Subbuhun, Kudusun Rabbul Melaiketi ver-Ruh",
        "albanian": "I Madhëruar dhe i Shenjtë është Zoti i melaikeve dhe i Xhibrilit.",
        "reference": "Muslimi 1/353, Ebu Davudi 1/230."
      },
      {
        "id": 35,
        "audio": "/audios/017_04.mp3",
        "arabic": "اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ خَشَعَ لَكَ سَمْعِي، وَبَصَرِي وَمُخِّي، وَعَظْمِي، وَعَصَبِي، وَمَا اسْتَقَلَّ بِهِ قَدَمِي",
        "latin": "All-llahumme leke reka’tu, ve bike amentu, ve leke eslemtu, hashe’a leke sem’í ve besari, ve muhhi, ve adhmi, ve asabi ve mes-tekal-le bihi kademi",
        "albanian": "O Allahu im, Ty të jam përulur dhe Ty të besova. Ty të jam nënshtruar; Ty të është përulur me frikërespekt dëgjimi im, shikimi im, truri im, ashti im, nervi im dhe tërë ato që mbajnë këmbët e mia.",
        "reference": "Muslimi 1/534 dhe katër sunenet përveç Ibën Maxhes."
      },
      {
        "id": 36,
        "audio": "/audios/017_05.mp3",
        "arabic": "سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ",
        "latin": "Subhane dhil-xheberuti vel-melekuti vel-kibrijai vel-adhameti",
        "albanian": "I Madhëruar qoftë i Gjithëfuqishmi, Zotëruesi i çdo gjëje, Atij i takon Kryelartësia dhe Madhëria.",
        "reference": "Ebu Davudi 1/230, ngjashëm e shënojnë edhe Nesaiu dhe Ahmedi; senedi i këtij hadithi është i mirë (hasen)."
      }
    ]
  },
  {
    "id": 18,
    "chapter_name": "18.Duatë e ngritjes nga rukuja",
    "invocations": [
      {
        "id": 37,
        "audio": "/audios/018_01.mp3",
        "arabic": "سَمِعَ اللهُ لِمَنْ حَمِدَهُ",
        "latin": "Semi’All-llahu limen hamideh",
        "albanian": "Allahu e dëgjon atë që e falënderoi Atë.",
        "reference": "Buhariu “Fet’hul-Bari” 2/282."
      },
      {
        "id": 38,
        "audio": "/audios/018_02.mp3",
        "arabic": "رَبَّنَا وَلَكَ الْحَمْدُ، حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ",
        "latin": "Rabbena ve lekel-hamd, hamden kethiren tajjiben mubareken fíhi",
        "albanian": "Zoti ynë, Ty të takon Falënderimi, Falënderimi i shumtë, i cili është plotë mirësi dhe bekim.",
        "reference": "Buhariu “Fet’hul-Bari” 2/282."
      },
      {
        "id": 39,
        "audio": "/audios/018_03.mp3",
        "arabic": "مِلْءَ السَّمَاوَاتِ وَمِلْءَ الأَرْضِ وَمَا بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ. أَهْلَ الثَّنَاءِ وَالْمَجْدِ، أَحقُّ مَا قَالَ الْعَبْدُ،\\n\\nوَكُلُّنَا لأضكَ عَبْدٌ. اللَّهُمَّ لَا مَنِعَ لَمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
        "latin": "Mil’es-semaváti ve mil’el-erdi ve ma bejnehuma, ve mil’e ma shi’te min shejin ba’ëdu. Ehleth-thenai vel-mexhdi, ehakku ma kalel-abdu, ve kul-luna Leke abdun. All-llahumme la mani’a lima a’ëtajte, ve la mu’ëtije lima mena’ëte, ve la jenfe’u dhel-xheddi minkel-xheddu",
        "albanian": "O Zoti im, Ty të përket Falënderimi aq sa janë qiejt dhe toka, aq sa ka ndërmjet tyre, si dhe aq sa Ti dëshiron prej gjërave të tjera. O pronar i Lavdisë dhe i Madhështisë, Ti meriton lavdi dhe madhështi më shumë se ç’thotë robi Yt. O Zoti im, ne të gjithë jemi robërit Tu: Nuk ka kush e ndalon atë që Ti e jep, e s’ka kush e jep atë që Ti e ndalon; s’ka dobi i pasuri prej pasurisë, sepse pasuria e tij është prej Teje.",
        "reference": "Muslimi 1/346."
      }
    ]
  },
  {
    "id": 19,
    "chapter_name": "19.Duatë në sexhde",
    "invocations": [
      {
        "id": 40,
        "audio": "/audios/019_01.mp3",
        "arabic": "سُبْحَانَ رَبِّيَ الأَعْلَى",
        "latin": "Subhane Rabbijel-a’la (3 herë)",
        "albanian": "I Madhëruar qoftë Zoti im i Lartë.",
        "reference": "Transmetojnë autorët e katër suneneve dhe Ahmedi. “Sahih et-Tirmidhi” 1/83."
      },
      {
        "id": 41,
        "audio": "/audios/019_02.mp3",
        "arabic": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي",
        "latin": "Subhaneke All-llahumme Rabbena ve bihamdike, All-llahumme-gfir li",
        "albanian": "I Madhëruar qofsh o Allah, Zoti ynë, Ty të takon Falënderimi. O Allah, më fal mua.",
        "reference": "Buhariu 1/99, Muslimi 1/350."
      },
      {
        "id": 42,
        "audio": "/audios/019_03.mp3",
        "arabic": "سُبُّوحٌ، قُدُّسٌ، رَبُّ الْمَلَائِكَةِ وَالرُّوحِ",
        "latin": "Subbuhun, Kudusun Rabbul Melaiketi ver-Ruh",
        "albanian": "I Madhëruar dhe i Shenjtë është Zoti i melaikeve dhe i Xhibrilit.",
        "reference": "Muslimi 1/353, Ebu Davudi 1/230."
      },
      {
        "id": 43,
        "audio": "/audios/019_04.mp3",
        "arabic": "اللَّهُمَّ لَكَ سَجَدْتُ وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِيَ لِلَّذِي خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللهُ\\n\\nأَحْسَنُ الْخَالِقِينَ",
        "latin": "All-llahumme Leke sexhed-dtu ve bike amentu ve Leke eslemtu, sexhede vexh-hije lil-ledhi halekahu, ve savverehu ve shekka sem’ahu ve besarehu, tebareke All-llahu Ahsenul-Halikin",
        "albanian": "O Allahu im, Ty të bëj sexhde, Ty të besoj, Ty të nënshtrohem, fytyra ime të bën sexhde vetëm Ty, o Allah sepse Ti e krijove dhe e zbukurove, e pajise me dëgjim dhe shikim, i Madhëruar qoftë Allahu, i Cili është Krijuesi më i Mirë.",
        "reference": "Muslimi 1/534 dhe të tjerët."
      },
      {
        "id": 44,
        "audio": "/audios/019_05.mp3",
        "arabic": "سُبْحَانَ ذِي الْجَبَرْوتِ، وَالْمَلَكُوتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ",
        "latin": "Subhane dhil-xheberuti vel-melekuti vel-kibrijai vel-adhameti",
        "albanian": "I Madhëruar qoftë i Gjithëfuqishmi, Zotëruesi i çdo gjëje dhe vetëm Atij i takon Kryelartësia dhe Madhëria.",
        "reference": "Ebu Davudi 1/230, Nesaiu dhe Ahmedi; senedi i këtij hadithi është hasen (i mirë)."
      },
      {
        "id": 45,
        "audio": "/audios/019_06.mp3",
        "arabic": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ وَعَلَانِيَتَهُ وَسِرَّهُ",
        "latin": "All-llahumme-gfir li dhenbi kul-lehu, dikkahu ve xhil-lehu, ve evvelehu ve ahirehu ve alanijetehu ve sirrehu",
        "albanian": "O Allahu im, m’i fal mua të gjitha mëkatet e mia, të voglat dhe të mëdhatë, të parat dhe të fundit, të dukshmet dhe të fshehtat.",
        "reference": "Muslimi 1/350."
      },
      {
        "id": 46,
        "audio": "/audios/019_07.mp3",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مَنْ عُقُوبَتِكَ، وَاَعُوذُ بِكَ مِنْكَ، لَا أُحصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ\\n\\nعَلَى نَفْسِكَ",
        "latin": "All-llahumme inni eudhu bi ridake min sehatik, ve bi muafatike min ukubetik, ve eudhu bike minke, la uhsi thenaen Alejke, Ente kema ethnejte ala Nefsike",
        "albanian": "O Allahu im, kërkoj strehim përmes kënaqësisë Tënde nga hidhërimi Yt, si dhe me faljen Tënde nga dënimi Yt. Kërkoj mbrojtjen Tënde nga Ti, unë nuk mund të të madhëroj aq sa meriton Ti; Ti je i Madhëruar ashtu siç e ke përshkruar Vetveten.",
        "reference": "Muslimi 1/532."
      }
    ]
  },
  {
    "id": 20,
    "chapter_name": "20.Duatë në uljen mes dy sexhdeve",
    "invocations": [
      {
        "id": 47,
        "audio": "/audios/020_01.mp3",
        "arabic": "رَبِّ اغْفِرْ لِي رَبِّ اغْفِرْ لِي",
        "latin": "Rabbi-gfir li, Rabbi-gfir li",
        "albanian": "Zoti im, më falë mua. Zoti im, më falë mua!",
        "reference": "Ebu Davudi 1/23. Shih “Sahih Ibën Maxheh” 1/148."
      },
      {
        "id": 48,
        "audio": "/audios/020_02.mp3",
        "arabic": "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَاجْبُرْنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي",
        "latin": "All-llahumme-gfir li ver-hamni, ve-hdini, vexh-burni, ve afini ver-zukni, ver-feani",
        "albanian": "O Allahu im, më fal, më mëshiro, më udhëzo, më forco në këtë fe, më jep shëndet, më jep furnizim dhe më ngritë lartë.",
        "reference": "Transmetojnë autorët e katër suneneve përveç Nesaiut, “Sahih et-Tirmidhi” 1/90 dhe “Sahih Ibën Maxheh” 1/148."
      }
    ]
  },
  {
    "id": 21,
    "chapter_name": "21.Duatë e sexhdes gjatë leximit të kuranit",
    "invocations": [
      {
        "id": 49,
        "audio": "/audios/021_01.mp3",
        "arabic": "سَجَدَ وَجْهِيَ لِلَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ، فَتَبَارَكَ اللهُ أَحسَنُ الْخَالِقِينَ",
        "latin": "Sexhede vexhhije lil-ledhi halekahu ve shekka sem’ahu ve besarehu bi havlihi ve kuvvetihi [Fetebareke All-llahu Ahsenul-Halikin]",
        "albanian": "Fytyra ime i bën sexhde vetëm Atij, i Cili e krijoi dhe e pajisi atë me dëgjim dhe shikim, me lëvizjen dhe fuqinë e Tij; i Madhëruar qoftë Allahu, i Cili është Krijuesi më i Mirë.",
        "reference": "Tirmidhiu 2/474, Ahmedi 6/30, Hakimi, thotë se hadithi është i vërtetë. Me këtë pajtohet Dhehebiu 1/220. Shtojca pas pikëpresjes është e Dhehebiut."
      },
      {
        "id": 50,
        "audio": "/audios/021_02.mp3",
        "arabic": "اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أَجْراً، وَضَعْ عَنِّي بِهَا وِزْراً، وَاجْعَلْهَا لِي ذُخْراً، وَتَقَبَّلْهَا مِنِّي كَمَا تَقَبَّلْتَهَا مَنْ عَبْدِكَ دَاوُدَ",
        "latin": "All-llahumme uktub li biha indeke exhren, ve da’anni biha vizren, vexh’alha li indeke dhuhren, ve tekabbelha minni kema tekabbelteha min abdike Davud",
        "albanian": "O Allahu im, më shkruaj mua me këtë sexhde tek Ti shpërblim dhe largoj nga unë mëkatet, bëje që me këtë sexhde të kem dobi tek Ti, ma prano mua këtë sexhde, ashtu siç e ke pranuar prej robit tënd Davudit.",
        "reference": "Tirmidhiu 2/473 dhe Hakimi, i cili thotë se hadithi është i vërtetë. Me këtë pajtohet edhe Dhehebiu 1/219."
      }
    ]
  },
  {
    "id": 22,
    "chapter_name": "22.Teshehudi",
    "invocations": [
      {
        "id": 51,
        "audio": "/audios/022_01.mp3",
        "arabic": "التَّحِيّـاتُ للهِ وَالصَّلَـواتُ والطَّيِّـبات ، السَّلامُ عَلَيـكَ أَيُّهـا النَّبِـيُّ وَرَحْمَـةُ اللهِ وَبَرَكـاتُه ، السَّلامُ عَلَيْـنا وَعَلـى عِبـادِ كَ الصَّـالِحـين. أَشْـهَدُ أَنْ لا إِلـهَ إِلاّ الله ، وَأَشْـهَدُ أَنَّ مُحَمّـداً عَبْـدُهُ وَرَسـولُه",
        "latin": "Et-tehijjatu lil-lahi ves-salavatu vet-tajjibatu, es-selamu alejke ejjuhen-nebijju ve rahmetull-llahi ve berekatuhu, es-selamu alejna ve ala ibadil-lahis-salihin. Eshhedu en la Ilahe il-lAll-llahu ve eshhedu enne Muhammeden abduhu ve resuluhu",
        "albanian": "Nderimi, lutjet dhe të gjitha mirësitë i takojnë Allahut. Le të jetë paqja mbi ty o i Dërguar i Zotit, paqja le të jetë mbi të gjithë ne dhe mbi të gjithë robërit e mirë të Allahut. Dëshmoj se nuk ka të adhuruar tjetër përveç Allahut dhe dëshmoj se Muhamedi është robi dhe i Dërguari i Tij.",
        "reference": "Buhariu “Fet’hul-Bari” 1/13, Muslimi 1/301."
      }
    ]
  },
  {
    "id": 23,
    "chapter_name": "23.Salavatet mbi të dërguarin",
    "invocations": [
      {
        "id": 52,
        "audio": "/audios/023_01.mp3",
        "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكَ عَلَى مُحَمَّدٍ وَعَلَى آلِ\\n\\nمُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
        "latin": "All-llahumme sal-li ala Muhammedin ve ala ali Muhammed, kema sal-lejte ala Ibrahime ve ala ali Ibrahim inneke Hamidun Mexhid. All-llahumme barik ala Muhammedin ve ala ali Muhammed kema barekte ala Ibrahime ve ala ali Ibrahim inneke Hamidun Mexhid",
        "albanian": "O Allahu im, ki mëshirë ndaj Muhamedit dhe familjes së tij, siç pate mëshirë ndaj Ibrahimit dhe familjes së tij, se vërtet Ti je i Lavdëruar dhe i Madhëruar.\\nO Allahu im, bekoje Muhamedin dhe familjen e tij, siç e bekove Ibrahimin dhe familjen e tij, se vërtet Ti je i Lavdëruar dhe i Madhëruar.",
        "reference": "Buhariu “Fet’hul-Bari” 6/408."
      },
      {
        "id": 53,
        "audio": "/audios/023_02.mp3",
        "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكَ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ،\\n\\nكَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
        "latin": "All-llahumme sal-li ala Muhammedin ve ala ezvaxhihi ve dhurrijjetihi, kema sal-lejte ala ali Ibrahim, ve barik ala Muhammedin ve ala ezvaxhihi ve dhurrijjetihi, kema barekte ala ali Ibrahime inneke Hamidun Mexhid",
        "albanian": "O Allahu im, ki mëshirë ndaj Muhamedit, bashkëshorteve të tij dhe pasardhësve të tij, siç pate mëshirë ndaj familjes së Ibrahimit, si dhe bekoje Muhamedin, bashkëshortet e tij dhe pasardhësit e tij, siç e bekove familjen e Ibrahimit. Vërtet, Ti je i Lavdëruar dhe i Madhëruar.",
        "reference": "Buhariu “Fet’hul-Bari” 6/407 dhe Muslimi 1/306; version i Muslimit."
      }
    ]
  },
  {
    "id": 24,
    "chapter_name": "24.Duatë në teshehudin e fundit, para dhënies selam",
    "invocations": [
      {
        "id": 54,
        "audio": "/audios/024_01.mp3",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
        "latin": "All-llahumme inni eudhu bike min adhabil-kabr, ve min adhabi xhehenem, ve min fitnetil-mahja vel-memat, ve min fitnetil-Mesihid-dexh-xhal",
        "albanian": "O Allahu im, kërkoj mbrojtjen Tënde prej dënimit të varrit dhe prej dënimit të Xhehenemit, si dhe kërkoj mbrojtjen Tënde nga sprovat e jetës dhe të vdekjes, si dhe nga sprova e Dexhallit.",
        "reference": "Buhariu 2/102, Muslimi 1/412; version i Muslimit."
      },
      {
        "id": 55,
        "audio": "/audios/024_02.mp3",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ. اللَّهُمَّ\\n\\nإِنِّي أَعُوذُ بِكَ مِنْ الْمَأْثَمِ وَالْمَغْرَمِ",
        "latin": "All-llahumme inni eudhu bike min adhabil-kabr, ve eudhu bike min fitnetil-Mesihid-dexhxhal, ve eudhu bike min fitnetil-mahja vel-memat. All-llahumme inni eudhu bike minel-me’themi vel-magrem",
        "albanian": "O Allahu im, kërkoj mbrojtjen Tënde prej dënimit të varrit, nga sprova e Dexhalit dhe nga sprovat e jetës dhe të vdekjes. O Allahu im, kërkoj mbrojtjen Tënde nga mëkatet dhe nga borxhet ndaj njerëzve.",
        "reference": "Buhariu 1/202, Muslimi 1/412."
      },
      {
        "id": 56,
        "audio": "/audios/.mp3",
        "arabic": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ\\n\\nالرَّحِيمُ",
        "latin": "All-llahumme inni dhalemtu nefsi dhulmen kethiren, ve la jagfirudh-dhunube il-la Ente, fagfirli magfireten min indeke ver-hamni inneke Entel-Gafurur-Rahim",
        "albanian": "O Allahu im, vetes i kam bërë dëm dhe shumë padrejtësi, mëkatet nuk i falë askush tjetër përveç Teje, andaj më fal mua me faljen Tënde dhe më mëshiro mua. Vërtet, Ti je Falës dhe i Mëshirshëm.",
        "reference": "Buhariu 8/168, Muslimi 4/2078."
      },
      {
        "id": 57,
        "audio": "/audios/024_04.mp3",
        "arabic": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي. أَنْتَ الْمُقَدِّمُ،\\n\\nوَأَنْتَ الْمُؤَخِّرُ لَا إِلَعَ إِلَّا أَنْتَ",
        "latin": "All-llahumme-gfir li ma kaddemtu ve ma ahhartu, ve ma esrertu ve ma a’ëlentu, ve ma esreftu ve ma Ente A’ëlemu bihi minni. Entel-Mukaddimu ve Entel-Muahhiru, La Ilahe il-la Ente",
        "albanian": "O Allahu im, m’i fal mëkatet e mia të mëparshme dhe të tanishme, ato që i kam bërë fshehurazi dhe haptazi, si dhe ato me të cilat e kam ngarkuar veten, e për të cilat Ti e di më mirë se unë; Ti je i Pari dhe Ti je i Fundit, nuk ka hyjni që meriton të adhurohet përveç Teje.",
        "reference": "Ebu Davudi 2/86, Nesaiu 3/53. Hadith i vërtetë sipas shejh Albanit, shih “Sahih Ebu Davud” 1/284."
      },
      {
        "id": 58,
        "audio": "/audios/.mp3",
        "arabic": "اللَّهُمَّ أَعِنَّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ",
        "latin": "All-llahumme einni ala dhikrike ve shukrike ve husni ibadetike",
        "albanian": "O Allahu im, më ndihmo të të përmend e të të falënderoj, si dhe më mundëso që të të adhuroj sa më mirë.",
        "reference": "Ebu Davudi 2/86, Nesaiu 3/53. Sahih sipas shejh Albanit, shih “Sahih Ebu Davud” 1/284."
      },
      {
        "id": 59,
        "audio": "/audios/.mp3",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ\\n\\nالدُّنْيَا وَعَذَابِ الْقَبْرِ",
        "latin": "All-llahumme inni eudhu bike minel-buhli, ve eudhu bike minel-xhubni, ve eudhu bike min en uredde ila erdhelil-umri, ve eudhu bike min fitnetid-dunja ve adhabil-kabr",
        "albanian": "O Allahu im, kërkoj mbrojtjen Tënde nga koprracia dhe nga përtacia, si dhe kërkoj mbrojtjen Tënde nga matufosja , nga sprovat e jetës si dhe nga dënimi i varrit.",
        "reference": "Humbje e kujtesës dhe e shkathtësisë së të menduarit (sh.p.).\\nEbu Davudi, po ashtu shih “Sahih Ibën Maxheh” 2/328.\\n"
      },
      {
        "id": 60,
        "audio": "/audios/024_07.mp3",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
        "latin": "All-llahumme inni es’elukel-xhenete, ve eudhu bike minen-nar",
        "albanian": "O Allahu im, kërkoj prej Teje xhenetin dhe kërkoj prej Teje mbrojtjen Tënde nga zjarri.",
        "reference": "Buhariu “Fet’hul-Bari” 6/35."
      },
      {
        "id": 61,
        "audio": "/audios/.mp3",
        "arabic": "اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْراً لِي وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْراً لِي، اللَّهُمَّ\\n\\nإِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ،\\n\\nوَأَسْأَلُكَ نَعِيماً لَا يَنْفَذُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضِا بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ،\\n\\nوَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الْإِيمَانِ\\n\\nوِاجْعَلْنَا هُدَاةً مُهْتَدِينَ",
        "latin": "All-llahumme bi ilmikel-gajb ve kudretike alel-halki ahjini ma alimtel-hajate hajren li ve teveffeni idha alimtel-vefate hajren li, All-llahumme inni es’eluke hashjeteke fil-gajbi vesh-shehadeti, ve es’eluke kelimetel-hakki fir-rida vel-gadab, ve es’elukel-kasde fil-gina vel-fakr, ve es’eluke ne’iimen la jenfedu ve es’eluke kur-rete ajnin la tenkatiu, ve es’eluker-rida ba’del-kada, ve es’eluke berdel-ajshi ba’del-mevt, ve es’eluke ledhdheten-nedhari ila vexhhike vesh-shevka ila likaike fi gajri darrae mudirretin ve la fitnetin mudil-letin, All-llahumme zejjinna bi zinetil-iman, vexh’alna hudaten muhtediin",
        "albanian": "O Allahu im, të lus me diturinë Tënde mbi të fshehtën dhe me fuqinë Tënde mbi krijesat, që të ma zgjatësh jetën, nëse jeta ime është më e mirë për mua, si dhe të lutem të më bësh të vdekur, nëse vdekja ime është më e mirë për mua. Allahu im, më bëj të të frikësohem në vetmi dhe në publik; më bëj që ta flas të vërtetën kur jam i disponuar dhe kur jam i hidhëruar, të kërkoj që të jem i matur gjatë varfërisë dhe pasurisë, të lutem më jep begati të pashtershme, të lutem të më bësh të kënaqur me atë që më ke caktuar, më jep jetë të qetë pas vdekjes, më dhuro shikim të këndshëm në Fytyrën Tënde dhe mallëngjim për takimin Tënd pa vështirësi dhe sprovim. O Allahu im, na zbukuro neve me bukurinë e besimit dhe na bëj udhëzues dhe udhërrëfyes për të tjerët.",
        "reference": "Nesaiu 4/54, 55, Ahmedi 4/364; Albani këtë hadith e ka bërë të vërtetë “Sahih en-Nesai” 1/280."
      },
      {
        "id": 62,
        "audio": "/audios/.mp3",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللهُ بِأَنَّكَ الْوَاحِدُ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي\\n\\nإِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
        "latin": "All-llahumme inni es’eluke ja All-llahu bi enneke El-Vahidul-Ehad Es-Samedul-ledhi lem jelid ve lem juled ve lem jekun Lehu kufuven ehad, En tagfire li dhunubi ineke Entel-Gafurur-Rahim",
        "albanian": "O Allahu im, unë të lutem Ty, duke dëshmuar se vërtetë Ti je Një dhe i Vetëm, Ti nuk ke nevojë për askënd, Ti nuk e ke lindur askënd, e as nuk je lindur prej ndokujt, Ti nuk përngjason me askënd, të lutem të m’i falësh mëkatet, sepse vërtet Ti je Falës dhe Mëshirues.",
        "reference": "Nesaiu 3/52, Ahmedi 4/338; Albani këtë hadith e ka bërë të vërtetë “Sahih En-Nesai” 1/280."
      },
      {
        "id": 63,
        "audio": "/audios/.mp3",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لَا إِلهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيعَ السَّماوَاتِ وَالْأَرْضِ يَا ذَا الْجَلَالِ\\n\\nوَالْإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
        "latin": "All-llahumme inni es’eluke bi enne Lekel-hamdu la Ilahe il-la Ente Vahdeke la sherike Lek, El-Mennanu, ja Bedi’us-semavati vel- erdi, ja dhel-Xhelali vel-Ikram, ja Hajju ja Kajjumu, es’elukel-xhenete ve eudhu bike minen-nar",
        "albanian": "O Allahu im, unë të lutem Ty, se me të vërtetë Ty të takon Falënderimi, nuk ka të adhuruar tjetër përveç Teje, je Një, je i Vetëm dhe i pa rival, Ti je Bamirësi më i mirë. O Krijues i qiejve dhe i tokës, Ti je i Madhërishëm dhe i Ndershëm, O i Gjallë Përgjithmonë, o Mbikëqyrës i çdo gjëje, Të lutem të ma dhurosh Xhenetin dhe kërkoj mbrojtjen Tënde prej Zjarrit.",
        "reference": "Transmetojnë autorët e katër Suneneve; “Sahih Ibën Maxheh” 2/329."
      },
      {
        "id": 64,
        "audio": "/audios/024_11.mp3",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللهُ لَا إِلهَ إِلَّا أَنْتَ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ",
        "latin": "All-llahumme inni es’luke bi enni eshhedu enneke Ente All-llahu La i-Ilahe il-la Ente El-Ehadus-Samed el-ledhi lem jelid ve lem juled ve lem jekun lehu kufuven ehad",
        "albanian": "O Allahu im, unë të lutem Ty duke dëshmuar se Ti je Allahu, nuk ka të adhuruar tjetër me të drejtë përveç Teje, i Vetëm dhe i panevojshëm për askënd, i Cili nuk ka lindur askënd e as nuk është i lindur prej askujt. Ti nuk përngjason me askënd.",
        "reference": "Ebu Davudi 2/62, Tirmidhiu 5/515, Ibën Maxheh 2/1267, Ahmedi 5/360, “Sahih Ibën Maxheh” 2/329 dhe “Sahih et-Tirmidhi” 3/163, Muslimi 1/414."
      }
    ]
  },
  {
    "id": 25,
    "chapter_name": "25.Dhikri pas selamit në përfundim të farzit të çdo namazi",
    "invocations": [
      {
        "id": 65,
        "audio": "/audios/025_01.mp3",
        "arabic": "أَسْتَغْفِرُ اللهَ ثَلَاثاً اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
        "latin": "Estagfirullah (3 herë). All-llahumme entes-selamu ve minkes-selamu tebarekte ja dhel xhelali vel-ikram",
        "albanian": "Kërkoj falje nga Allahu. O Allahu im, Ti je shpëtimi dhe nga Ti vjen shpëtimi, i Lartësuar qofsh o zotërues i Madhërisë dhe i Nderit.",
        "reference": "Muslimi 1/414."
      },
      {
        "id": 66,
        "audio": "/audios/025_02.mp3",
        "arabic": "لَا إِلهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ\\n\\nلِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
        "latin": "La ilahe il-lAll-llahu vahdehu la sherike leh, lehul mulku ve lehul hamdu ve huve ala kul-li shejin kadir. All-llahume la mani’a lima a’tajte ve la m’utije lima mena’te ve la jenfe’u dhel xheddi minkel xheddu",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut, të Vetëm e i pa rival. Atij i takon Sundimi dhe Lavdërimi, Ai është i Plotfuqishmi mbi çdo send. O Allahu im, nuk ka kush e ndalon atë që Ti e ke dhënë dhe nuk ka kush e jep atë që Ti e ke ndaluar; tek Ti nuk ka vlerë dobia e askujt, ngase çdo dobi vjen prej Teje.",
        "reference": "Buhariu 1/255 dhe Muslimi 1/414."
      },
      {
        "id": 67,
        "audio": "/audios/025_03.mp3",
        "arabic": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ، لَا إِلَهَ إِلَّا\\n\\nاللهُ، وَلَا نَعْبُدُ إِلَّا إِيَّاهُ، لَه النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلَّا اللهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ",
        "latin": "La ilahe il-lAll-llahu vahdehu la sherike leh, lehul mulku ve lehul hamdu ve huve ala kul-li shejin kadir, la havle ve la kuvete il-la bil-lah, la ilahe il-lAll-llahu ve la na’budu il-la ijjahu lehun-ni’metu ve lehul-fadlu ve lehuth-thenaul hasen. La ilahe il-lAll-llahu muhlisine lehud-din ve lev kerihel-kafirun",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut, të Vetëm e i pa rival. Atij i takon Sundimi dhe Lavdërimi, Ai është i Gjithëfuqishmi mbi çdo gjë. Nuk ka ndryshim e as forcë pa ndihmën e Allahut; nuk ka Zot tjetër përveç Allahut dhe nuk e adhurojmë askënd tjetër përveç Tij, dhuntitë dhe mirësitë janë prej Tij dhe vetëm Atij i takon lavdërimi më i mirë. Nuk ka të adhuruar tjetër përveç Allahut. Me sinqeritet Atij i besojmë dhe i nënshtrohemi, edhe pse këtë e urrejnë pabesimtarët.",
        "reference": "Shënon Muslimi 1/415."
      },
      {
        "id": 68,
        "audio": "/audios/025_04.mp3",
        "arabic": "سُبْحَانَ اللهِ، وَالْحَمْدُ للهِ، وَاللهُ أَكْبَرُ ثَلَاثاً وَثَلَاثِينَ  لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ\\n\\nوَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        "latin": "SubhanAll-llah, vel-hamdulil-lah, vAll-llahu Ekber (33 herë). La ilahe il-lAll-llahu vahdehu la sherike leh, lehul mulku ve lehul hamdu ve huve ala kul-li shejin kadir",
        "albanian": "I pastër është Allahu nga çdo e metë, Falënderimi i përket vetëm Allahut,       Allahu është më i Madhi. Nuk ka hyjni që meriton të adhurohet përveç Allahut, të Vetëm e i pa rival. Atij i takon Sundimi dhe Lavdërimi dhe Ai është i Gjithëfuqishëm mbi çdo gjë.",
        "reference": "Muslimi 1/418, “Kush e thotë këtë pas çdo namazi do t’i falen mëkatet edhe nëse ato janë sa shkuma e detit.” Po ashtu Ebu Davudi 2/86, Nesaiu 3/68, “Sahih et-Tirmidhi”."
      },
      {
        "id": 69,
        "audio": "/audios/025_05.mp3",
        "arabic": "بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ \"قُلْ هُوَ اللهُ أَحَدٌ ۞ اللهُ الصَّمَدُ ۞ لَمْ يَلِدْ وَلَمْ يُولَدْ ۞ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ",
        "latin": "Kul huvAll-llahu ehad, All-llahus-samed, lem jelid ve lem juled, ve lem jekun lehu kufuven ehad",
        "albanian": "Pas çdo namazi nga një herë, kurse pas namazit të sabahut dhe akshamit nga tri herë. \\nThuaj: “Ai është Allahu, Një dhe i Vetëm! Allahu është Absoluti, të Cilit i përgjërohet gjithçka në amshim. Ai as nuk lind, as nuk është i lindur. Dhe askush nuk është i barabartë (a i krahasueshëm) me Atë!”\\n",
        "reference": "Ebu Davudi 2/86, Nesaiu 3/68, Sahih et-Tirmidhi 3/182: “Kush i thotë këto sure tri herë në mëngjes dhe në mbrëmje i mjaftojnë për çdo gjë”."
      },
      {
        "id": 70,
        "audio": "/audios/025_06.mp3",
        "arabic": "بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ \"قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ۞ مِنْ شَرِّ مَا خَلَقَ ۞ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ۞ وَمِنْ شَرِّ النَّفَّاثَاتِ\\n\\nفِي الْعُقَدِ ۞ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ",
        "latin": "Kul eudhu bi Rabbil felek, min sherri ma halek, ve min sherri gasikin idha vekab, ve min sherrin-nef-fathati fil ukad, ve min sherr-rri hasidin idha hased",
        "albanian": "Thuaj: “Kërkoj mbështetje te Zoti i agimit, që të më mbrojë nga sherri i gjithçkaje që Ai ka krijuar dhe nga sherri i natës, kur kaplon terri dhe nga sherri i falltarëve, që fryjnë në nyje (duke bërë magji) dhe nga sherri i smirëziut, kur vepron me smirë.”",
        "reference": ""
      },
      {
        "id": 71,
        "audio": "/audios/025_07.mp3",
        "arabic": "بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ \"قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۞ مَلِكِ النَّاسِ ۞ إِلَهِ النَّاسِ ۞ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۞ الَّذِي\\n\\nيُوَسْوِسُ فِي صُدُورِ النَّاسِ ۞ مِنَ الْجِنَّةِ وَالنَّاسِ",
        "latin": "Kul eudhu bi Rabbin-nas, melikin-nas, ilahin-nas, minsherr-rril vesvasil-han-nas, eledhi juvesvisu fi sudurin-nas, minel xhin-neti ven-nas",
        "albanian": "Thuaj: “Kërkoj mbështetje te Zoti i njerëzve, Sundimtari i njerëzve, i Adhuruari (i vetëm me të drejtë) i njerëzve, nga sherri i djallit cytës që fshihet (pasi cyt) e që hedh dyshime në gjokset e njerëzve, (qoftë ai djall) prej xhindeve apo njerëzve!”",
        "reference": ""
      },
      {
        "id": 72,
        "audio": "/audios/025_08.mp3",
        "arabic": "اللهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا\\n\\nبِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا\\n\\nيَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
        "latin": "All-llahu La Ilahe il-la huvel-Hajjul-Kajjumu, la te’hudhuhu sinetun ve la nevmun, lehu ma fis-semavati ve ma fil-erdi, men dhel-ledhi jeshfe’u indehu il-la bi idhnihi, ja’lemu ma bejne ejdihim ve ma halfehum ve la juhitune bi shej’in min ilmihi il-la bima shae vesi’a Kursijjuhus-semavati vel-erda, ve la jeuduhu hifdhuhuma ve huvel-Alijjul-Adhim (Pas çdo namazi farz)",
        "albanian": "Allahu është Një, nuk ka Zot tjetër përveç Atij, Ai është Mbikëqyrës i përhershëm dhe i përjetshëm. Atë nuk e zë as kotja as gjumi, gjithçka ka në qiej dhe në tokë është vetëm e Tij. Askush nuk mund të ndërmjetësojë tek Ai, përveç me lejen e Tij? Ai di të tashmen që është pranë tyre dhe të ardhmen. Nga ajo që Ai di, të tjerët dinë vetëm aq sa Ai ka dëshiruar. Kursija e Tij përfshin qiejt dhe tokën, kurse kujdesi i Tij ndaj të dyjave nuk i vjen rëndë, Ai është më i Larti, më i Madhi.",
        "reference": "“Kush e lexon Ajetul kursinë pas çdo namazi farz nuk e pengon asgjë që të hyjë në Xhenet përveç vdekjes.” Nesaiu në librin “Amel el-Jevmi ve Lejleh” hadithi nr. 100, gjithashtu Ibën Sunnijj Hadithi nr. 121. I vërtetë sipas shejh Albanit. Shih “Sahih el-Xhamiu” 5/339 dhe “Silsileh Ehadith es-Sahiha” 2/697."
      },
      {
        "id": 73,
        "audio": "/audios/025_09.mp3",
        "arabic": "لَا إِلَهَ إِلَّا اللهُ وَحَدْهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        "latin": "La Ilahe il-lAll-llahu vahdehu la sherike leh, lehul mulku ve lehul hamdu juhji ve jumitu ve huve ala kul-li shej’in kadir. (Dhjetë herë pas namazit të sabahut dhe të akshamit.)",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut, të Vetëm e i pa rival. Atij i takon Sundimi dhe Lavdërimi, Ai jep jetë dhe vdekje dhe Ai është i Gjithëfuqishëm mbi çdo gjë.",
        "reference": "Tirmidhiu (5/115) dhe Ahmedi (4/227). Shih “Zadul-Mead” 1/300."
      },
      {
        "id": 74,
        "audio": "/audios/025_10.mp3",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً",
        "latin": "All-llahume inni es‘eluke ilmen nafi’an ve rizkan tajjiben ve amelen mutekabbelen. (Pas selamit në namazin e sabahut)",
        "albanian": "O Allahu im, të lutem më jep dituri të dobishme dhe furnizim të mirë, si dhe të lutem Të m’i pranosh veprat e mia.",
        "reference": "Ibën Maxheh dhe të tjerët “Sahih Ibën Maxheh” 1/152 dhe “Mexhmeuz-Zevaid” 10/111."
      }
    ]
  },
  {
    "id": 26,
    "chapter_name": "26.Duaja e namazit istihare",
    "invocations": [
      {
        "id": 75,
        "audio": "/audios/026_01.mp3",
        "arabic": "قَالَ جَابرُ بْنُ عَبْدِ اللهِ  : كَانَ رسُولُ اللهِ   يُعَلِّمُنَا الْاسْتِخَارَةَ فِي الْأُمُورِ كُلِّهَا كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ، يَقُولُ: إِذَا هَمَّ أَحَدُكُمْ بِالْأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ مِنْ غَيْرِ الْفَرِيضَةِ، ثُمَّ لْيَقُلْ: اَللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ العَظِيمِ؛ فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ، وَتَعْلَمُ وَلاَ أَعْلَمُ، وَأَنْتَ عَلاَّمُ الغُيُوبِ، اَللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأمْرَ- وَيُسَمِّي حَاجَتَهُ - خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي – أَوْ قَالَ: عَاجِلِهِ وَآجِلِهِ - فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي – أَوْ قَالَ: عَاجِلِهِ وَآجِلِهِ – فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ أَرْضِنِي بِهِ",
        "latin": "All-llahume inni estehiruke bi ilmike ve estakdiruke bi kudretike ve es’eluke min fadlikel-adhim, fe inneke takdiru ve la akdiru, ve ta’lemu ve la a’ëlemu ve ente al-lamul gujub. All-llahume in kunte ta’ëlemu enne hadhel emru - (e emërton nevojën e tij) - hajrun li fi dini ve me’ashi ve akibeti emrí ve axhilihi ve axhilihi fakdirhu li ve jessirhu li thumme barik li fihi. Ve in kunte ta’ëlemu enne hadhel emru - (e emërton nevojën e tij) - sherrun li fi dini ve me’ashi ve akibeti emri ve axhilihi ve axhilihi, fasrifhu anni vesrifni anhu vakdir li el-hajre hajthu kane thumme erdini bihi",
        "albanian": "Shënohet nga Xhabir Ibën Abdullahu  i cili ka thënë: “I Dërguari i Allahut na mësonte duanë e istihares për çdo çështje, sikurse na i mësonte suret e Kuranit dhe thoshte: “Kur dikush prej jush dëshiron të vendos për një punë me rëndësi, le t’i falë dy rekate namaz dhe pastaj le të thotë: \"O Allahu im, me diturinë Tënde kërkoj mbarësi. Kërkoj ndihmë prej fuqisë Tënde; kërkoj prej të mirave Tua të shumta sepse Ti ke mundësi kurse unë nuk kam mundësi; Ti di çdo gjë kurse unë nuk di asgjë, Ti je Ai që i di të fshehtat. O Allahu im, nëse kjo punë e imja (e emërton nevojën e tij), është e dobishme për fenë dhe jetën time, për kohën e tashme dhe të ardhmen, ma mundëso mua që të realizohet kjo, ma lehtëso mua këtë dhe më beko në të. E nëse kjo punë është e dëmshme për fenë dhe jetën time, për kohën e tashme dhe të ardhmen largoje këtë nga unë dhe më largo mua nga kjo, e më përcakto mbarësinë kudo që të jetë dhe më bëj të jem i kënaqur me të.\"",
        "reference": "Kush kërkon ndihmë nga Allahu (bën Istihare), gjithashtu kush konsultohet me njerëz besimtarë dhe bëhet i vendosur në pikësynimin e tij, nuk do të pendohet.\\nBuhariu 7/162. \\n“Konsultohu me ta për të gjitha çështjet, e kur të vendosësh, atëherë mbështetu në Allahun.” Ali Imran, 159."
      }
    ]
  },
  {
    "id": 27,
    "chapter_name": "27.Dhikri i mëngjesit dhe mbrëmjes",
    "invocations": [
      {
        "id": 76,
        "audio": "/audios/027_02.mp3",
        "arabic": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ \"اللهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي\\n\\nالْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ\\n\\nوَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
        "latin": "All-llahu La Ilahe il-la huvel-Hajjul-Kajjumu, la te’hudhuhu sinetun ve la nevmun, lehu ma fis-semavati ve ma fil-erdi, men dhel-ledhi jeshfe’u indehu il-la bi idhnihi, ja’lemu ma bejne ejdihim ve ma halfehum ve la juhitune bi shej’in min ilmihi il-la bima shae vesi’a Kursijjuhus-semavati vel-erda, ve la jeuduhu hifdhuhuma ve huvel-Alijjul-Adhim",
        "albanian": "Allahu është Një, nuk ka Zot tjetër përveç Atij, Ai është Mbikëqyrës i përhershëm dhe i përjetshëm. Atë nuk e zë as kotja as gjumi, gjithçka ka në qiej dhe në tokë, është vetëm e Tij. Askush nuk mund të ndërmjetësojë tek Ai, përveç se me lejen e Tij? Ai di të tashmen që është pranë tyre dhe të ardhmen. Nga ajo që Ai di, të tjerët dinë vetëm aq sa Ai ka dëshiruar. Kursija e Tij përfshin qiejt dhe tokën, kurse kujdesi i Tij ndaj të dyjave nuk i vjen rëndë, Ai është më i Larti, më i Madhi.",
        "reference": ""
      },
      {
        "id": 77,
        "audio": "/audios/027_03.mp3",
        "arabic": "(1) بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ \"قُلْ هُوَ اللهُ أَحَدٌ ۞ اللهُ الصَّمَدُ ۞ لَمْ يَلِدْ وَلَمْ يُولَدْ ۞ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ\\n(2) بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ \"قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ۞ مِنْ شَرِّ مَا خَلَقَ ۞ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ۞ وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ۞ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ\\n(3) بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ \"قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۞ مَلِكِ النَّاسِ ۞ إِلَهِ النَّاسِ ۞ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۞ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۞ مِنَ الْجِنَّةِ وَالنَّاسِ\\n",
        "latin": "Kul huvAll-llahu ehad, All-llahus-samed, lem jelid ve lem juled, ve lem jekun lehu kufuven ehad.\\n\\nKul eudhu bi Rabbil felek, min sherri ma halek, ve min sherri gasikin idha vekab, ve min sherrin-nef-fathati fil ukad, ve min sherr-rri hasidin idha hased.\\n\\nKul eudhu bi Rabbin-nas, melikin-nas, ilahin-nas, minsher-ril vesvasil han-nas, eledhi juvesvisu fi sudurin-nas, minel xhin-neti ven-nas.  (nga 3 herë)\\n",
        "albanian": "Thuaj: “Ai është Allahu, Një dhe i Vetëm! Allahu është Absoluti, të Cilit i përgjërohet gjithçka në amshim. Ai as nuk lind, as nuk është i lindur. Dhe askush nuk është i barabartë (a i krahasueshëm) me Atë!”\\nThuaj: “Kërkoj mbështetje te Zoti i agimit, që të më mbrojë nga sherri i gjithçkaje që Ai ka krijuar dhe nga sherri i natës, kur kaplon terri dhe nga sherri i falltarëve, që fryjnë në nyje (duke bërë magji) dhe nga sherri i smirëziut, kur vepron me smirë.”\\nThuaj: “Kërkoj mbështetje te Zoti i njerëzve, Sundimtari i njerëzve, i Adhuruari (i vetëm me të drejtë) i njerëzve, nga sherri i djallit cytës që fshihet (pasi cyt) e që hedh dyshime në gjokset e njerëzve, (qoftë ai djall) prej xhindeve apo njerëzve!”\\n",
        "reference": "Ebu Davudi 2/86, Nesaiu 3/68, “Sahih et-Tirmidhi” 3/182: “Kush i thotë këto sure tri herë në mëngjes dhe në mbrëmje i mjaftojnë për çdo gjë”."
      },
      {
        "id": 78,
        "audio": "/audios/027_04.mp3",
        "arabic": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ للهِ وَالْحَمْدُ للهِ، لَا إِلَهَ إِلَّا اللهُ وَحَدْهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ\\n\\nقَدِيرٌ، ربِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَومِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَومِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ\\n\\nبِكَ مِنَ الْكَسَلِ، وَسُوءِ الكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
        "latin": "Asbahna ve asbaha el-Mulku lil-lah vel-hamdulil-lah la Ilahe il-lAll-llahu vahdehu la sherike leh, lehul-mulku ve lehul-hamdu ve Huve ala kul-li shejin kadir. Rabbi es’elukel-hajre ma fi hadhel-jevmi ve hajre ma badehu ve eudhu bike min sherri ma fi hadhel-jevmi ve sherri ma badehu. Rabbi eudhu bike minel-keseli ve su’il-kiber. Rabbi eudhu bike min adhabin fin-nar ve adhabin fil-kabr.\\n\\nNdërsa kur errësohej thoshte: Rabbi es’eluke hajre ma fi hadhihil-lejleti ve hajre ma ba’deha, ve eudhu bike min sherri hadhihil-lejleti ve sherri ma ba’deha",
        "albanian": "E arritëm mëngjesin; e gjithë pasuria i takon Allahut; Falënderimi është për Allahun, nuk ka të adhuruar tjetër përveç Allahut, i Cili është një dhe i pashoq; Atij i takon sundimi dhe Falënderimi; Ai është mbi çdo send i Plotfuqishëm. O Zot, prej Teje kërkoj të mirën e kësaj dite dhe të ditëve të tjera dhe prej Teje kërkoj mbrojtjen nga e liga e kësaj dite dhe ditëve të tjera. O Zot, kërkoj mbrojtjen Tënde nga përtacia dhe mendjemadhësia. O Zot, më  mbroj nga dënimi i xhehenemit dhe nga dënimi i varrit.",
        "reference": "Muslimi 4/2088"
      },
      {
        "id": 79,
        "audio": "/audios/027_05.mp3",
        "arabic": "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ",
        "latin": "All-llahume bike esbahna ve bike emsejna ve bike nahja ve bike nemutu ve ilejken-nushur",
        "albanian": "O Allahu im, me emrin Tënd e arrijmë mëngjesin dhe me emrin Tënd e arrijmë mbrëmjen, me emrin Tënd ngjallemi dhe me emrin Tënd vdesim dhe tek Ti është kthimi.",
        "reference": "Ndërsa në mbrëmje “Allahume bike emsejna ve bike esbah-na ve bike nahja ve bike nemutu ve ilejkel-mesir” (O Zot, me emrin Tënd e arrijmë mbrëmjen dhe me emrin Tënd e arrijmë mëngjesin, me emrin Tënd ngjallemi dhe me emrin tënd vdesim dhe te Ti është tubimi).\\nTirmidhiu 5/466 “Sahih et-Tirmidhi” 3/142."
      },
      {
        "id": 80,
        "audio": "/audios/027_06.mp3",
        "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لّا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتَ، أَعُوذُ بِكَ مِنْ شَرِّ مَا\\n\\nصَنَعْتَ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِر لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
        "latin": "All-llahume ente Rabbi la Ilahe il-la ente halakteni ve eneve enealaahdike ve vadike mestet’atu eudhu bike min sherri na sanatu eb’uleke bi nimetike aleje ve eb’u bi dhenbi fagfir li fe innehu la jagfirudh-dhunube il-la Ente",
        "albanian": "O Allah, ti je Zoti im, nuk ka hyjni që meriton të adhurohet përveç Teje; Ti më ke krijuar dhe unë jam robi Yt, do të qëndroj besnik ndaj marrëveshjes dhe premtimit Tënd aq sa të kem mundësi; Kërkoj mbrojtjen Tënde nga e keqja që kam vepruar, Unë jam mirënjohës ndaj dhuntive Tua, i pranoj mëkatet e mia, andaj më fal, ngase mëkatet nuk i fal askush tjetër përveç Teje.",
        "reference": "“Kush e thotë këtë lutje në mbrëmje duke qenë i bindur në të dhe vdes po atë natë do të jetë prej banorëve të Xhenetit, po ashtu edhe në mëngjes.” Buhariu 7/150."
      },
      {
        "id": 81,
        "audio": "/audios/027_07.mp3",
        "arabic": "اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللهُ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ\\n\\nلَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ",
        "latin": "All-llahumme inni asbahtu  ush-hiduke, ve ush-hidu hamelete Arshike ve Melaiketeke ve xhemia halkike, Enneke EnteAll-llahu la Ilahe il-la Ente vahdeke la sherike Lek, ve enne Muhammeden abduke ve resuluke. (4 herë).",
        "albanian": "O Allahu im, unë u zgjova, dëshmoj për Ty dhe për mbajtësit e Arshit Tënd, për melaiket Tua dhe për të gjitha krijesat Tua, sepse vërtetë Ti je Allahu i Vetëm, nuk ka të adhuruar tjetër përveç Teje, Ti je i Vetëm dhe i pa rival dhe dëshmoj se Muhamedi (a.s) është robi dhe i Dërguari i Yt.",
        "reference": "Ndërsa në mbrëmje thotë: Allahumme inni emsejtu ush-hiduke, ve ush-hidu hamelete Arshike ve Melaiketeke ve xhemia halkike, Enneke EnteAll-llahu la Ilahe il-la Ente vahdeke la sherike Lek, ve enne Muhammeden abduke ve resuluke…"
      },
      {
        "id": 82,
        "audio": "/audios/027_08.mp3",
        "arabic": "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
        "latin": "All-llahume ma asbaha bi  min ni’metin ev bi ehadin min halkike, fe minke vahdeke la sherike lek, fe lekel-hamdu ve lekesh-shukru",
        "albanian": "O Allahu im, ajo që më është dhënë mua apo ndonjërit prej krijesave Tua nga begatitë e tëra është vetëm nga Ti që Je i pashoq; Ty të qoftë lavdërimi dhe Falënderimi.",
        "reference": "Ndërsa në mbrëmje thotë: Allahumme ma emsa bi min ni’metin ev bi ehadin min halkike, fe minke vahdeke la sherike lek, fe lekel-hamdu ve lekesh-shukru…"
      },
      {
        "id": 83,
        "audio": "/audios/027_09.mp3",
        "arabic": "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ اللّه أَنْـتَ. (ثلاثاً)\\nاللّهُـمَّ إِنّـي أَعـوذُبِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُبِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ. (ثلاثاً) ",
        "latin": "All-llahumme afini fi bedeni, All-llahumme afini fi semi, All-llahumme afini fi besari, la ilahe il-la ente, All-llahumme inni eudhu bike minel-kufri vel-fakri, ve eudhu bike min adhabil-kabr, la ilahe il-la ente. (Tre herë në mëngjes dhe tri herë në mbrëmje)",
        "albanian": "O Allahu im, më jep shëndet në trupin tim, o Allahu im, më jep shëndet në të dëgjuarit tim, o Allahu im, më jep shëndet në të pamurit tim. Nuk ka të adhuruar tjetër përveç Teje. O Allahu im, kërkoj mbrojtjen Tënde nga mosbesimi e varfëria dhe kërkoj mbrojtjen Tënde nga dënimi i varrit. Nuk ka të adhuruar tjetër përveç Teje.",
        "reference": "Ebu Davudi 4/324, Ahmedi 5/42 dhe Nesaiu në “Amel el-Jevmi ve Lejleh” nr. 22, Ibën Sunnijj nr. 69 dhe Buhariu në “Edebul-Mufred”, senedin e këtij hadithi dijetari Ibën Bazi në librin e tij “Tuhfetul-Ahjar” fq. 26 e ka bërë të mirë (hasen)."
      },
      {
        "id": 84,
        "audio": "/audios/027_10.mp3",
        "arabic": "حَسْبِيَ اللهُ لَآ إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
        "latin": "HasbijAll-llahu la Ilahe il-la huve, Alejhi tevekkeltu ve Huve Rabbul-arshil-adhim. (7 herë).",
        "albanian": "Më mjafton mua Allahu; nuk ka të adhuruar tjetër përveç Tij. Tek Ai jam mbështetur dhe Ai është Zoti i Arshit të Madh.",
        "reference": "“Kush e thotë këtë lutje në mëngjes dhe në mbrëmje shtatë herë i mjafton për atë që e brengos çështja e kësaj bote dhe e ahiretit.” Ibën Sunnijj hadithi nr. 71, merfu dhe Ebu Davudi mevkuf 4/321. Isnadin e këtij hadithi e kanë bërë të vërtetë Shuajb dhe Abdulkadër Arnauti “Zadul-Me’ad” 2/376)."
      },
      {
        "id": 85,
        "audio": "/audios/027_11.mp3",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْللِي،\\n\\nوَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي،\\n\\nوَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
        "latin": "All-llahumme inni es’elukel-afve vel-afijete fid-dunja vel-ahireh, All-llahumme inni es’elukel-afve vel-afijete fi dini ve dunjaje ve ehli ve mali. All-llahummes-tur avrati ve amin revati. All-llahummeh-fedhni min bejni jedejje ve min halfi vean jemini vean shimali ve min fevki ve eudhu bike en ugtale min tahti",
        "albanian": "O Allahu im, kërkoj nga Ti falje dhe shpëtim në këtë botë dhe në Ahiret. O Allahu im, kërkoj që të më falësh dhe të më mbrosh në fenë time dhe në jetën time, ma mbro familjen dhe pasurinë time. O Allahu im, m’i mbulo të metat e mia dhe më qetëso në momentet trishtuese. O Allahu im, më ruaj nga para dhe nga prapa, në të djathtë dhe në të majtë, si dhe nga lartë; kërkoj nga Ti që të më mbrosh të mos më lëshojë toka.",
        "reference": "Ebu Davudi dhe Ibën Maxheh. Shih “Sahih Ibën Maxheh” 2/332."
      },
      {
        "id": 86,
        "audio": "/audios/027_12.mp3",
        "arabic": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّماوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ\\n\\nشَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
        "latin": "All-llahumme alimel-gajbi vesh-shehadeti fatires-semavati vel-erdi, Rabbe kul-le shej’in ve melikehu, eshhedu en la Ilahe il-la ente, eudhu bike min sherri nefsi ve sherrish-shejtani ve shirkihi, ve en akterife ala nefsi su’en ev exhurrehu ila muslimin",
        "albanian": "O Allahu im, Ti je Ai i Cili i di të fshehtat dhe të dukshmet, Krijues i qiejve dhe i tokës, Zot i çdo sendi dhe Mbizotërues i saj, dëshmoj se nuk ka të adhuruar tjetër përveç Teje; kërkoj mbrojtjen Tënde nga e keqja e vetes sime, nga e keqja e djallit dhe nga ajo që djalli të shpie në idhujtari, si dhe kërkoj të më mbrosh që vetvetes e as ndonjë muslimani të mos i bëj dëm.",
        "reference": "Tirmidhiu dhe Ebu Davudi. “Sahih et-Tirmidhi” 3/142."
      },
      {
        "id": 87,
        "audio": "/audios/027_13.mp3",
        "arabic": "بِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
        "latin": "Bismil-lahil-ledhi la jedur-ru me’a-ismihi shej’un fil-erdi ve la fis-semai ve huves-semiul-alim. (3 herë).",
        "albanian": "Me emrin e Allahut pranë emrit të të Cilit nuk të bën dëm asgjë në tokë e as në qiell, Ai është që shumë dëgjon dhe që di çdo gjë.",
        "reference": "“Kush e thotë këtë lutje tri herë në mëngjes dhe në mbrëmje, nuk i bëhet dëm asgjë.” Ebu Davudi 4/323, Tirmidhiu 5/465, Ibën Maxhe dhe Ahmedi. Shih “Sahih Ibën Maxhe” 2/332), dijetari Ibën Bazi në “Tuhfetul-Ahjar” fq.39, (senedi hasen)."
      },
      {
        "id": 88,
        "audio": "/audios/027_14.mp3",
        "arabic": "رَضِيتُ باللهِ رَبَّاً، وَبِالْإِسْلَامِ دِيناً، وَبِمُحَمَّدٍ صَلَى اللهُ عَلِيهِ وَسَلَّمَ نَبِيَّاً",
        "latin": "Redijtu bil-lahi Rabben ve bil-Islami dinen, ve bi Muhammedin nebijjen. (3 herë).",
        "albanian": "Jam i kënaqur që Zoti im është Allahu, feja ime është Islami dhe Pejgamberi im është Muhamedi (a.s).",
        "reference": "“Kush e thotë këtë lutje çdo mëngjes dhe mbrëmje tri herë është obligim i Allahut që ta kënaq atë ditën e Kiametit.” Ahmedi 4/337, Nesaiu në “Amel el-Jevmi ve Lejleh” nr. 4, Ibën Sunnijj nr. 68, Ebu Davudi 4/418 dhe Tirmidhiu 5/465. Shejh Ibën Bazi në “Tuhfetul-Ahjar” fq. 39 këtë hadith e ka bërë të mirë (hasen)."
      },
      {
        "id": 89,
        "audio": "/audios/027_15.mp3",
        "arabic": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
        "latin": "Ja Hajju ja Kajjumu bi rahmetike estegithu aslih li she’ni kul-lehu ve la tekilni ila nefsi tarfete ajnin",
        "albanian": "O i Gjallë përgjithmonë, O Mbikëqyrës i çdo gjëje, me mëshirën Tënde kërkoj ndihmë, ma përmirëso tërë gjendjen time dhe mos më lër të mbështetem në veten time, as sa një përpëlitje e syrit.",
        "reference": "Hakimi, i cili e ka bërë këtë hadith të vërtetë (sahih) si dhe e ka pëlqyer edhe Dhehebiu 1/545. Shih “Sahih et-Tergib vet-Terhib” 1/273."
      },
      {
        "id": 90,
        "audio": "/audios/027_16.mp3",
        "arabic": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لهِ رَبِّ الْعَالَمِينَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ: فَتْحَهُ، وَنَصْرَهُ وَنُورَهُ، وَبَرَكَتَهُ، وَهُدَاهُ،\\n\\nوَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ",
        "latin": "Asbahna  ve asbahal-Mulku lil-lahi Rabbil-alemin. All-llahumme inni es’eluke hajre hadhel-jevmi fet-hahu, ve nasrehu ve nurehu, ve bereketehu, ve hudahu, ve eudhu bike min sherri ma fihi, ve sherri ma badehu",
        "albanian": "E arritëm mëngjesin dhe e tërë pasuria i takon Allahut, Zotit të botëve. O Allahu im, unë kërkoj mirësinë e kësaj dite, hapjen e saj, ndihmën e saj, dritën e saj, dhuntinë dhe udhëzimin e saj. Kërkoj të më mbrosh nga e keqja e saj dhe e ditëve të tjera pas saj.",
        "reference": "Ndërsa në mbrëmje thotë: “Emsejna ve emsel-Mulku lil-lahi Rabbil-alemin. Allahumme inni es’eluke hajre hadhihil-lejleti, fethaha, ve nasreha, ve bereketeha, ve hudaha, ve eudhi bike min sherri ma fiha ve sherri ma badeha.”\\nEbu Davudi 4/322; (isnad hasen) Shuajb dhe Abdul-kadër Arnauti. Shih “Zadul-Me’ad” 2/273."
      },
      {
        "id": 91,
        "audio": "/audios/027_17.mp3",
        "arabic": "أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ وَعَلَى كَلِمَةِ الْإِخْلَاصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَى اللهُ عَلِيهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا\\n\\nإِبْرَاهِيمَ، حَنِيفَاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
        "latin": "Asbahna ala fitretil-Islam  ve ala kelimetil-Ihlas, ve ala dini nebijjina Muhammedin (a.s) , ve ala mil-leti ebina Ibrahime hanifen muslimen ve ma kane minel-mushrikin",
        "albanian": "E arritëm mëngjesin në natyrshmërinë Islame, në fjalën e sinqertë (La Ilahe Il-lAll-llah), në fenë e të Dërguarit tonë, Muhamedit (a.s) dhe në fenë e babait tonë Ibrahimit, i cili ka qenë besimdrejtë, musliman e nuk ka qenë prej idhujtarëve.",
        "reference": "Ndërsa në mbrëmje thotë: “Emsejna ala fitretil-Islam ve ala kelimetil-Ihlas, ve ala dini nebijjina Muhammedin, ve ala mil-leti ebina Ibrahime hanifen muslimen ve ma kane minel-mushrikin]”.\\nAhmedi 3/406-407, Ibën Sunnijj në “Amel el-Jevmi ve Lejleh”, nr. 34 “Sahih el-Xhamiu” 4/209.\\n"
      },
      {
        "id": 92,
        "audio": "/audios/027_18.mp3",
        "arabic": "سُبْحَانَ اللهِ وَبِحَمْدِهِ",
        "latin": "SubhanAll-llahi ve bihamdihi. (100 herë).",
        "albanian": "I Lartësuar qoftë Allahu, Atij i takon Lavdërimi.",
        "reference": "“Kush e thotë këtë lutje në mëngjes dhe në mbrëmje 100 herë, askush s’do të vijë Ditën e Kiametit me diç më të vlefshme se ky, përveç atij i cili ka thënë sikur ky apo më tepër.” Muslimi 4/2071."
      },
      {
        "id": 93,
        "audio": "/audios/027_19.mp3",
        "arabic": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        "latin": "La Ilahe il-lAll-llahu vahdehu la sherike leh, lehul-mulku ve lehul-hamdu ve huve ala kul-li shejin kadir. (10 herë, ose një herë kur përton).",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut, të Vetëm e i pa rival. Atij i takon Sundimi dhe Lavdërimi dhe Ai është i Gjithëfuqishëm mbi çdo gjë.",
        "reference": "Ebu Davudi 4/319, Ibën Maxheh dhe Ahmedi 4/60, “Sahih et-Tergib vet-Terhib” 1/270 dhe “Sahih Ebu Davud” 3/957, “Sahih Ibën Maxheh” 2/331 dhe “Zadul-Me’ad” 2/377."
      },
      {
        "id": 94,
        "audio": "/audios/027_20.mp3",
        "arabic": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        "latin": "La ilahe il-lAll-llahu vahdehu la sherike leh, lehul-Mulku ve lehul-hamdu ve huve ala kul-li shejin kadir. (100 herë në mëngjes).",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut, të Vetëm e i pa rival. Atij i takon Sundimi dhe Lavdërimi dhe Ai është i Gjithëfuqishëm mbi çdo gjë.",
        "reference": "I Dërguari i Allahut (paqja qoftë mbi të) ka thënë: “Kush e thotë këtë lutje 100 herë në ditë; ka shpërblimin sikur t’i ketë liruar 10 robër. Atij i shkruhen 100 të mira, i fshihen 100 gjynahe dhe është i mbrojtur nga djalli deri në mbrëmje, askush nuk ka vepruar më mirë se ky person, me përjashtim të atij që ka vepruar më tepër se ky.” Shënojnë Buhariu 4/95 dhe Muslimi 4/2071."
      },
      {
        "id": 95,
        "audio": "/audios/027_21.mp3",
        "arabic": "سُبْحَانَ اللهِ وَبِحَمْدِهِ: عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
        "latin": "SubhanAll-llahi ve bihamdihi adede halkihi ve rida nefsihi ve zinete arshihi ve midade kelimatihi. (3 herë në mëngjes).",
        "albanian": "I Madhëruar qoftë Allahu, aq sa është numri i krijesave të Tij dhe aq sa dëshiron Ai vet, po aq sa është i bukur Arshi i Tij dhe aq sa është ngjyra e pafund për t’i shkruar fjalët e Tij.",
        "reference": "Muslimi 4/2090."
      },
      {
        "id": 96,
        "audio": "/audios/027_22.mp3",
        "arabic": "اللَّهُمَّ إنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً",
        "latin": "All-llahumme inni es’eluke ilmen nafi’an ve rizkan tajjiben ve amelen mutekabbelen. (çdo mëngjes).",
        "albanian": "O Allahu im, të lutem më jep dituri të dobishme e furnizim të mirë dhe të lutem Të m’i pranosh veprat e mia.",
        "reference": "Ibën Sunnijj në “Amel el-Jevmi ve Lejleh” nr. 54. Ibën Ma-xheh nr. 925; isnadin e këtij hadithi e kanë bërë të mirë (hasen) Shuajb dhe Abdulkadër Arnauti “Zadul-Me’ad” 2/375."
      },
      {
        "id": 97,
        "audio": "/audios/027_23.mp3",
        "arabic": "أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ",
        "latin": "Estagfirull-llahe ve etubu ilejhi. (100 herë në ditë).",
        "albanian": "Kërkoj faljen e Allahut dhe tek Ai pendohem.",
        "reference": "Buhariu “Fet’hul-Bari” 11/101."
      },
      {
        "id": 98,
        "audio": "/audios/027_24.mp3",
        "arabic": "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
        "latin": "Eudhu bi kelimatil-lahit-tammati min sherri ma halaka. (3 herë në mbrëmje).",
        "albanian": "Kërkoj mbrojtje me fjalët e përsosura të Allahut nga çdo e keqe që e ka krijuar.",
        "reference": "“Kush e thotë këtë lutje tri herë në mbrëmje, nuk i bën dëm temperatura e asaj nate.” Ahmedi 2/290, Nesaiu në “Amel el-Jevmi ve Lejleh” hadithi nr. 590, Ibën Sunnijj nr. 68. “Sahih et-Tirmidhi” 3/187, “Sahih Ibën Maxheh” 2/266 dhe “Tuhfetul-Ahjar” fq.45."
      },
      {
        "id": 278,
        "audio": "/audios/027_01.mp3",
        "arabic": "اَلْحَمْدُ لِلهِ وَحْدَهُ، وَالصَّلاَةُ وَالسَّلاَمُ عَلَى مَنْ لاَ نَبِيَّ بَعْدَهُ ",
        "latin": "Elhamdulil-lahi vahdeh, ves-salatu ves-selamu ala men la nebijje badeh",
        "albanian": "Falënderimi i takon vetëm Allahut, mëshira dhe shpëtimi i Allahut qofshin mbi atë pas të cilit nuk ka më të Dërguar - Muhamedin.",
        "reference": "Shënohet nga Enesi se i Dërguari (paqja e Allahut qoftë mbi të) ka thënë: “Të ulem me një popull i cili e përmend Allahun prej namazit të sabahut e deri sa të lind dielli është më e dashur për mua se sa t’i liroj katër robër prej bijve të Ismailit dhe të ulem me një popull i cili e përmend Allahun prej namazit të ikindisë e deri sa të perëndojë dielli është më e dashur për mua se sa t’i liroj katër robër”. Ebu Davudi hadithi nr: 3667. Shejh Albani thotë hadith hasen “Ebu Davud” 2/698."
      },
      {
        "id": 279,
        "audio": "/audios/027_25.mp3",
        "arabic": "اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّدٍ",
        "latin": "All-llahumme sal-li ve sel-lim ala nebijjina Muhammed (10 herë).",
        "albanian": "O Allahu im, mëshiroje dhe përshëndete të Dërguarin tonë, Muhamedin.”",
        "reference": "I Dërguari i Allahut (paqja qoftë mbi të) ka thënë: “Kush dër-gon salavat mbi mua çdo mëngjes dhe do mbrëmje, atë person do ta arrijë ndërmjetësimi im në Ditën e Gjykimit.” Taberaniu me dy senede, njëri prej tyre është i mirë, “Mexhmeuz-Zevaid” 10/120 dhe “Sahih et-Tergib vet-Terhib” 1/273”"
      }
    ]
  },
  {
    "id": 28,
    "chapter_name": "28.Dhikri para fjetjes",
    "invocations": [
      {
        "id": 99,
        "audio": "/audios/028_01.mp3",
        "arabic": "I bashkon shuplakat e dorës sikurse kur bën dua, fryen në to dhe lexon:<br />\\n\\nبَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ \"قُلْ هُوَ اللهُ أَحَدٌ ۞ اللهُ الصَّمَدُ ۞ لَمْ يَلِدْ وَلَمْ يُولَدْ ۞ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ. بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ \"قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ۞ مِنْ شَرِّ مَا خَلَقَ ۞ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ۞ وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ۞ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ. سْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ \"قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۞ مَلِكِ النَّاسِ ۞ إِلَهِ النَّاسِ ۞ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۞ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۞ مِنَ الْجِنَّةِ وَالنَّاسِ",
        "latin": "Kul huvAll-llahu ehad, All-llahus-samed, lem jelid ve lem juled, ve lem jekun lehu kufuven ehad\\n\\nKul eudhu bi Rabbil felek, min sherri ma halek, ve min sherri gasikin idha vekab, ve min sherrin-nef-fathati fil ukad, ve min sherr-rri hasidin idha hased\\n\\nKul eudhu bi Rabbin-nas, melikin-nas, ilahin-nas, minsherr-rril vesvasil han-nas, eledhi juvesvisu fi sudurin-nas, minel xhin-neti ven-nas",
        "albanian": "Thuaj: “Ai është Allahu, Një dhe i Vetëm! Allahu është Absoluti, të Cilit i përgjërohet gjithçka në amshim. Ai as nuk lind, as nuk është i lindur. Dhe askush nuk është i barabartë (a i krahasueshëm) me Atë!”\\nThuaj: “Kërkoj mbështetje te Zoti i agimit, që të më mbrojë nga sherri i gjithçkaje që Ai ka krijuar dhe nga sherri i natës, kur kaplon terri dhe nga sherri i falltarëve, që fryjnë në nyje (duke bërë magji) dhe nga sherri i smirëziut, kur vepron me smirë.”\\nThuaj: “Kërkoj mbështetje te Zoti i njerëzve, Sundimtari i njerëzve, i Adhuruari (i vetëm me të drejtë) i njerëzve, nga sherri i djallit cytës që fshihet (pasi cyt) e që hedh dyshime në gjokset e njerëzve, (qoftë ai djall) prej xhindeve apo njerëzve!”\\n\\nPastaj e fërkon me të dy duart trupin, aq sa të mundesh, duke filluar nga koka, fytyra dhe aq sa mund të arrish nga trupi. (kështu vepron tri herë)",
        "reference": "Buhariu “Fet’hul-Bari” 9/62 dhe Muslimi 4/1723."
      },
      {
        "id": 100,
        "audio": "/audios/028_02.mp3",
        "arabic": "اللهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
        "latin": "All-llahu La Ilahe il-la huvel-Hajjul-Kajjumu, la te’hudhuhu sinetun ve la nevmun, lehu ma fis-semavati ve ma fil-erdi, men dhel-ledhi jeshfe’u indehu il-la bi idhnihi, ja’lemu ma bejne ejdihim ve ma halfehum ve la juhitune bi shej’in min ilmihi il-la bima shae, vesi’a Kursijjuhus-semavati vel-erda, ve la jeuduhu hifdhuhuma, ve huvel-Alijjul-Adhim",
        "albanian": "Allahu është Një, nuk ka Zot tjetër përveç Atij. Ai është Mbikëqyrës i përhershëm dhe i përjetshëm. Atë nuk e zë as kotja, as gjumi, gjithçka që ka në qiej dhe në tokë është vetëm e Tij. Askush nuk mund të ndërmjetësoj tek Ai, përveç me lejen e Tij? Ai di të tashmen dhe të ardhmen. Nga ajo që Ai di, të tjerët dinë vetëm aq sa Ai ka dëshiruar. Kursija e Tij përfshin qiejt dhe tokën, kurse kujdesi i Tij ndaj të dyjave nuk i vjen rëndë. Ai është më i Larti, më i Madhi.",
        "reference": "“Kush e lexon këtë lutje kur të bie në shtrat, ai është i mbrojtur prej Allahut dhe nuk i afrohet atij shejtani deri sa të agojë mëngjesi.” Buhariu 4/487)."
      },
      {
        "id": 101,
        "audio": "/audios/028_03.mp3",
        "arabic": "آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ۞ لَا يُكَلِّفُ اللهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
        "latin": "Amener-resulu bima unzile ilejhi min Rabbihi vel-mu’minun, kul-lun amene bil-lahi ve melaiketihi ve kutubihi ve rusulihi, la nuferriku bejne ehadin min rusulihi ve kalu semi’na ve eta’na gufraneke Rabbena ve ilejkel mesir. La jukel-lifull-llahu nefsen il-la vus’aha leha ma kesebet ve alejha mektesebet. Rabbena la tuahidhna in nesina ev ahta’na, Rabbena ve la tahmil alejna isren kema hameltehu alel-ledhine min kablina, Rabbena ve la tuhammilna ma la takate lena bihi, vafuanna vagfirlena verhamna ente mevlana fensurna alel-kavmil-kafirin",
        "albanian": "I Dërguari i besoi asaj që iu shpall prej Zotit të Tij si dhe besimtarët. Secili i besoi Allahut, melekëve të Tij, shpalljeve të Tij dhe të dërguarve të Tij. Ne nuk bëjmë dallim në asnjërin nga të dërguarit e Tij dhe thanë: “Dëgjuam dhe respektuam. Kërkojmë faljen tënde o Zoti ynë, te Ti është ardhmëria (jonë)”. Allahu nuk ngarkon askë përtej mundësive të tij, atij (njeriut) i takon ajo që e fitoi dhe Atij i bie ajo (e keqe) që e meritoi.”Zoti ynë, mos na dëno nëse harrojmë ose gabojmë! Zoti ynë, mos na ngarko neve barrë të rëndë siç i ngarkove ata para nesh! Zoti ynë, mos na ngarko me atë për të cilën nuk kemi fuqi! Na i mbulo të këqijat, na fal dhe na mëshiro. Ti je Mbrojtësi ynë, pra na ndihmo kundër popullit jobesimtarë!",
        "reference": "“Kush i lexon këto dy ajete në mbrëmje i mjaftojnë.” Buhariu “Fet’hul-Bari” 9/94 Muslimi 1/554. Ajete nga kaptina Bekare 285-286."
      },
      {
        "id": 102,
        "audio": "/audios/028_04.mp3",
        "arabic": "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
        "latin": "Bismike Rabbi ved’atu xhenbi ve bike erfeuhu fe in emsekte nefsi ferhamha ve in erselteha fahfedhha bima tahfedhu bihi ibadekes-salihin",
        "albanian": "Me emrin Tënd, o Zoti im, bie në gjumë dhe me emrin tënd ngritëm. Nëse ma merr shpirtin më mëshiro, e nëse ma kthen në trupin tim, mbroje atë sikurse i mbron robërit e Tu të mirë.",
        "reference": "“Kur dikush prej juve ngritët nga shtrati i tij e pastaj kthehet në të, le ta fshijë tri herë dyshekun, ngase ai nuk e di se mund të ketë rënë diç në të pasi është larguar nga ai, e pastaj le të thotë: (hadithin)” Buhariu “Fet’hul-Bari” 1/126), Muslimi 4/2084."
      },
      {
        "id": 103,
        "audio": "/audios/028_05.mp3",
        "arabic": "اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها. اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة",
        "latin": "All-llahumme inneke halakte nefsi ve Ente tevefaha, Leke mematuha, ve mahjaha, In ahjejteha fahfedhha ve in emetteha fagfir leha. All-llahumme inni es’elukel-afijete",
        "albanian": "O Allahu im, Ti krijove shpirtin tim dhe Ti e bën që ai të vdes. Tek Ti është vdekja dhe jeta e tij. Nëse i jep jetë mbroje atë, e nëse më bën të vdes, fale atë. O Allahu im, të lutem të më shpëtosh.",
        "reference": "Muslimi 4/2083, Ahmedi 2/79. Këtë version e shënon Ahmedi."
      },
      {
        "id": 104,
        "audio": "/audios/028_06.mp3",
        "arabic": "اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ",
        "latin": "All-llahumme kini adhabeke jevme teb’athu ibadeke. (3 herë).",
        "albanian": "O Allahu im, më ruaj prej dënimit Tënd, ditën kur do t’i ringjallësh robërit Tu.",
        "reference": "I Dërguari (paqja e Allahut qoftë mbi të) kur dëshironte të flejë e vente dorën e tij të djathtë nën faqe dhe thoshte: (hadithin) Ebu Davudi 4/311 “Sahih et-Tirmidhi” 3/143)."
      },
      {
        "id": 105,
        "audio": "/audios/028_07.mp3",
        "arabic": "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا",
        "latin": "Bismike All-llahumme emutu ve ahja",
        "albanian": "Me emrin Tënd, o Allahu im vdes dhe me emrin Tënd jetoj.",
        "reference": "Buhariu “Fet’hul-Bari” 11/113, Muslimi 4/2083."
      },
      {
        "id": 106,
        "audio": "/audios/028_08.mp3",
        "arabic": "سُبْحَانَ اللهِ، والْحَمْدُ للهِ، وَاللهُ أَكْبَرُ",
        "latin": "SubhanAll-llah] (33 herë), Elhamdulil-lah (33 herë), All-llahu Ekber (34 herë).",
        "albanian": "",
        "reference": "“Kush e thotë këtë lutje kur t’i afrohet shtratit është më e mirë për të se sa të ketë shërbëtor.” Buhariu “Fet’hul-Bari” 7/71), Muslimi 4/2091."
      },
      {
        "id": 107,
        "audio": "/audios/028_09.mp3",
        "arabic": "اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنجِيلِ، وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أّنْتَ آخِذٌ بِنَاصِيَتهِ. اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ",
        "latin": "All-llahumme Rabbes-semavatis-seb’i ve Rabbel-arshil-adhim, Rabbena ve Rabbe kul-li shej’in, Falikal-habbi ven-neva, ve Munzilet-Tevrati vel-Inxhili, vel-Furkan, eudhu bike min sherri kul-li shej’in Ente ahidhun bi nasijetihi. All-llahumme Entel-Evvelu fe lejse kableke shej’un, ve Entel-ahiru fe lejse badeke shej’un, ve Entedh-Dhahiru fe lejse fevkake shej’un, ve Entel-batinu fe lejse duneke shej’un, Ikdianna ed-dejne, ve agnina minel-fakr",
        "albanian": "O Allahu im, Zoti i të shtatë qiejve dhe Zoti i Arshit të Madh, Zoti ynë dhe Zoti i çdo gjëje, Zbërthyes i farës dhe i bërthamës së pemës, Ti je Ai i Cili e shpalle Tevratin, Inxhilin dhe Furkanin (Kuranin). Kërkoj mbrojtjen Tënde nga e keqja e çdo gjëje sepse balli i çdo gjëje është në dorën Tënde. O Allah, Ti je i Pari dhe para Teje nuk pati asgjë. Ti je i Fundit dhe mbas Teje nuk mbetet asgjë. Ti je i Dukshmi dhe mbi Ty s’ka asgjë. Ti je i Padukshmi dhe nën Ty s’ka asgjë. Largoje nga ne borxhin dhe na mbroj ne prej varfërisë.",
        "reference": "Muslimi 4/2084."
      },
      {
        "id": 108,
        "audio": "/audios/028_10.mp3",
        "arabic": "الْحَمْدُ للهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْويَ",
        "latin": "Elhamdulil-lahil-ledhi et’amena ve sekana, ve kefana, ve avana, fe kem mimmen la kafije lehu ve la mu’vije",
        "albanian": "Falënderimi i qoftë Allahut i cili na jep të hamë dhe të pimë, na jep veshmbathje dhe na strehon. Sa ka të atillë që nuk kanë as veshmbathje e as strehim.",
        "reference": "Muslimi 4/2085."
      },
      {
        "id": 109,
        "audio": "/audios/028_11.mp3",
        "arabic": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاواتِ والْأَرْضَ، رَبَّ كُلِّ شَيْءٍ وَمَلِكُهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
        "latin": "All-llahumme alimel-gajbi vesh-shehadeti, Fatires-semavati vel-erdi, Rabbe kul-le shej’in ve Melikehu, eshhedu en la Ilahe il-la Ente, eudhu bike min sherri nefsi ve min sherrish-shejtani ve shirkihi, ve en ekterife ala nefsi su’en ev exhurrehu ila muslimin",
        "albanian": "O Allahu im, Ti je Ai i Cili i di të fshehtat dhe të dukshmet, Krijues i qiejve dhe i tokës, Zot i çdo gjëje dhe Mbizotërues i saj, dëshmoj se nuk ka hyjni që meriton të adhurohet përveç Teje; kërkoj mbrojtjen Tënde nga e keqja e vetes sime dhe nga e keqja e djallit, si dhe nga ajo që djalli të shpie në idhujtari dhe kërkoj të më mbrosh që vetvetes e as ndonjë muslimani të mos i bëj keq.\\n\\nPastaj lexon suret Bekare, Sexhde dhe Mulk.",
        "reference": "Ebu Davudi 4/317, “Sahih et-Tirmidhi” 3/142.\\nTirmidhiu dhe Nesaiu “Sahih el-Xhamiu” 4/255."
      },
      {
        "id": 111,
        "audio": "/audios/028_12.mp3",
        "arabic": "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلّا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
        "latin": "All-llahumme eslemtu nefsi ilejke ve fevvedtu emri ilejke ve vexhxhehtu vexhhi Ilejke, ve elxhe’tu dhahri ilejke, regbeten ve rahbeten Ilejk la melxhe’e ve la menxha minke il-la ilejke, amentu bi kitabik el-ledhi enzelte ve bi nebijjikel-ledhi erselte",
        "albanian": "O Allahu im, unë ta dorëzova Ty shpirtin tim. Ty ta kam dorëzuar çështjen time dhe fytyrën time e ktheva kah Ti. Tek Ti strehova shpinën time me dëshirë dhe frikërespekt. Nuk ka shpëtim dhe as strehim përveç se tek Ti; unë Kam besuar në librin Tënd, Kuranin të cilin e ke zbritur dhe e kam besuar lajmëtarin  tënd, Muhamedin të cilin e dërgove.",
        "reference": "I Dërguari ka thënë: “Kur dëshiron që të shtrihesh për të fjetur, merr abdes sikurse për në namaz, pastaj shtriju në krahun e djathtë dhe thuaj: (hadithin)” “Ai person i cili e thotë këtë lutje ka thënë se vdes në natyrë të pastër islame”. Buhariu “Fet’hul-Bari” 11/113, Muslimi 4/2081."
      }
    ]
  },
  {
    "id": 29,
    "chapter_name": "29.Duaja me rastin e rrotullimit natën",
    "invocations": [
      {
        "id": 112,
        "audio": "/audios/029_01.mp3",
        "arabic": "لَا إِلَهَ إِلَّا اللهُ الْوَاحِدُ اْقَهَّارُ، رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الْعَزِيزُ الْغَفَّارُ",
        "latin": "La ilahe il-laAll-llahu El-Vahidul-Kahhar, Rabbus-semavati vel-erdi ve ma bejne huma El-Azizul-Gaffar",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut, i cili është i Vetëm dhe Mposhtës, është Zot i qiejve dhe i tokës, si dhe i krejt çfarë ka ndërmjet tyre, Ai është Fuqiplotë dhe Mëkatfalës.",
        "reference": "“Këtë lutje duhet thënë me rastin e rrotullimit prej njërit krah në tjetrin.” Hakimi i cili e ka bërë të vërtetë (sahih), kurse Dhehebiu e ka pëlqyer 1/540. Po ashtu Nesaiu në “Amel el-Jevmi ve Lejleh” dhe Ibën Sunnij “Sahih el-Xhamiu” 4/213."
      }
    ]
  },
  {
    "id": 30,
    "chapter_name": "30.Duaja me rastin e frikës në gjumë",
    "invocations": [
      {
        "id": 113,
        "audio": "/audios/030_01.mp3",
        "arabic": "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَنْ يَحْضُرُونِ",
        "latin": "Eudhu bi kelimatil-lahit-tammati, min gadabihi ve ikabihi ve sherri ibadihi ve min hemezatish-shejatin ve en jahdurun",
        "albanian": "Kërkoj mbrojtje me fjalët e përsosura të Allahut nga hidhërimi i Tij, nga dëmi i robërve të Tij, nga vesveset e djajve dhe nga afrimi i tyre.",
        "reference": "Ebu Davudi 4/12, “Sahih et-Tirmidhi” 3/171."
      }
    ]
  },
  {
    "id": 31,
    "chapter_name": "31.Ç’duhet bërë ai i cili sheh ëndërr",
    "invocations": [
      {
        "id": 267,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "1. Duhet të pështyjë tri herë në anën e majtë. \\n2. Të kërkojë mbrojtjen e Allahut të Lartësuar nga djalli i mallkuar dhe nga e keqja e asaj që ka parë (3 herë). \\n3. Mos t’ia tregojë këtë askujt. \\n4. Të kthehet në krahun e kundërt. \\n5. Ngritët dhe falet nëse e dëshiron këtë. \\n",
        "reference": "Muslimi 4/1772, 1773."
      }
    ]
  },
  {
    "id": 32,
    "chapter_name": "32.Duaja e kunutit",
    "invocations": [
      {
        "id": 114,
        "audio": "/audios/032_01.mp3",
        "arabic": "اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ، وَعَافِنِي فِيمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيمَا أَعطَيْتَ، وَقِنِي شَرَّ مَا\\n\\nقَضَيْتَ، فَإِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ، إِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ، [وَلَا يَعِزُّ مَنْ عَادَيْتَ]، تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
        "latin": "All-llahumme-hdini fi men hedejt ve afini fi men afejt ve tevel-leni fi men tevel-lejt ve barik li fi ma a’ëtajt ve kini sherre ma kadajt fe inneke takdi ve la jukda alejk, innehu la jedhil-lu men valejte ve la je’izu men adejt tebarekte Rabbena ve te’alejt",
        "albanian": "O Allahu im, më bëj mua prej atyre që Ti i ke udhëzuar dhe më bëj prej atyre që Ti i ke falur, më bëj prej të dashurve Tu, më beko mua në atë që më ke dhënë dhe më mbroj nga dëmi i asaj që Ti ke caktuar. Vërtet, Ti je Ai i Cili cakton dhe askush nuk mund të caktojë kundër Teje asgjë. Me të vërtetë nuk ka mposhtje për atë të cilin Ti e miqëson dhe nuk ka krenari për atë që Ti e armiqëson. I Madhëruar je O Zoti ynë dhe i Lartësuar je Ti.",
        "reference": "E shënojnë autorët e katër suneneve dhe Ahmedi, i vërtetë sipas Albanit “Irvaul-Galil” 2/172."
      },
      {
        "id": 115,
        "audio": "/audios/032_02.mp3",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مَنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وأَعُوذُ بِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
        "latin": "All-llahumme inni eudhu bi ridake min sehatik, ve bi muafatike min ukabetik, ve eudhu bike minke, la uhsi thenaen Alejke, Enta kema ethnejte ala Nefsike",
        "albanian": "O Allahu im, kërkoj strehim te Ti me anë të kënaqësisë Tënde nga hidhërimi Yt dhe me faljen Tënde nga dënimi Yt. Kërkoj mbrojtjen Tënde nga Ti, unë nuk mund të të madhëroj aq sa meriton Ti; Ti je i Madhëruar ashtu siç e ke përshkruar Veten.",
        "reference": "E shënojnë autorët e katër suneneve dhe Ahmedi. Shih “Sahih et-Tirmidhi” 3/180, “Sahih Ibën Maxheh” 1/194, “Irvaul-Galil” 2/175."
      },
      {
        "id": 116,
        "audio": "/audios/032_03.mp3",
        "arabic": "اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِالْكَافِرِينَ مُلْحَقٌ. اللَّهُمَّ إِنَّا نَسْتَعِينُكَ، وَنَسْتَغْفِرُكَ، وَنُثْنِي عَلَيْكَ الْخَيْرَ، وَلَا نَكْفُرُكَ، وَنُؤْمِنُ بِكَ وَنَخْضَعُ لَكَ، وَنَخْلَعُ مَنْ يَكْفُرُكَ",
        "latin": "All-llahumme ijjake na’budu ve leke nusal-li ve nesxhudu, ve ilejke nes’a ve nahfidu, nerxhu rahmeteke, ve nahsha adhabeke inne adhabeke bil-kafirine mulhak. All-llahumme inna neste’i nuke ve nestagfiruke ve puthni alejkel-hajre, ve la nekfuruke, ve nu’minu bike ve nahda’u leke ve nahla’u men jekfuruke",
        "albanian": "O Allahu im, vetëm Ty të adhurojmë, për Ty falemi dhe vetëm Ty të përulemi, kah Ti vijmë dhe shpejtojmë, shpresojmë mëshirën Tënde dhe i frikohemi dënimit Tënd. Vërtetë, dënimi Yt do t’i arrijë jobesimtarët. O Allahu im, prej Teje kërkojmë ndihmë dhe falje. Ty të Falënderojmë me çdo gjë të mirë. Nuk të mohojmë dhe vetëm Ty të besojmë. Vetëm Ty të përulemi dhe e braktisim atë që Ty të mohon.",
        "reference": "Bejhekiu në “Es-Sunen el-Kubra” 2/211, senedi i vërtetë sipas Albanit “Irvaul-Galil” 2/170 dhe është nga fjalët e Omerit (Allahu qoftë i kënaqur me të)."
      }
    ]
  },
  {
    "id": 33,
    "chapter_name": "33.Dhikri pas selamit në namazin e vitrit",
    "invocations": [
      {
        "id": 117,
        "audio": "/audios/033_01.mp3",
        "arabic": "سُبْحَانَ المَلِكِ القُدُّوسِ.",
        "latin": "Subhane Melikil-Kuddus",
        "albanian": "“I Madhëruar qoftë Allahu, Sunduesi i Pastër nga çdo e metë.”\\nKëtë e thotë tri herë, kurse herën e tretë e thotë me zë duke e zgjatur zërin. ",
        "reference": ""
      }
    ]
  },
  {
    "id": 34,
    "chapter_name": "34.Lutjet në raste të brengosjes dhe pikëllimit",
    "invocations": [
      {
        "id": 118,
        "audio": "/audios/034_01.mp3",
        "arabic": "للّهُـمَّ إِنِّي عَبْـدُكَ ابْنُ عَبْـدِكَ ابْنُ أَمَتِـكَ نَاصِيَتِي بِيَـدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤكَ أَسْأَلُـكَ بِكُلِّ اسْمٍ هُوَ لَكَ\\n\\nسَمَّـيْتَ بِهِ نَفْسَكَ أِوْ أَنْزَلْتَـهُ فِي كِتَابِكَ، أَوْ عَلَّمْـتَهُ أَحَداً مِنْ خَلْقِـكَ أَوِ اسْتَـأْثَرْتَ بِهِ فِي عِلْمِ الغَيْـبِ عِنْـدَكَ أَنْ تَجْـعَلَ\\n\\nالقُرْآنَ رَبِيـعَ قَلْبِـي، وَنورَ صَـدْرِي وجَلَاءَ حُـزْنِي وذَهَابَ هَمِّـي",
        "latin": "All-llahumme inni abduke ve ibnu abdike ve ibnu emmetike, nasijeti bijedike, madin fijje hukmuke, adlun fijje kadauke, es’eluke bi kul-li ismin huve leke semmejte bihi nefseke ev enzeltehu fi kitabike ev al-lemtehu ehaden min halkike, ev iste’therte bihi fi ilmil-gajbi indeke, en texh’alel-Kur’ane rebi’a kalbi ve nure sadri ve xhelae huzni ve dhihabe hemmi",
        "albanian": "O Allahu im, unë jam robi Yt dhe biri i robit dhe i robëreshës Tënde. Balli im është në dorën Tënde, dispozitat Tuaja mbi mua i pranoj, i drejtë është gjykimi Yt mbi mua. Të lutem me çdo emër me të cilin e ke emëruar Veten Tënde apo që e ke zbritur në librin Tënd, apo ia ke mësuar dikujt prej krijesave Tua, apo që e ke mbajtur të fshehur në diturinë Tënde, bëje Kuranin pranverë të zemrës sime dhe dritë të gjoksit tim, shndritje për pikëllimin dhe largimin e dëshpërimit.",
        "reference": "Ahmedi 1/391. Sahih sipas shejh Albanit."
      },
      {
        "id": 119,
        "audio": "/audios/034_02.mp3",
        "arabic": "اللّهُـمَّ إِنِّي أَعْوذُ بِكَ مِنَ الهَـمِّ وَ الْحُـزْنِ، والعًجْـزِ والكَسَلِ والبُخْـلِ والجُـبْنِ، وضَلْـعِ الـدَّيْنِ وغَلَبَـةِ الرِّجال",
        "latin": "All-llahumme inni eudhu bike minel-hemmi vel-huzni, vel-axhzi vel-keseli, vel-buhli vel-xhubni, ve dale’id-dejni ve galebetir-rixhali",
        "albanian": "O Allahu im, kërkoj mbrojtjen Tënde nga brengat dhe dëshpërimi, nga paaftësia dhe dembelia, nga koprracia dhe frika, nga zhytja në borxhe dhe mundimet prej njerëzve.",
        "reference": "Buhariu 7/158; “I Dërguari e përsëriste shpesh këtë dua”, “Fet’hul-Bari” 11/173."
      }
    ]
  },
  {
    "id": 35,
    "chapter_name": "35.Duaja gjatë vështirësive",
    "invocations": [
      {
        "id": 120,
        "audio": "/audios/035_01.mp3",
        "arabic": "لا إلَهَ إلاَّ اللَّهُ الْعَظـيمُ الْحَلِـيمْ، لا إلَهَ إلاَّ اللَّهُ   رَبُّ العَـرْشِ العَظِيـمِ، لا إلَهَ إلاَّ اللَّهُ  رَبُّ السَّمَـوّاتِ ورّبُّ الأَرْضِ ورَبُّ\\n\\nالعَرْشِ الكَـريم ",
        "latin": "La Ilahe il-lAll-llahu el-Adhimu el-Halimu, la Ilahe il-lAll-llahu Rabbul-Arshil-Adhimi, la Ilahe il-lAll-llahu Rabbus-semavati ve Rabbul-erdi ve Rabbul-Arshil-kerim",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut të Madhëruar e të Urtë. Nuk ka hyjni që meriton të adhurohet përveç Allahut, Zotit të Arshit të Lartësuar. Nuk ka hyjni që meriton të adhurohet përveç Allahut, Zotit të qiejve dhe të tokës dhe Zotit të Arshit Fisnik.",
        "reference": "Buhariu 7/154, Muslimi 4/2092."
      },
      {
        "id": 121,
        "audio": "/audios/035_02.mp3",
        "arabic": "اللّهُـمَّ رَحْمَتَـكَ أَرْجـوفَلا تَكِلـني إِلى نَفْـسي طَـرْفَةَ عَـيْن، وَأَصْلِـحْ لي شَأْنـي كُلَّـه لَا إِلَهَ إِلَّا أنْـت",
        "latin": "All-llahumme rahmeteke erxhu fe la tekilni ilá nefsi tarfet ajnin ve aslih li she’ni kul-lehu. La ilahe il-la Ente",
        "albanian": "O Allahu im, në mëshirën Tënde shpresoj, mos më le të mbështetem në vetvete, as sa një përpëlitje e syrit dhe ma përmirëso gjendjen time. Nuk ka të adhuruar tjetër përveç Teje.",
        "reference": "Ebu Davudi 4/324, Ahmedi 5/42. Shejh Albani e ka bërë të mirë (Hasen), “Sahih Ebu Davud” 3/959."
      },
      {
        "id": 122,
        "audio": "/audios/035_03.mp3",
        "arabic": "لاَ إِلَهَ إِلَّا أنْـت سُـبْحانَكَ إِنِّي كُنْـتُ مِنَ الظّـالِميـن",
        "latin": "La ilahe il-la Ente Subhaneke Inni kuntu minedh-dhalimin",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Teje që je i Madhëruar. Vërtetë, unë jam prej mëkatarëve.",
        "reference": "Tirmidhiu 5/529 dhe Hakimi, i cili e ka bërë të vërtetë, kurse Dhehebiu e ka pëlqyer 1/505 “Sahih et-Tirmidhi” 3/168."
      },
      {
        "id": 123,
        "audio": "/audios/035_04.mp3",
        "arabic": "اللهُ اللهُ رَبِّ لا أُشْـرِكُ بِهِ شَيْـئاً",
        "latin": "Allahu, Allahu Rabbi, La ushriku bihi shej’en",
        "albanian": "Allahu, Allahu është Zoti im, Atij nuk i shoqëroj asnjë send.",
        "reference": "Shënon Ebu Davudi 2/87 “Sahih Ibën Maxheh” 2/335."
      }
    ]
  },
  {
    "id": 36,
    "chapter_name": "36.Duaja me rastin e takimit me armikun dhe njerëzit në pozitë",
    "invocations": [
      {
        "id": 124,
        "audio": "/audios/036_01.mp3",
        "arabic": "اللّهُـمَّ إِنا نَجْـعَلُكَ في نُحـورِهِـم، وَنَعـوذُ بِكَ مِنْ شُرورِهـمْ",
        "latin": "All-llahumme inna nexh’aluke fi nuhurihim ve neudhu bike min shururihim",
        "albanian": "O Allahu im, Ty të lëmë në qafat e tyre; prej Teje ndihmë kërkojmë të na mbrosh prej djallëzisë së tyre.",
        "reference": "Ebu Davudi 2/89, hadithin e ka bërë te vërtetë Hakimi dhe e ka pëlqyer Dhehebiu 2/142."
      },
      {
        "id": 125,
        "audio": "/audios/036_02.mp3",
        "arabic": "اللّهُـمَّ أَنْتَ عَضُـدي، وَأَنْتَ نَصـيري، بِكَ أَجـولُ وَبِكَ أَصـولُ وَبِكَ أُقـاتِل",
        "latin": "All-llahumme Ente Adudí ve Ente Nesiri, bike ehulu, ve bike esulu, ve bike ukatilu",
        "albanian": "O Allahu im, Ti je fuqia ime, Ti je Ndihmëtari im, me ndihmën Tënde hyj në luftë, me ndihmën Tënde ngadhënjej dhe me ndihmën Tënde luftoj.",
        "reference": "Ebu Davudi 3/42, Tirmidhiu 5/572 “Sahih et-Tirmidhi” 3/183."
      },
      {
        "id": 126,
        "audio": "/audios/036_03.mp3",
        "arabic": "حَسْبُـنا اللهُ وَنِعْـمَ الوَكـيل",
        "latin": "HasbunAll-llahu ve ni’mel-Vekil",
        "albanian": "Na mjafton neve Allahu, Ai është mbrojtësi më i mirë.",
        "reference": "Buhariu 5/172."
      }
    ]
  },
  {
    "id": 37,
    "chapter_name": "37.Duaja për atë i cili i frikohet dëmit të udhëheqësit",
    "invocations": [
      {
        "id": 127,
        "audio": "/audios/037_01.mp3",
        "arabic": "أللَّهُمَّ رَبَّ السَّمواتِ السَّبْعِ وَرَبَّ الْعَرْشِ الْعَظِيْمِ, كُنْ لِي جاَراً مِنْ (فُلانِ بْنِ فُلاَنٍ),وَأَحْزَابِهِ مِنْ خَلاَئِقِكَ أَنْ يَفْرُطَ عَلَيَّ أحَدٌ مِنْهُمْ أَوْ يَطْغَى, عَزَّ جاَرُكَ وَجَلَّ ثَناَؤُكَ, وَ لاَ إِلَهَ إلاَّ أَنْتَ ",
        "latin": "All-llahumme Rabbes-semavatis-seb’i ve Rabbel-Arshil-Adhimi, kun li xharen min fulani bin fulanin ve ahzabihi min halaikike, en jefruta alejje ehadun minhum ev jatga, azze xharuke, ve xhel-le thenauke ve la Ilahe il-la Ente",
        "albanian": "O Allahu im, Zot i shtatë qiejve dhe Zot i Arshit të Madh, më mbroj mua prej filanit, birit të filanit dhe aleatëve të tij, si dhe prej krijesave Tua, mos e bëj ndonjërin prej tyre të më prijë mua apo të më sundojë. E fuqishme është ndihma Jote dhe i lartë është falënderimi Yt. Nuk ka të adhuruar tjetër përveç Teje.",
        "reference": "Buhariu “Edebul-Mufred” hadithi nr. 707, shejh Albani e ka bërë të vërtetë (sahih) në “Sahih Edebul-Mufred” #545."
      },
      {
        "id": 128,
        "audio": "/audios/037_02.mp3",
        "arabic": "الله أكْبَرُ، الله أعَزُّ مِنْ خَلْقِهِ جَمِيْعاً ، الله أعَزُّ مِمَّا أخَافُ وَأحْذَرُ, أعُوذُ بِاللهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ ، الْمُمْسِكِ السَّمَوَاتِ السَّبْعِ أَنْ يَقَعْنَ عَلَى الأَرْضِ ِإلاَّ بِإِذْنِهِ ، مِنْ شَرِّ عَبْدِكَ (فلان) وَجُنُوْدِهِ وَأَتْبَاعِهِ وَأَشْيَاعِهِ ، مِنَ اْلجِنِّ والإِنْسِ ، اَلَّلهُمَّ كُنْ لِيْ جَاراً مِنْ شَرِّهِمْ ، جَلَّ ثَنَاؤُكَ وَعَزَّ جَارُكَ ، وَتَبَارَكَ اسْمُكَ ،وَلاَ إلَهَ غَيْرُك",
        "latin": "All-llahu ekber, All-llahu E’azzu min hal-kihi xhemian, All-llahu E’azzu mimmen ehafu ve ehdheru, eudhu bil-lahi el-ledhi la Ilahe il-la huve, Mumsikis-semavatis-seb’i en jeka’ëne alel-erdi il-la bi idhnihi, min sherri abdike fulanin, ve xhunudihi ve etba’ihi ve eshja’ihi, minel-xhinni vel-insi, All-llahumme kun li xharen min sherrihim, xhel-le thenauke ve azze xharuke, ve tebarekes-muke ve la Ilahe Gajruke. (3 herë).",
        "albanian": "Allahu është më i Madhi, Allahu është më i Fuqishëm se të gjitha krijesat e Tij, Allahu është më i Fuqishëm se ai nga i cili frikësohem dhe kujdesem. Kërkoj mbrojtjen e Allahut i Cili nuk ka të adhuruar tjetër përveç Tij, i Cili është Mbajtës i shtatë qiejve, që të mos bien në tokë përveç se me lejen e Tij, nga dëmi i robit tënd, filanit, ndihmësve dhe pasuesve të tij, ithtarëve të tij, prej xhinëve dhe njerëzve. O Allah bëhu Mbrojtësi im nga dëmi i tyre. I lartë është Falënderimi Yt dhe e fuqishme është ndihma Jote; i Lartësuar është emri Yt dhe nuk ka të adhuruar tjetër përveç Teje.",
        "reference": "Buhariu, “Edebul-Mufred” #707, shejh Albani e ka bërë të vërtetë (sahih) në “Sahih Edebul-Mufred” #545."
      }
    ]
  },
  {
    "id": 38,
    "chapter_name": "38.Duaja kundër armikut",
    "invocations": [
      {
        "id": 129,
        "audio": "/audios/038_01.mp3",
        "arabic": "اللَّهُمَّ  مُنْزِلَ اْلِكتَابِ ، سَرِيْعَ الْحِسَابِ ،اِهْزِمِ الإْحْزَابَ ،اللَّهُمَّ اِهْزِمْهُمْ وَزَلْزِلْهُمْ",
        "latin": "All-llahumme munzilel-kitabi, seri’al-hisabi, ihzimil-ahzabe, All-llahumme ihzimhum ve zelzilhum",
        "albanian": "O Allahu im, Shpallësi i librave, Llogaritësi i shpejtë, mposhti grupacionet. O Allahu im, mposhti dhe shkatërroj ato.",
        "reference": "Muslimi 3/1362."
      }
    ]
  },
  {
    "id": 39,
    "chapter_name": "39.Çfarë duhet thënë ai që i frikësohet një populli",
    "invocations": [
      {
        "id": 130,
        "audio": "/audios/039_01.mp3",
        "arabic": "اللَّهُمَّ اكْفِنِيهِمْ بِماَ شِئْتَ",
        "latin": "All-llahumme ikfinihim bima shi’te",
        "albanian": "O Allahu im, më mbroj prej tyre me çfarë të dëshirosh.",
        "reference": "Muslimi 4/2300."
      }
    ]
  },
  {
    "id": 40,
    "chapter_name": "40.Çfarë duhet vepruar ai të cilin e ka kapluar dyshimi në besim",
    "invocations": [
      {
        "id": 131,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "1. Duhet kërkuar mbrojtje nga Allahu i Madhë-ruar. \\n2. Duhet të largohet prej asaj në çka ka dyshuar. \\n",
        "reference": "Buhariu “Fet’hul-Bari” 6/336 Muslimi 1/120.\\nBuhariu “Fet’hul-Bari” 6/336 Muslimi 1/120.\\n"
      },
      {
        "id": 132,
        "audio": "/audios/040_01.mp3",
        "arabic": "آمَنْـتُ بِاللهِ وَرُسُـلِه",
        "latin": "Amentu bil-lahi ve rusulihi",
        "albanian": "3. Duhet të thotë: “Kam besuar në Allahun dhe në të Dërguarit e Tij.”",
        "reference": "Muslimi 1/119-120."
      },
      {
        "id": 133,
        "audio": "/audios/040_02.mp3",
        "arabic": "هُوَ الأوَّلُ، وَالآخِـرُ، وَالظّـاهِـرُ، وَالْبـاطِـنُ، وَهُوَ بِكُلِّ شَيءٍ عَلـيم",
        "latin": "Huvel-Evvelu vel-Ahiru vedh-Dhahiru vel-Batinu ve Huve bi kul-li shej’in alim",
        "albanian": "4. Duhet të lexojë fjalën e Allahut të Lartësuar: “Ai, Allahu është i Pari dhe i Fundit, i Dukshmi dhe i Padukshmi, si dhe më i Dijshmi për çdo gjë.”",
        "reference": "Hadid, 3. Ebu Davudi 4/329, hadith i mirë sipas shejh Albanit “Sahih Ebu Davud” 3/962."
      }
    ]
  },
  {
    "id": 41,
    "chapter_name": "41.Lutja e atij që është i ngarkuar me borxhe",
    "invocations": [
      {
        "id": 134,
        "audio": "/audios/041_01.mp3",
        "arabic": "للّهُـمَّ اكْفِـني بِحَلالِـكَ عَنْ حَـرامِـك، وَأَغْنِـني بِفَضْـلِكِ عَمَّـنْ سِـواك",
        "latin": "All-llahummek-fini bi halalike an haramike ve agnini bi fadlike ammen sivake",
        "albanian": "O Allahu im, më bëj që të më mjaftojë hallalli Yt dhe të mos i afrohem haramit, si dhe më bëj të pasur me mirësitë Tua, që të mos kërkoj prej tjetërkujt përveç prej Teje.",
        "reference": "Shënon Tirmidhiu 5/560, “Sahih et-Tirmidhi” 3/180."
      },
      {
        "id": 135,
        "audio": "/audios/041_02.mp3",
        "arabic": "اللّهُـمَّ إِنِّي أَعْوذُ بِكَ مِنَ الهَـمِّ وَ الْحُـزْنِ، والعًجْـزِ والكَسَلِ والبُخْـلِ والجُـبْنِ، وضَلْـعِ الـدَّيْنِ وغَلَبَـةِ الرِّجال",
        "latin": "All-llahumme inni eudhu bike minel-hemmi vel-hazeni, vel-axhzi vel-keseli, vel-buhli vel-xhubni, ve dale’id-dejni ve galebetir-rixhal",
        "albanian": "O Allahu im, kërkoj mbrojtjen Tënde nga brengat dhe dëshpërimi, nga paaftësia dhe dembelia, nga koprracia dhe frika, nga zhytja në borxhe dhe mundimet prej njerëzve.",
        "reference": "Buhariu 7/158"
      }
    ]
  },
  {
    "id": 42,
    "chapter_name": "42.Duaja kundër vesveseve në namaz dhe gjatë leximit të kuranit",
    "invocations": [
      {
        "id": 136,
        "audio": "/audios/042_02.mp3",
        "arabic": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطانِ الرَّجِيْمِ",
        "latin": "Eudhu bil-lahi minesh-shejtanir-raxhim",
        "albanian": "Kërkoj mbrojtje tek Allahu nga shejtani i mallkuar. (dhe pështyn në të majtë tri herë).",
        "reference": "Shënon Muslimi 4/1729, nga hadithi të cilin e rrëfen Othman bin As  , i cili thotë: “Kam vepruar kështu dhe Allahu e ka larguar atë nga unë.”"
      }
    ]
  },
  {
    "id": 43,
    "chapter_name": "43.Duaja e atij që i vështirësohet ndonjë çështje",
    "invocations": [
      {
        "id": 137,
        "audio": "/audios/043_01.mp3",
        "arabic": "اللّهُـمَّ لا سَـهْلَ إِلاّ ما جَعَلـتَهُ سَهـلاً، وَأَنْتَ تَجْـعَلُ الْحَـزَنَ إِذا شِـئْتَ سَهـْلاً",
        "latin": "All-llahumme la sehle il-la ma xhealtehu, sehlen ve Ente texh’alul-hazne idha shi’te sehlen",
        "albanian": "O Allahu im, nuk ka asgjë të lehtë përveç asaj që Ti e ke bërë të lehtë, Ti e bën pikëllimin të lehtë, nëse dëshiron.",
        "reference": "Ibën Hibbani në “Sahihun” e tij, #2427, Ibën Sunnij #351. Ibën Haxheri e ka autentifikuar hadithin dhe Abdulkadër Arnauti në veprën “Edhkar” të Neveviut fq.106."
      }
    ]
  },
  {
    "id": 44,
    "chapter_name": "44.Çfarë duhet të thotë dhe vepron ai cili bën ndonjë mëkat",
    "invocations": [
      {
        "id": 223,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "1. Duhet të pështyjë tri herë në anën e majtë. \\n2. Të kërkojë mbrojtjen e Allahut të Lartësuar nga djalli i mallkuar dhe nga e keqja e asaj që ka parë (3 herë). \\n3. Mos t’ia tregojë këtë askujt. \\n4. Të kthehet në krahun e kundërt. \\n5. Ngritët dhe falet nëse e dëshiron këtë.",
        "reference": "Muslimi 4/1772, 1773."
      }
    ]
  },
  {
    "id": 45,
    "chapter_name": "45.Duaja për largimin e djallit dhe vesveseve të tij",
    "invocations": [
      {
        "id": 268,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "1. Të kërkuarit mbrojtje nga Allahu i Lartësuar, prej tij. \\n2. Këndimi i ezanit. \\n3. Duatë, dhikret dhe leximi i Kuranit. \\n",
        "reference": "Ebu Davudi 1/206, Tirmidhiu “Sahih et-Tirmidhi” 1/77, Mu’minun, 98-99.\\nBuhariu 1/151, Muslimi 1/291.\\nI Dërguari   ka thënë: “Mos i bëni shtëpitë tuaja si varre, me të vërtetë djalli ik nga ajo shtëpi në të cilën lexohet sure Bekare”. Shënon Muslimi 1/539. Pastaj, ajo që e largon shejtanin janë edhe lutjet e mëngjesit dhe të mbrëmjes, para zgjimit, lutjet me rastin e hyrjes dhe daljes nga shtëpia, lutjet e hyrjes dhe daljes nga xhamia, si dhe lutje të tjera të cilat janë të transmetuara, si p.sh. leximi i Ajetul-Kursisë para fjetjes, leximi i dy ajeteve të fundit të sures Bekare, po ashtu, i Dërguari  ka thënë: “Kush në ditë thotë 100 herë: [La ilahe il-la-ll-llahu vahdehu la sherike leh, lehul mulku ve lehul hamdu ve huve ala kul-li shejin kadir]”. “Nuk ka hyjni që meriton të adhurohet pos Allahut, të Vetëm e i pa rival. Atij I takon Sundimi dhe Lavdërimi dhe Ai është i Gjithëfuqishëm mbi çdo gjë.”, do të jetë i mbrojtur prej shejtanit tërë ditën.” Po ashtu, e cekëm se edhe ezani e largon shejtanin.\\n"
      }
    ]
  },
  {
    "id": 46,
    "chapter_name": "46.Duaja kur të ndodhë diçka e papëlqyer",
    "invocations": [
      {
        "id": 138,
        "audio": "/audios/046_01.mp3",
        "arabic": "قَدَّرَ اللهُ وَما شـاءَ فَعَـل",
        "latin": "Kaderull-llahi ve ma sha’e feale",
        "albanian": "Allahu e ka caktuar dhe Ai bën çka të dëshiroj.",
        "reference": "“Besimtari i fortë është më i mirë dhe më i dashur tek Allahu se sa besimtari i dobët. Nxito në ato që ke dobi, kërko ndihmë nga Allahu, mos u dobëso dhe nëse të godet ndonjë sprovë, mos thuaj sikur të kisha vepruar kështu apo ashtu, por thuaj: Kaderull-llahi ve ma sha’e feale.” (Allahu e ka caktuar atë dhe Ai bën çka të dëshiroj).” Muslimi 4/2052."
      },
      {
        "id": 224,
        "audio": "/audios/.mp3",
        "arabic": "رَبِّ الْمَلاَئِكَةِ وَالرُّوحِ",
        "latin": "Rabbil-Melaiketi ver-Ruh",
        "albanian": "Zoti i Melaikeve dhe i Xhibrilit.",
        "reference": "Nesaiu 3/244, Darekutni dhe të tjerë; shtojca në mes të kllapave është e Darekutnit 2/31. Senedi i këtij hadithi është i vërtetë. Shih “Zadul-Me’ad” me recensurën e Shuajb dhe Abdulkadër Arnautit 1/337)."
      }
    ]
  },
  {
    "id": 47,
    "chapter_name": "47.Mbi përgëzimin e të posalindurit",
    "invocations": [
      {
        "id": 269,
        "audio": "/audios/047_01.mp3",
        "arabic": "بَارَكَ اللهُ لَكَ فِي الْمَوْهُوبِ لَكَ، وَشَكَرْتَ الْوَاهِبَ، وَبَلَغَ أَشُدَّهُ، وَرُزِقْتَ بِرَّهُ\\n\\nKurse ky ia kthen duke thënë:\\nبَارَكَ اللهُ لَكَ وَبَارَكَ عَلَيْكَ، وَجَزَاكَ اللهُ خَيْراً، وَرَزَقَكَ اللهُ مِثْلَهُ، وَأَجْزَلَ ثَوَابَكَ\\n",
        "latin": "BarekAll-llahu leke fil-mevhubi leke, ve shekertel-vahibe, ve belega eshuddehu, ve ruzikte birreh\\n\\nBarekAll-llahu leke ve alejke, ve xhezakAll-llahu hajren, ve rezekakAll-llahu mithlehu ve exhzele thevabehu",
        "albanian": "Allahu të bekoftë në atë që të ka dhuruar, e Falënderofsh Dhuruesin, e lus Allahun që të rritet dhe të jetë i sjellshëm.\\n\\nEdhe ty të bekoftë Allahu, të shpërbleftë me të mira, të dhuroftë edhe ty një fëmijë sikur ky dhe ta shtoftë shpërblimin.",
        "reference": "“Edhkar” fq.349, Neveviu, “Sahih el-Edhkar lin-Nevevi” 2/713, Selim Hilali."
      }
    ]
  },
  {
    "id": 48,
    "chapter_name": "48.Me çka duhet kërkuar mbrojtje për fëmijët",
    "invocations": [
      {
        "id": 139,
        "audio": "/audios/048_01.mp3",
        "arabic": "I Dërguari (a.s) për nipat e tij, Hasanin dhe Husejnin, kërkonte mbrojte duke bërë këtë lutje:\\n أُعِيذُكُمَا بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لاَمَّةٍ",
        "latin": "Uidhukuma bi kelimatil-lahit-tammeh, min kul-li shejtanin ve hammeh, ve min kul-li ajnin ve lameh",
        "albanian": "Lus Allahun që t’ju mbrojë me fjalët e tija të plota nga çdo shejtan, nga çdo dyshim i tij dhe prej çdo syri të keq.",
        "reference": "Buhariu 4/119."
      }
    ]
  },
  {
    "id": 49,
    "chapter_name": "49.Lutja për të sëmurin kur e vizitojmë",
    "invocations": [
      {
        "id": 140,
        "audio": "/audios/049_01.mp3",
        "arabic": "لا بأْسَ طَهـورٌ إِنْ شـاءَ الله",
        "latin": "La be’se tahurun insha-All-llah",
        "albanian": "Nuk ka gjë, pastrim nga mëkatet InshAllah.",
        "reference": "“Fet’hul-Bari” 10/118."
      },
      {
        "id": 141,
        "audio": "/audios/049_02.mp3",
        "arabic": "أَسْـأَلُ اللهَ العَـظيـم، رَبَّ العَـرْشِ العَـظيـم أَنْ يَشْفِيَكَ",
        "latin": "Es’elull-llahe el-Adhime Rabbel Arshil Kerimi en jeshfijek. (7 herë)",
        "albanian": "E lus Allahun e Madhërishëm, Zotin e Arshit të madh, që të të shërojë.",
        "reference": "Shënohet se i Dërguari ka thënë: “Nuk e ka vizituar asnjë njeri një vëlla të vetin musliman të sëmurë, të cilit nuk i ka ardhur vdekja, e i ka thënë shtatë herë:... (hadithin) e që Allahu nuk e ka shëruar.” Shënon Tirmidhiu dhe Ebu Davudi, “Sahih et-Tirmidhi” 2/210 dhe “Sahih el-Xhamiu” 5/180.”"
      }
    ]
  },
  {
    "id": 50,
    "chapter_name": "50.Vlera e vizitës së të sëmurit",
    "invocations": [
      {
        "id": 266,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "I Dërguari (a.s) ka thënë: “Nëse një njeri e viziton vëllain e tij musliman të sëmurë, ecë nëpër rrugën e Xhenetit derisa të ulet, ndërsa kur të ulet do ta përfshijë mëshira e Allahut, nëse e ka vizituar në mëngjes, shtatëdhjetë mijë melaike bëjnë dua për atë person deri në mbrëmje, e nëse e ka vizituar në mbrëmje, shtatëdhjetë mijë melaike bëjnë dua për atë person deri në mëngjes.” ",
        "reference": "Tirmidhiu, Ibën Maxheh dhe Ahmedi “Sahih Ibën Maxhe” 1/244 dhe “Sahih et-Tirmidhi” 1/286. Gjithashtu hadithin e ka bërë të vërtetë edhe Ahmed Shakiri."
      }
    ]
  },
  {
    "id": 51,
    "chapter_name": "51.Duaja e të sëmurit në prag të vdekjes",
    "invocations": [
      {
        "id": 142,
        "audio": "/audios/051_01.mp3",
        "arabic": "أللّهُـمَّ اغْفِـرْ لي وَارْحَمْـني وَأَلْحِقْـني بِالرَّفـيقِ الأّعْلـى",
        "latin": "All-llahumme-gfir li, ver-hamni, ve elhikni bir-refikil-a’la",
        "albanian": "O Allahu im, më falë dhe më mëshiro mua dhe më bashko me shoqëruesin më të Lartë.",
        "reference": "Buhariu 7/10 dhe Muslimi 4/1893."
      },
      {
        "id": 143,
        "audio": "/audios/.mp3",
        "arabic": "I Dërguari (a.s) në prag të vdekjes së tij i fuste duart në ujë, e fërkonte me to fytyrën e tij dhe thoshte:\\nلاَ إِلَهَ إِلاَّ اللهُ إِنَّ لِلْمَوْتِ سَكَرَاتٍ\\n",
        "latin": "La ilahe il-laAll-llahu inne lil mevti le sekeratin",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut, vërtet vdekja ka agonitë e saja.",
        "reference": "“Fet’hul-Bari” 8/144."
      },
      {
        "id": 144,
        "audio": "/audios/051_03.mp3",
        "arabic": "لا إلهَ إلاّ اللّهُ وَاللّهُ أَكْبَـر، لا إلهَ إلاّ اللّهُ وحْـدَهُ, لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شَريكَ لهُ، لا إلهَ إلاّ اللّهُ لهُ المُلكُ ولهُ الحَمْد،\\n\\nلا إلهَ إلاّ اللّهُ وَلا حَـوْلَ وَلا قُـوَّةَ إِلاّ بِالله",
        "latin": "La ilahe il-laAll-llahu vAll-llahu Ekber, La ilahe il-laAll-llahu vahdehu, La ilahe il-laAll-llahu vahdehu la sherike leh, La ilahe il-laAll-llahu lehul-Mulku ve lehul-Hamdu, La ilahe il-laAll-llahu ve la havle ve la kuvvete il-la bil-lah",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut; Allahu është më i Madhi; nuk ka hyjni që meriton të adhurohet përveç Allahut të Vetëm; nuk ka hyjni që meriton të adhurohet përveç Allahut Një dhe i pashoq; nuk ka hyjni që meriton të adhurohet përveç Allahut, Atij i takon sundimi dhe Falënderimi; nuk ka hyjni që meriton të adhurohet përveç Allahut dhe nuk ka ndryshim e as fuqi pa ndihmën e Allahut.",
        "reference": "Shënojnë Tirmidhiu dhe Ibën Maxheh dhe hadithin e ka vërtetuar shejh Albani “Sahih Ibën Maxhe” 1/317, “Sahih et-Tirmidhi” 3/153."
      }
    ]
  },
  {
    "id": 52,
    "chapter_name": "52.Të përkujtuarit e shehadetit atij që është në prag të vdekjes",
    "invocations": [
      {
        "id": 145,
        "audio": "/audios/.mp3",
        "arabic": "لا إلهَ إلاّ اللّه",
        "latin": "La Ilahe ilAll-llah",
        "albanian": "I Dërguari ka thënë: “Kush e ka fjalën e tij të fundit: “La Ilahe ilAll-llah”, do të hyjë në xhenet.”",
        "reference": "Shënon Ebu Davudi 3/190 “Sahih el-Xhamiu” 5/432."
      }
    ]
  },
  {
    "id": 53,
    "chapter_name": "53.Duaja me rastin e fatkeqësisë",
    "invocations": [
      {
        "id": 146,
        "audio": "/audios/053_01.mp3",
        "arabic": "إِنّا للهِ وَإِنَا إِلَـيْهِ راجِعـون ، اللهُـمِّ اْجُـرْني في مُصـيبَتي، وَاخْلُـفْ لي خَيْـراً مِنْـها.",
        "latin": "Inna lil-lahi ve inna ilejhi raxhi’un, All-llahumme uxhurni fi musibeti ve ahlif li hajren minha",
        "albanian": "Ne jemi të Allahut dhe tek Ai kthehemi. O Allahu im, më shpërble për këtë fatkeqësi dhe ma kompenso këtë fatkeqësi me diçka më të mirë se kjo fatkeqësi.",
        "reference": "Muslimi 2/632."
      }
    ]
  },
  {
    "id": 54,
    "chapter_name": "54.Duaja me rastin e vdekjes së ndonjë personi",
    "invocations": [
      {
        "id": 147,
        "audio": "/audios/054_01.mp3",
        "arabic": "اللهُـمِّ اغْفِـرْ لِـ-فلان باسـمه- وَارْفَعْ دَرَجَتَـهُ في المَهْـدِييـن ، وَاخْـلُفْـهُ في عَقِـبِهِ في الغابِـرين، وَاغْفِـرْ لَنـا وَلَـهُ يا رَبَّ العـالَمـين، وَافْسَـحْ لَهُ في قَبْـرِهِ وَنَـوِّرْ لَهُ فيه",
        "latin": "All-llahumme-gfir li fulani (e emëron), verfa’ derexhetehu fil-mehdijjin veh-luf-hu fi akibihi fil-gabirin, va-gfir lena ve lehu ja Rabbel-alemin, vef-sah lehu fi kabrihi ve nevvir lehu fíhi",
        "albanian": "O Allahu im, fale filanin (e emëron) dhe ngrite atë në shkallën e të udhëzuarve, zëvendësoje atë me ata që mbesin nga pasardhësit e tij, na i fal mëkatet tona dhe të atij, o Zot i të gjitha botëve, zgjeroja varrin dhe ndriçoja atë.",
        "reference": "Muslimi 2/634."
      }
    ]
  },
  {
    "id": 55,
    "chapter_name": "55.Duaja për të vdekurin kur t’i falet namazi",
    "invocations": [
      {
        "id": 148,
        "audio": "/audios/055_01.mp3",
        "arabic": "اللهُـمِّ اغْفِـرْ لَهُ وَارْحَمْـه ، وَعافِهِ وَاعْفُ عَنْـه ، وَأَكْـرِمْ نُزُلَـه ، وَوَسِّـعْ مُدْخَـلَه ، وَاغْسِلْـهُ بِالْمـاءِ وَالثَّـلْجِ وَالْبَـرَدْ ،\\n\\nوَنَقِّـهِ مِنَ الْخطـايا كَما نَـقّيْتَ الـثَّوْبُ الأَبْيَـضُ مِنَ الدَّنَـسْ ، وَأَبْـدِلْهُ داراً خَـيْراً مِنْ دارِه ، وَأَهْلاً خَـيْراً مِنْ أَهْلِـه ،\\n\\nوَزَوْجَـاً خَـيْراً مِنْ زَوْجِه،  وَأَدْخِـلْهُ الْجَـنَّة ، وَأَعِـذْهُ مِنْ عَذابِ القَـبْر وَعَذابِ النّـار ",
        "latin": "All-llahumme-gfir lehu ver-hamhu ve afihi va’fu anhu, ve ekrim nuzulehu, ve vesi’a mud’halehu, vagsilhu bil-mai veth-thelxhi vel-beredi, ve nekkihi minel-hataja kema nekkajte eth-thevbel-ebjeda mined-denesi, ve ebdilhu daren hajren min darihi ve ehlen hajren min ehlihi ve zevxhen hajren min zevxhihi, ve ed-hilhul-xhenete ve eidhhu min adhabil-kabri ve adhabin-nar",
        "albanian": "O Allahu im, falja mëkatet dhe mëshiroje, shpëtoje dhe ki ndjesë ndaj tij, bëja vendin e mirë dhe zgjeroja vendin ku do të hyjë, pastroje atë me ujë, borë dhe akull, pastroje atë nga mëkatet, ashtu siç e pastron rrobën e bardhë nga njollat, zëvendësoja shtëpinë me një shtëpi më të mirë, familjen me një familje më të mirë, bashkëshortin (ten) me një më të mirë, fute në Xhenet dhe mbroje prej dënimit të varrit dhe dënimit të zjarrit.",
        "reference": "Muslimi 2/663."
      },
      {
        "id": 149,
        "audio": "/audios/055_02.mp3",
        "arabic": "اللهُـمِّ اغْفِـرْ لِحَيِّـنا وَمَيِّتِـنا وَشـاهِدِنا ، وَغائِبِـنا ، وَصَغيـرِنا وَكَبيـرِنا ، وَذَكَـرِنا وَأُنْثـانا. اللهُـمِّ مَنْ أَحْيَيْـتَهُ مِنّا فَأَحْيِـهِ عَلى الإِسْلام ،وَمَنْ تَوَفَّـيْتَهُ مِنّا فَتَوَفَّـهُ عَلى الإِيـمان ، اللهُـمِّ لا تَحْـرِمْنـا أَجْـرَه ، وَلا تُضِـلَّنا بَعْـدَه",
        "latin": "All-llahumme-gfir li hajjina ve mejjitina ve shahidina ve gaibina ve sagirina ve kebirina ve dhekerina ve unthana. All-llahumme men ahjejtehu minna fe ahjihí alel-Islami ve men tevefejtehu minna fetevefihi alel-imani. All-llahumme la tahrimna exhrehu ve la tudil-lena ba’dehu",
        "albanian": "O Allahu im, fali të gjallët nga ne dhe të vdekurit, të pranishmit dhe ata në mungesë, të vegjlit dhe të mëdhenjtë, meshkujt dhe femrat. O Allahu im, atij ndër ne që i dhurove jetë udhëzoje të jetojë në Islam, kurse atij që ia merr jetën, merrja duke qenë me besim. O Allahu im, mos na ndalo prej shpërblimit të tij dhe mos na bëj të humbur pas tij.",
        "reference": "Ibën Maxheh 1/480, Ahmedi 2/368 “Sahih Ibën Maxheh” 1/251."
      },
      {
        "id": 150,
        "audio": "/audios/.mp3",
        "arabic": "الَّلهُـمِّ إِنَّ فُلانَ  بْنَ فُلانٍ في ذِمَّـتِك ، وَحَبْـلِ جِـوارِك ، فَقِـهِ مِنْ فِتْـنَةِ الْقَـبْرِ وَعَذابِ النّـار ، وَأَنْتَ أَهْلُ الْوَفـاءِ وَالْـحَقِّ ،\\n\\nفَاغْفِـرْ لَهُ وَارْحَمْـهُ ، إِنَّكَ أَنْتَ الغَـفورُ الـرَّحيم ",
        "latin": "All-llahumme inne fulane ibne fulanin fi dhimmetike ve habli xhivarike, fekihi min fitnetil-kabri ve adhabin-nari, ve Ente ehlul-vefai vel-Hakki, Fag-fir lehu ver-hamhu inneke Entel-Gafurur-Rahim",
        "albanian": "O Allahu im, vërtetë filani, i biri i filanit është në besën Tënde dhe në litarin e fqinjësisë Tënde, Ti je zbatues i premtimit dhe i drejtësisë, andaj fale dhe mëshiroje atë, sepse vërtet Ti je Falës dhe Mëshirues.",
        "reference": "Ibën Maxheh 1/480, Ahmedi 2/368. “Sahih Ibën Maxheh” 1/251"
      },
      {
        "id": 151,
        "audio": "/audios/055_04.mp3",
        "arabic": "اللهُـمِّ عَبْـدُكَ وَابْنُ أَمَـتِك، احْتـاجَ إِلى رَحْمَـتِك، وَأَنْتَ غَنِـيٌّ عَنْ عَذابِـه، إِنْ كانَ مُحْـسِناً فَزِدْ في حَسَـناتِه، وَإِنْ كانَ\\n\\nمُسـيئاً فَتَـجاوَزْ عَنْـه",
        "latin": "All-llahumme abduke ve ibnu emetike ihtaxhe ila rahmetike, ve Ente ganijjun an adhabihi, in kane muhsinen fe zid fi hasenatihi, ve in kane musien fe texhavez anhu",
        "albanian": "O Allahu im, ky robi Yt dhe biri i robëreshës Tënde, ka nevojë për mëshirën Tënde, Ti vërtetë nuk ke nevojë për dënimin e tij. Nëse ka qenë i mirë, shtoja të mirat e tij, e nëse ka qenë jo i mirë, ndihmoi të kalojë nga ai dënim.",
        "reference": "Shënon Hakimi i cili e ka bërë hadithin të vërtet, kurse Dhehebiu e ka pëlqyer 1/359, “Ahkamul-Xhenaiz” të autorit Nasirudin Albani fq.125."
      },
      {
        "id": 225,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "I Dërguari i Allahut (a.s) ka thënë: “Nuk ka rob i cili nuk bën ndonjë mëkat, pastaj ngritët, merr abdes në formën më të mirë, i falë dy rekate dhe pastaj kërkon falje prej Allahut, Allahu vetëm se ia ka falur atë mëkat”.",
        "reference": "Ebu Davudi 2/86, Tirmidhiu 2/257, po ashtu këtë ha-dith e ka vërtetuar shejh Albani “Sahih Ebu Davud” 1/283."
      }
    ]
  },
  {
    "id": 56,
    "chapter_name": "56.Duaja e xhenazës për fëmijë",
    "invocations": [
      {
        "id": 152,
        "audio": "/audios/056_01.mp3",
        "arabic": "أللَّهُمَّ أَعِذْهُ مِنْ عَذابِ الْقَبْرِ",
        "latin": "All-llahumme eidhhu min adhabil-kabr",
        "albanian": "O Allahu im, mbroje nga dënimi i varrit.",
        "reference": "Seid Ibën Musejjib   dhe thotë: “E kam falur pas Ebu Hurejres   namazin e xhenazes së një fëmije i cili nuk ka bërë asnjë mëkat kurrë dhe e kam dëgjuar duke thënë: (dhe e ka cekë hadithin)”. Maliku në “Muvetta” 1/288 dhe Ibën Ebi Shejbe në “Musanef” 3/217 dhe Bejhekiu 4/9, isnadi i vërtetë sipas Sh. Arnauti në recensimin e “Sherh es-Sunneh” të Bagaviut 5/357."
      },
      {
        "id": 153,
        "audio": "/audios/056_02.mp3",
        "arabic": "اللهُـمِّ اجْعَلْـهُ لَنا فَرَطـاً، وَسَلَـفاً وَأَجْـراً",
        "latin": "All-llahummexh-’alhu lena feretan, ve selefen ve exhren",
        "albanian": "O Allahu im, jepi përparësi këtij të vdekuri nga ne dhe jepi shpërblim.",
        "reference": "Shënon Begaviu në veprën e tij “Sherh es-Sunneh” 5/357."
      },
      {
        "id": 226,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "1. Të kërkuarit mbrojtje nga Allahu i Lartësuar, prej tij. \\n2. Këndimi i ezanit. \\n3. Duatë, dhikret dhe leximi i Kuranit. \\n",
        "reference": "Ebu Davudi 1/206, Tirmidhiu “Sahih et-Tirmidhi” 1/77, Mu’minun, 98-99.\\nBuhariu 1/151, Muslimi 1/291.\\nI Dërguari   ka thënë: “Mos i bëni shtëpitë tuaja si varre, me të vërtetë djalli ik nga ajo shtëpi në të cilën lexohet sure Bekare”. Shënon Muslimi 1/539. Pastaj, ajo që e largon shejtanin janë edhe lutjet e mëngjesit dhe të mbrëmjes, para zgjimit, lutjet me rastin e hyrjes dhe daljes nga shtëpia, lutjet e hyrjes dhe daljes nga xhamia, si dhe lutje të tjera të cilat janë të transmetuara, si p.sh. leximi i Ajetul-Kursisë para fjetjes, leximi i dy ajeteve të fundit të sures Bekare, po ashtu, i Dërguari  ka thënë: “Kush në ditë thotë 100 herë: [La ilahe il-la-ll-llahu vahdehu la sherike leh, lehul mulku ve lehul hamdu ve huve ala kul-li shejin kadir]”. “Nuk ka hyjni që meriton të adhurohet pos Allahut, të Vetëm e i pa rival. Atij I takon Sundimi dhe Lavdërimi dhe Ai është i Gjithëfuqishëm mbi çdo gjë.”, do të jetë i mbrojtur prej shejtanit tërë ditën.” Po ashtu, e cekëm se edhe ezani e largon shejtanin."
      }
    ]
  },
  {
    "id": 57,
    "chapter_name": "57.Duaja me rastin e ngushëllimit",
    "invocations": [
      {
        "id": 154,
        "audio": "/audios/057_01.mp3",
        "arabic": "إِنَّ للهِ ما أَخَذ، وَلَهُ ما أَعْـطـى، وَكُـلُّ شَيءٍ عِنْـدَهُ بِأَجَلٍ مُسَـمَّى.فَلْتَصْـبِر وَلْتَحْـتَسِب",
        "latin": "Inne lil-lahi ma ehadhe, ve lehu ma a’ëtá, ve kul-lu shej’in indehu bi exhelin musemma...fel tasbir, vel tahtesib",
        "albanian": "Me të vërtetë e Allahut është ajo që e ka marrë dhe e Atij është ajo që e dha, si dhe çdo send tek Ai është me kohë të caktuar... Pra, të jeni të durueshëm dhe të llogarisni shpërblim nga Allahu.",
        "reference": "Buhariu 2/80, Muslimi 2/636."
      },
      {
        "id": 227,
        "audio": "/audios/.mp3",
        "arabic": "بَارَكَ اللهُ لَكَ فِي الْمَوْهُوبِ لَكَ، وَشَكَرْتَ الْوَاهِبَ، وَبَلَغَ أَشُدَّهُ، وَرُزِقْتَ بِرَّهُ",
        "latin": "BarekAll-llahu leke fil-mevhubi leke, ve shekertel-vahibe, ve belega eshuddehu, ve ruzikte birreh",
        "albanian": "Allahu të bekoftë në atë që të ka dhuruar, e Falënderofsh Dhuruesin, e lus Allahun që të rritet dhe të jetë i sjellshëm.",
        "reference": "“Edhkar” fq.349, Neveviu, “Sahih el-Edhkar lin-Nevevi” 2/713, Selim Hilali."
      },
      {
        "id": 228,
        "audio": "/audios/.mp3",
        "arabic": "Kurse ky ia kthen duke thënë: بَارَكَ اللهُ لَكَ وَبَارَكَ عَلَيْكَ، وَجَزَاكَ اللهُ خَيْراً، وَرَزَقَكَ اللهُ مِثْلَهُ، وَأَجْزَلَ ثَوَابَكَ",
        "latin": "BarekAll-llahu leke ve alejke, ve xhezakAll-llahu hajren, ve rezekakAll-llahu mithlehu ve exhzele thevabehu",
        "albanian": "Edhe ty të bekoftë Allahu, të shpërbleftë me të mira, të dhuroftë edhe ty një fëmijë sikur ky dhe ta shtoftë shpërblimin.",
        "reference": "“Edhkar” fq.349, Neveviu, “Sahih el-Edhkar lin-Nevevi” 2/713, Selim Hilali."
      }
    ]
  },
  {
    "id": 58,
    "chapter_name": "58.Duaja gjatë lëshimit të vdekurit në varr",
    "invocations": [
      {
        "id": 155,
        "audio": "/audios/058_01.mp3",
        "arabic": "بِسْـمِ اللهِ وَعَلـى سُـنَّةِ رَسـولِ الله",
        "latin": "Bismil-lah ve ala Sunneti Resulil-lah",
        "albanian": "Me Emrin e Allahut dhe në bazë të Sunetit të Dërguarit të Allahut.",
        "reference": "Ebu Davudi 3/314 me sened të vërtetë. Po ashtu Ah-medi e shënon versionin tjetër me sened të vërtetë: “Bismil-lah ve Ala mil-leti Resulil-lah” (Me emër të Allahut dhe në fenë e të Dërguarit të Allahut)."
      }
    ]
  },
  {
    "id": 59,
    "chapter_name": "59.Duaja pas varrosjes së të vdekurit",
    "invocations": [
      {
        "id": 156,
        "audio": "/audios/059_01.mp3",
        "arabic": "اللَّهُمَّ اغْفِرْ لَهُ الَّلهُمَّ ثَبِّتْهُ",
        "latin": "All-llahummeg-fir lehu All-llahumme thebbit hu",
        "albanian": "O Allahu im, fale atë, O Allahu im, forcoje atë.",
        "reference": "I Dërguari (a.s) pas përfundimit të varrimit ngrihej në këmbë dhe thoshte: “Kërkoni falje për vëllain tuaj dhe luteni Allahun që ta forcojë atë, sepse tani ai merret në pyetje”, Ebu Davudi 3/315, Hakimi e ka autentifikuar, kurse Dhehebiu e ka pëlqyer 1/370."
      },
      {
        "id": 229,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "I Dërguari (a.s) ka thënë: “Nëse një njeri e viziton vëllain e tij musliman të sëmurë, ecë nëpër rrugën e Xhenetit derisa të ulet, ndërsa kur të ulet do ta përfshijë mëshira e Allahut, nëse e ka vizituar në mëngjes, shtatëdhjetë mijë melaike bëjnë dua për atë person deri në mbrëmje, e nëse e ka vizituar në mbrëmje, shtatëdhjetë mijë melaike bëjnë dua për atë person deri në mëngjes.”",
        "reference": "Tirmidhiu, Ibën Maxheh dhe Ahmedi “Sahih Ibën Maxhe” 1/244 dhe “Sahih et-Tirmidhi” 1/286. Gjithashtu hadithin e ka bërë të vërtetë edhe Ahmed Shakiri."
      }
    ]
  },
  {
    "id": 60,
    "chapter_name": "60.Duaja gjatë vizitës së varrezave",
    "invocations": [
      {
        "id": 157,
        "audio": "/audios/060_01.mp3",
        "arabic": "السَّلامُ عَلَـيْكُمْ أَهْلَ الدِّيارِ مِنَ المؤْمِنيـنَ وَالْمُسْلِمينَ، وَإِنّا إِنْ شاءَ اللهُ بِكُـمْ لاحِقُـونَ،\\n\\n(وَ يَرْحَمُ اللَّهُ الْمُسْتَقْدِمِينَ مِنَّا وَالْمُسْتَأْخِرِينَ) نَسْـاَلُ اللهَ لَنَـا وَلَكُـمْ العَـافِيَةَ ",
        "latin": "Es-selamu alejkum ehled-dijari minel-mu’minine vel-muslimin, ve inna inshaAll-llahu bikum lahikun, [ve jerhamull-llahul-mustakdimine minna vel-muste’hirin] Es’elull-llahe lena ve lekumul-áfijeh",
        "albanian": "Shpëtimi qoftë mbi ju banorë të varrezave besimtarë dhe muslimanë, edhe ne, në dashtë Allahu, do t’ju bashkangjitemi, [Allahu i mëshiroftë ata që kanë kaluar prej nesh edhe ata që do të vijnë pas nesh]; e lus Allahun që të na shpëtojë ne dhe ju.",
        "reference": "Muslimi 2/671 dhe Ibën Maxheh 1/494, versioni i Bu-rejdes (r.a) , ndërsa në kllapa shënohet shtesa e Muslimit nga hadithi i Aishes (r.a) , 2/671."
      }
    ]
  },
  {
    "id": 61,
    "chapter_name": "61.Duaja kur frynë era",
    "invocations": [
      {
        "id": 158,
        "audio": "/audios/061_01.mp3",
        "arabic": "اللّهُـمَّ  إِنَّـي أَسْـأَلُـكَ خَيْـرَها، وَأَعـوذُ بِكَ مِنْ شَـرِّها",
        "latin": "All-llahumme inni es’eluke hajreha ve eudhu bike min sherriha",
        "albanian": "O Allahu im, kërkoj nga Ti të mirën e saj dhe kërkoj që të më mbrosh nga e keqja e saj.",
        "reference": "Ebu Davudi 4/326 dhe Ibën Maxheh 2/1228 “Sahih Ibën Maxheh” 2/305."
      },
      {
        "id": 159,
        "audio": "/audios/061_02.mp3",
        "arabic": "اللّهُـمَّ  إِنَّـي أَسْـأَلُـكَ خَيْـرَها، وَخَيْـرَ ما فيهـا، وَخَيْـرَ ما اُرْسِلَـتْ بِه، وَأَعـوذُ بِكَ مِنْ شَـرِّها، وَشَـرِّ ما فيهـا، وَشَـرِّ ما\\n\\nاُرْسِلَـتْ بِه",
        "latin": "All-llahumme inni es’eluke hajreha ve hajre ma fiha, ve hajre ma ursilet bihi, ve eudhu bike min sherriha ve sherri ma fiha, ve sherri ma ursilet bihi",
        "albanian": "O Allahu im, kërkoj nga Ti të mirën e saj, të mirën që ka në të, të mirën që është dërguar me të; më mbroj prej të keqes së saj, të keqes që ka në të dhe prej të keqes që është dërguar me të.",
        "reference": "Muslimi 2/616, Buhariu 4/76."
      }
    ]
  },
  {
    "id": 62,
    "chapter_name": "62.Duaja kur të murmuron",
    "invocations": [
      {
        "id": 160,
        "audio": "/audios/062_01.mp3",
        "arabic": "سُبْـحانَ الّذي يُسَبِّـحُ الـرَّعْدُ بِحَمْـدِهِ، وَالملائِكـةُ مِنْ خيـفَته",
        "latin": "Subhanel-ledhi jusebbihur-ra’du bi hamdihi vel melaiketu min hifetihi",
        "albanian": "I Lartmadhëruar qoftë Allahu, të Cilin e madhëron murmurima me Falënderimin e Tij, e edhe melaiket e madhërojnë, prej frikës ndaj Tij.",
        "reference": "Shënohet se Abdullah Ibën Zubejri   kur e dëgjonte murmurimën e ndërpriste bisedën dhe thoshte... (ha-dithin), Maliku në “Muveta” 2/992, Albani thotë se senedi është i vërtetë (mevkuf)."
      }
    ]
  },
  {
    "id": 63,
    "chapter_name": "63.Duatë e shiut",
    "invocations": [
      {
        "id": 161,
        "audio": "/audios/063_01.mp3",
        "arabic": "اللّهُمَّ اَسْقِـنا غَيْـثاً مُغيـثاً مَريئاً مُريـعاً، نافِعـاً غَيْـرَ ضَّارٌ، عاجِـلاً غَـيْرَ آجِلٍ",
        "latin": "All-llahumme eskina gajthen mugithen meri’en meri’an nafi’an gajre darrin axhilen gajre axhilin",
        "albanian": "O Allahu im, të lutem na lësho shi të këndshëm, freskues, të dobishëm e jo të dëmshëm, të menjëhershëm e jo të vonuar.",
        "reference": "Ebu Davudi 1/303, të cilën Albani e ka bërë të vërtetë në librin “Sahih Ebu Davud” 1/216."
      },
      {
        "id": 162,
        "audio": "/audios/063_02.mp3",
        "arabic": "اللّهُمَّ أغِثْنـَا، اللّهُمَّ أغِثْنـَا، اللّهُمَّ أغِثْنـَا ",
        "latin": "All-llahumme egithna, Allahumme egithna, Allahumme egithna",
        "albanian": "O Allahu im na lësho shi, O Allahu im na lësho shi, O Allahu im na lësho shi.",
        "reference": "Buhariu 1/224, Muslimi 2/613."
      },
      {
        "id": 163,
        "audio": "/audios/063_03.mp3",
        "arabic": "اللّهُمَّ اسْقِ عِبادَكَ وَبَهـائِمَك، وَانْشُـرْ رَحْمَـتَكَ وَأَحْيِي بَلَـدَكَ المَيِّـت",
        "latin": "All-llahumme iski ibádek, ve behaimek ven-shur rahmetek, ve Ahji beledekel-mejjit",
        "albanian": "O Allahu im, begatoji me ujë robërit e Tu dhe gjallesat Tua, shpërndaje mëshirën Tënde dhe gjallëroje këtë vendin Tënd të vdekur.",
        "reference": "Ebu Davudi 1/305, Albani e ka bërë këtë hadith të mirë (hasen). Shih “Sahih Ebu Davud” 1/218."
      }
    ]
  },
  {
    "id": 64,
    "chapter_name": "64.Duaja kur bie shi",
    "invocations": [
      {
        "id": 164,
        "audio": "/audios/064_01.mp3",
        "arabic": "اللّهُمَّ صَيِّـباً نافِـعاً",
        "latin": "All-llahumme sajjiben nafi’an",
        "albanian": "O Allahu im bëje këtë shi të begatshëm, e të dobishëm.",
        "reference": "Buhariu “Fet’hul-Bari” 2/518."
      }
    ]
  },
  {
    "id": 65,
    "chapter_name": "65.Duaja pasi të bie shiu",
    "invocations": [
      {
        "id": 165,
        "audio": "/audios/065_01.mp3",
        "arabic": "مُطِـرْنا بِفَضْـلِ اللهِ وَرَحْمَـتِه",
        "latin": "Mutirna bi fadlil-lahi ve rahmetihi",
        "albanian": "U furnizuam me shi, me mirësinë e Allahut dhe mëshirën e Tij.",
        "reference": "Buhariu 1/205, Muslimi 1/83."
      },
      {
        "id": 230,
        "audio": "/audios/.mp3",
        "arabic": "Mirë është të thotë edhe:\\nاَللَّهُمَّ اجْعَلْهُ فَرَطاً وَذُخْراً لِوَالِدَيْهِ، وَشَفِيعاً مُجَاباً، اَللَّهُمَّ ثَقِّلْ بِهِ مَوَازِينَهُمَا، وَأَعْظِمْ بِهِ أُجورَهُمَا، وَأَلْحِقْهُ بِصَالِحِ الْمُؤْمِنِينَ، وَاجْعَلْهُ فِي كَفَالَةِ إِبْرَاهِيمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الْجَحِيمِ، وَأَبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، اَللَّهُمَّ اغْفِرْ لِأَسْلاَفِنَا، وَأَفْرَاطِنَا، وَمَنْ سَبَقَنَا بِالْإِيمَانِ\\n",
        "latin": "All-llahummexh-alhu feretan ve dhuhren li validejhi, ve shefi’an muxhaben. All-llahumme thekkil bihi mevazinehuma, ve e’ëdhim bihi uxhurehuma, ve elhikhu bi salihil-mu’minín, vexh’alhu fi kefaleti Ibrahim, vekihi bi rahmetike adhabel-xhehim, ve ebdilhu daren hajren min darihi, ve ehlen hajren min ehlihi, All-llahumme-gfir li eslafina, ve efratina, ve men sebekana bil-íman",
        "albanian": "O Allahu im, bëje këtë fëmijë prijës dhe shpërblim për prindërit e tij, si dhe bëje prej atyre të cilëve u pranohet ndërmjetësimi. O Allahu im, rëndoje peshojën e tyre me të dhe shtojua shpërblimet e tyre dhe bashkoje këtë fëmijë me besimtarët e mirë. Bëje që të jetë nën kujdesin e Ibrahimit, mbroje atë me mëshirën Tënde prej dënimit të zjarrit, zëvendësoja shtëpinë me një shtëpi më të mirë dhe familjen me një familje më të mirë. O Allahu im, fali të parët dhe prijësit tanë dhe të gjithë ata të cilët kanë kaluar para nesh me besim.",
        "reference": "“Mugni” Ibën Kudame 3/416, “Mësime të rëndësishme për Umetin në përgjithësi” të Ibën Bazit fq.15."
      }
    ]
  },
  {
    "id": 66,
    "chapter_name": "66.Duaja kundër vërshimit",
    "invocations": [
      {
        "id": 166,
        "audio": "/audios/066_01.mp3",
        "arabic": "اللّهُمَّ حَوالَيْنا وَلا عَلَيْـنا، اللّهُمَّ عَلى الآكـامِ وَالظِّـراب، وَبُطـونِ الأوْدِية، وَمَنـابِتِ الشَّجـر ",
        "latin": "All-llahumme havalejna la alejna. All-llahumme alel-ákami vedh-dhirabi, ve butunil-evdijeti, ve menabitish-shexheri",
        "albanian": "O Allahu im, rreth nesh e jo mbi ne. O Allahu im, ktheje kodrave dhe kodrinave, pyjeve dhe luginave.",
        "reference": "Buhariu 1/244, Muslimi 2/614."
      },
      {
        "id": 231,
        "audio": "/audios/.mp3",
        "arabic": "Gjithashtu mund të thuhet:\\nأَعْظَمَ اللهُ أَجْرَكَ، وَأَحْسَنَ عَزَاءَكَ، وَغَفَرَ لِمَيِّتِكَ\\n",
        "latin": "A’ëdhemAll-llahu exhrek, ve Ahsene azaek ve gafere limejjitik",
        "albanian": "Allahu ta zmadhoftë shpërblimin dhe ta shtoftë durimin dhe e faltë këtë të vdekur.",
        "reference": "Shënon Imam Neveviu në librin “Edhkar” fq.126."
      }
    ]
  },
  {
    "id": 67,
    "chapter_name": "67.Duaja kur të shihet hëna e re",
    "invocations": [
      {
        "id": 167,
        "audio": "/audios/067_01.mp3",
        "arabic": "اللهُ أَكْـبَر، اللّهُمَّ أَهِلَّـهُ عَلَيْـنا بِالأمْـنِ وَالإيمـان، والسَّلامَـةِ والإسْلامِ، وَالتَّـوْفيـقِ لِما تُحِـبُّ وَتَـرْضَـى، رَبُّنـا وَرَبُّكَ اللهُ  ",
        "latin": "All-llahu Ekber, All-llahumme ehil-lehu alejna bil-emni vel-imani, ves-selameti vel-Islami, vet-tevfiki lima tuhibbu Rabbena ve terda, Rabbuna ve Rabbuke All-llah",
        "albanian": "Allahu është më i Madhi. O Allahu im, na mundëso që këtë hënë të re, ta presim në qetësi dhe besim, me shpëtim dhe me nënshtrim, me suksese në atë që Ti, o Zoti ynë, dëshiron dhe je i kënaqur me të; oj Hënë, Zoti ynë dhe i yti është Allahu.",
        "reference": "Tirmidhiu 5/504 dhe Ed-Daremiu 1/336, “Sahih et-Tirmidhi” 3/157."
      }
    ]
  },
  {
    "id": 68,
    "chapter_name": "68.Duaja e agjëruesit kur të bëjë iftar",
    "invocations": [
      {
        "id": 168,
        "audio": "/audios/068_01.mp3",
        "arabic": "ذَهَـبَ الظَّمَـأُ، وَابْتَلَّـتِ العُـروق، وَثَبَـتَ الأجْـرُ إِنْ شـاءَ الله",
        "latin": "Dhehebe edh-dhameu, veb-tel-letil-uruku ve thebetel-exhru inshaAll-llah",
        "albanian": "Kaloi etja, u lagën venat dhe u realizua shpërblimi inshAllah.",
        "reference": "Ebu Davudi 2/306 dhe të tjerë. “Sahih el-Xhamiu” 4/209."
      },
      {
        "id": 169,
        "audio": "/audios/068_02.mp3",
        "arabic": "اللّهُـمَّ  إِنَّـي أَسْـأَلُـكَ بِرَحْمَـتِكَ الّتي وَسِـعَت كُلَّ شيء، أَنْ تَغْـفِرَ لِي",
        "latin": "All-llahumme inni es’eluke bi rahmetikel-leti vesi’at kul-le shej’in en tagfire li",
        "albanian": "O Allahu im, të lutem me mëshirën Tënde, e cila ka përfshirë çdo gjë, të m’i falësh mëkatet.",
        "reference": "Ibën Maxheh 1/557, prej lutjeve të Abdullah ibën Ameit, Hafidh ibën Haxheri e ka bërë të mirë “Sherh e-Edhkar” 4/342."
      }
    ]
  },
  {
    "id": 69,
    "chapter_name": "69.Duaja para ushqimit",
    "invocations": [
      {
        "id": 170,
        "audio": "/audios/069_01.mp3",
        "arabic": "Nëse ndokush prej jush fillon të hajë ushqim, le të thotë:\\nبِسْمِ اللهِ\\n",
        "latin": "Bismil-lah",
        "albanian": "Me emër të Allahut.",
        "reference": "Shënon Ebu Davudi 3/347, Tirmidhiu 4/288, “Sahih et-Tirmidhi” 2/167."
      },
      {
        "id": 171,
        "audio": "/audios/069_03.mp3",
        "arabic": "Atij të cilit Allahu i Madhërishëm ia mundëson të ushqehet, le të thotë:\\nاَللَّهُمَّ بَارِكْ لَنَا فِيهِ وَأَطْعِمْنَا خَيْراً مِنْهُ \\n",
        "latin": "All-llahumme barik lena fihi ve et’imna hajren minhu",
        "albanian": "O Allahu im, na beko në këtë ushqim dhe na furnizo me ushqim më të mirë se ky.",
        "reference": "Shënon Tirmidhiu 5/506, “Sahih et-Tirmidhi” 3/158."
      },
      {
        "id": 172,
        "audio": "/audios/069_04.mp3",
        "arabic": "E atij që Allahu ia mundëson që të pijë qumësht, le të thotë:\\nاَللَّهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ\\n",
        "latin": "All-llahumme barik lena fihi ve zidna minhu",
        "albanian": "O Allahu im, na beko në këtë dhe na shto nga ky.",
        "reference": "Shënon Tirmidhiu 5/506, “Sahih et-Tirmidhi” 3/158."
      },
      {
        "id": 232,
        "audio": "/audios/069_02.mp3",
        "arabic": "E nëse harron në fillim të ushqimit, atëherë le të thotë:\\nبسمِ اللهِ فِي أَوَّلِهِ وَآخِرِهِ",
        "latin": "Bismil-lahi fi evvelihi ve Ahirihi",
        "albanian": "Me emrin e Allahut në fillim dhe në mbarim.",
        "reference": "Shënon Ebu Davudi 3/347, Tirmidhiu 4/288, “Sahih et-Tirmidhi” 2/167."
      }
    ]
  },
  {
    "id": 70,
    "chapter_name": "70.Duaja pas ushqimit",
    "invocations": [
      {
        "id": 173,
        "audio": "/audios/070_01.mp3",
        "arabic": "الْحَمْـدُ للهِ الَّذي أَطْعَمَنـي هـذا وَرَزَقَنـيهِ مِنْ غَـيْرِ حَوْلٍ مِنِّي وَلا قُوَّة",
        "latin": "Elhamdulil-lahil-ledhi et’ameni hadha, ve rezekanihi min gajri havlin minni ve la kuvvetin",
        "albanian": "Falënderimi i takon Allahut i cili ma mundësoi ta ha këtë ushqim dhe më furnizoi pa mundin dhe fuqinë time.",
        "reference": "Ebu Davudi, Tirmidhiu dhe Ibën Maxheh, “Sahih et-Tirmidhi” 3/159."
      },
      {
        "id": 174,
        "audio": "/audios/070_02.mp3",
        "arabic": "الْحَمْـدُ للهِ حَمْـداً كَثـيراً طَيِّـباً مُبـارَكاً فيه، [غَيْرَ مَكْفِيٍّ] وَلا مُوَدَّعٍ وَلا مُسْتَغْـنىً عَنْـهُ رَبُّـنا ",
        "latin": "Elhamdulil-lahi hamden kethiren tajjiben mubareken fihi, gajre [mekfijjin ve la] muvedde’in, ve la mustagnen anhu Rabbena",
        "albanian": "E Falënderojmë Allahun me Falënderime të shumta, të mira dhe të bekuara [të cilat janë të pamjaftueshme], Falënderime të pandërprera, për të cilat kemi nevojë, o Zoti ynë.",
        "reference": "Buhariu 6/214 dhe Tirmidhiu 5/507."
      }
    ]
  },
  {
    "id": 71,
    "chapter_name": "71.Duaja e mysafirit për nikoqirin",
    "invocations": [
      {
        "id": 175,
        "audio": "/audios/071_01.mp3",
        "arabic": "اللّهُـمَّ بارِكْ لَهُمْ فيما رَزَقْـتَهُم، وَاغْفِـرْ لَهُـمْ وَارْحَمْهُمْ",
        "latin": "All-llahumme barik lehum fi ma rezaktehum vagfir lehum verhamhum",
        "albanian": "O Allahu im bekoji në atë që i ke furnizuar, falu mëkatet dhe mëshiroji ata.",
        "reference": "Muslimi 3/1615."
      }
    ]
  },
  {
    "id": 72,
    "chapter_name": "72.Duaja për atë që të jep ushqim apo ujë",
    "invocations": [
      {
        "id": 176,
        "audio": "/audios/072_01.mp3",
        "arabic": "اللّهُـمَّ أَطْعِمْ مَن أَطْعَمَني، وَاسْقِ مَن سَقَانِي",
        "latin": "All-llahumme et’im men et’ameni ve-ski men sekani",
        "albanian": "O Allahu im, ushqeje atë që më ushqeu mua dhe jepi të pijë atij që më dha të pi mua.",
        "reference": "Muslimi 3/126."
      }
    ]
  },
  {
    "id": 73,
    "chapter_name": "73.Duaja kur të bësh iftar tek ndonjë familje",
    "invocations": [
      {
        "id": 177,
        "audio": "/audios/073_01.mp3",
        "arabic": "أَفْطَـرَ عِنْدَكُم الصّـائِمونَ وَأَكَلَ طَعامَـكُمُ الأبْـرار، وَصَلَّـتْ عَلَـيْكُمُ الملائِكَـة",
        "latin": "Eftare indekumus-saimun, ve ekele ta’amukumul-ebrar, ve sal-let alejkumul-melaike",
        "albanian": "Bëfshin iftar tek ju agjëruesit, ushqimin tuaj e ngrënshin njerëzit e mirë dhe për ju bëfshin lutje melaiket.",
        "reference": "Ebu Davudi 3/367, Ibën Maxheh 1/556 dhe Nesaiu në “Amel el-Jevmi ve Lejleh” #296-298, i cili thotë se i Dërguari i Allahut   e ka thënë këtë kur ka ngrënë iftar te ndonjë familje. Këtë hadith e ka bërë të vërtetë Albani në “Sahih Ebu Davud” 2/730."
      }
    ]
  },
  {
    "id": 74,
    "chapter_name": "74.Duaja e agjëruesit kur prezenton në ushqim dhe nuk ha",
    "invocations": [
      {
        "id": 270,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "I Dërguari i Allahut (a.s) ka thënë: “Kur të ftohet ndokush prej jush le t’i përgjigjet ftesës. Nëse është agjërues, le të lutet për atë person, e nëse nuk është agjërues, le të hajë.” ",
        "reference": "Muslimi 2/1054."
      }
    ]
  },
  {
    "id": 75,
    "chapter_name": "75.Çfarë duhet të thotë agjëruesi kur ta ofendojë ndokush",
    "invocations": [
      {
        "id": 178,
        "audio": "/audios/.mp3",
        "arabic": "إنِّي صَائِمٌ,  إنِّي صَائِمٌ",
        "latin": "Inni Saim, Inni Saim",
        "albanian": "Unë jam agjërues, unë jam agjërues.",
        "reference": "Buhariu me “Fet’h” 4/103, Muslimi 2/806."
      }
    ]
  },
  {
    "id": 76,
    "chapter_name": "76.Duaja kur të shohim pemën e posapjekur",
    "invocations": [
      {
        "id": 179,
        "audio": "/audios/076_01.mp3",
        "arabic": "اللّهُـمَّ بارِكْ لَنا في ثَمَـرِنا، وَبارِكْ لَنا في مَدينَتِنـا، وَبارِكْ لَنا في صَاعِنـَا، وَبارِكْ لَنا فِي مُدِّنا",
        "latin": "All-llahumme barik lena fi themerina, ve barik lena fi medinetina, ve barik lena fi si’ina, ve barik lena fi muddina",
        "albanian": "O Allahu im, na i beko frytet tona, na e beko qytetin tonë, na i beko njësitë matëse tona (sain dhe muddin) me të cilat matim.",
        "reference": "Muslimi 2/1000."
      }
    ]
  },
  {
    "id": 77,
    "chapter_name": "77.Duaja e teshtitjes",
    "invocations": [
      {
        "id": 180,
        "audio": "/audios/077_01.mp3",
        "arabic": "Nëse ndonjëri prej jush teshtitë le të thotë:\\nاَلْحَمْدُ لِلهِ\\nKurse vëllai i tij apo shoqëruesi le t’i thotë:\\nيَرْحَمُكَ اللهُ\\nE nëse i thotë: JerhamukAll-llah (Allahu të mëshiroftë), ky le t’ia kthejë:\\nيَهْدِيكُمُ اللهُ وَيُصْلِحُ بَالَكُمْ\\n",
        "latin": "Elhamdulil-lah\\nJerhamukAll-llah\\nJehdikumull-llahu ve juslih balekum",
        "albanian": "Falënderimi i qoftë Allahut.\\nAllahu të Mëshiroftë.\\nAllahu ju udhëzoftë dhe ua përmirësoftë gjendjen tuaj.",
        "reference": "Buhariu 7/125."
      }
    ]
  },
  {
    "id": 78,
    "chapter_name": "78.Çfarë u duhet thënë jobesimtarëve kur të teshtisin",
    "invocations": [
      {
        "id": 181,
        "audio": "/audios/078_01.mp3",
        "arabic": "يَهْـديكُـمُ اللهُ وَيُصْـلِحُ بالَـكُم",
        "latin": "Jehdikumull-llahu ve juslih balekum",
        "albanian": "Allahu ju udhëzoftë dhe ua përmirësoftë gjendjen tuaj.",
        "reference": "Tirmidhiu 5/82, Ahmedi 4/400, Ebu Davud 4/308, “Sahih et-Tirmidhi” 2/354."
      }
    ]
  },
  {
    "id": 79,
    "chapter_name": "79.Duaja për të porsamartuarit",
    "invocations": [
      {
        "id": 182,
        "audio": "/audios/079_01.mp3",
        "arabic": "بارَكَ اللّهُ لَك، وَبارَكَ عَلَـيْك، وَجَمَعَ بَيْـنَكُما في خَـيْر",
        "latin": "BarekAll-llahu leke, ve bareke alejke, ve xheme’a bejnekuma, fi hajrin",
        "albanian": "Allahu të bekoftë ty dhe pasardhësit e tu, si dhe ju bashkoftë ju të dy në të mirë.",
        "reference": "Transmetojnë autorët e katër suneneve përveç Nesaiut “Sahih et-Tirmidhi” 1/316."
      }
    ]
  },
  {
    "id": 80,
    "chapter_name": "80.Duaja gjatë martesës dhe blerjes së kafshës",
    "invocations": [
      {
        "id": 183,
        "audio": "/audios/.mp3",
        "arabic": "Transmetohet se i Dërguari i Allahut (a.s) ka thënë: “Kur dikush prej juve martohet ose blenë ndonjë robëreshë, le të thotë:\\nاَللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ\\n",
        "latin": "All-llahumme inni es’eluke hajreha ve hajre ma xhebelteha alejhi, ve eudhu bike min sherriha ve sherri ma xhebelteha alejhi",
        "albanian": "“O Allahu im, kërkoj prej Teje të më dhurosh të mirën e saj dhe të mirën që e ke bërë natyrë të saj, si dhe të lutem të më mbrosh nga e keqja e saj dhe e keqja që e ke bërë natyrë të saj.”\\n\\n\\n",
        "reference": "Po ashtu, nëse dikush blen ndonjë kafshë le ta merr për gungën më të lartë dhe le ta thotë këtë dua.\\nEbu Davudi 2/248, Ibën Maxheh 1/617, “Sahih Ibën Maxheh” 1/324."
      }
    ]
  },
  {
    "id": 81,
    "chapter_name": "81.Duaja para se t’i afrohesh bashkëshortes",
    "invocations": [
      {
        "id": 184,
        "audio": "/audios/081_01.mp3",
        "arabic": "بِسْمِ الله اللّهُـمَّ جَنِّبْنا الشَّيْـطانَ، وَجَنِّبِ الشَّـيْطانَ ما رَزَقْـتَنا",
        "latin": "Bismil-lah, All-llahumme xhennibnesh-shejtane, ve xhennibish-shejtane ma rezaktena",
        "albanian": "Me emrin e Allahut, O Allahu im, na e largo djallin prej neve dhe prej asaj që do të na furnizosh me të.",
        "reference": "Buhariu 6/141 Muslimi 2/1028."
      }
    ]
  },
  {
    "id": 82,
    "chapter_name": "82.Duaja e hidhërimit",
    "invocations": [
      {
        "id": 185,
        "audio": "/audios/082_01.mp3",
        "arabic": "أَعـوذُ بِاللهِ مِنَ الشَّيْـطانِ الرَّجيـم",
        "latin": "Eudhu bil-lahi minesh-shejtanir-raxhim",
        "albanian": "Kërkoj mbrojtjen e Allahut prej djallit të mallkuar.",
        "reference": "Buhariu 7/99 dhe Muslimi 4/2015."
      },
      {
        "id": 233,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "I Dërguari i Allahut (a.s) ka thënë: “Kur të ftohet ndokush prej jush le t’i përgjigjet ftesës. Nëse është agjërues, le të lutet për atë person, e nëse nuk është agjërues, le të hajë.”",
        "reference": "Muslimi 2/1054."
      }
    ]
  },
  {
    "id": 83,
    "chapter_name": "83.Duaja kur të shohim ndokënd me të meta",
    "invocations": [
      {
        "id": 186,
        "audio": "/audios/083_01.mp3",
        "arabic": "الْحَمْـدُ للهِ الّذي عافاني مِمّا ابْتَـلاكَ بِهِ، وَفَضَّلَـني عَلى كَثيـرٍ مِمَّنْ خَلَـقَ تَفْضـيلا",
        "latin": "Elhamdulil-lahil-ledhi afani mimmabtelake bihi ve feddaleni ala kethirin mimmen haleka tefdila",
        "albanian": "Falënderimi i qoftë Allahut i cili më ka mbrojtur nga kjo me të cilën të ka sprovuar ty dhe më ka begatuar nga shumë krijesat e Tij.",
        "reference": "Tirmidhiu 5/493, 5/494, “Sahih et-Tirmidhi” 3/153”."
      }
    ]
  },
  {
    "id": 84,
    "chapter_name": "84.Çfarë duhet thënë në tubim",
    "invocations": [
      {
        "id": 187,
        "audio": "/audios/084_01.mp3",
        "arabic": "Shënohet nga Ibën Omeri (r.a) i cili thotë: “I Dërguari (a.s), para se të ngrihej nga një tubim numëronte duke thënë 100 herë:\\nرَبِّ اغْفِرْ لِي، وَتُبْ عَلَيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الغَفُورُ\\n",
        "latin": "Rabbi-gfir li ve tub alejje, inneke Ente et-Tevvabul-Gafur",
        "albanian": "O Zoti im, më fal dhe ma prano pendimin, sepse Ti je Pranues i faljes dhe i pendimit.",
        "reference": "Tirmidhiu dhe të tjerë, “Sahih et-Tirmidhi” 3/153 dhe “Sahih Ibën Maxheh” 2/321."
      }
    ]
  },
  {
    "id": 85,
    "chapter_name": "85.Duaja kur të përfundoj tubimi",
    "invocations": [
      {
        "id": 188,
        "audio": "/audios/085_01.mp3",
        "arabic": "سُبْحـانَكَ اللّهُـمَّ وَبِحَمدِك، أَشْهَـدُ أَنْ لا إِلهَ إِلاّ أَنْتَ أَسْتَغْفِرُكَ وَأَتوبُ إِلَـيْك",
        "latin": "Subhaneke All-llahumme ve biham-dike, Eshhedu en la Ilahe il-la Ente estagfiruke ve etubu ilejke",
        "albanian": "I Lartësuar qofsh, o Allahu im, Ty të takon Falënderimi; dëshmoj se nuk ka të adhuruar tjetër përveç Teje; kërkoj faljen Tënde dhe tek Ti pendohem.",
        "reference": "Autorët e katër Suneneve, “Sahih et-Tirmidhi” 3/153, është vërtetuar nga Aishja   e cila ka thënë: “S’është ulur i Dërguari i Allahut   në asnjë tubim apo s’ka lexuar Kuran apo s’ka falur namaz pa e përfunduar me këto fjalë...” (Hadithi). Nesaiu në “Amel el-Jevmi ve Lejleh” #308 dhe Ahmedi 6/77, sahih sipas dr. Faruk Hamadeh në recensimin e “Amel el-Jevmi ve Lejleh” të Nesaiut fq.273."
      }
    ]
  },
  {
    "id": 86,
    "chapter_name": "86.Duaja për atë i cili të thotë",
    "invocations": [
      {
        "id": 189,
        "audio": "/audios/.mp3",
        "arabic": "Duaja për atë i cili të thotë: \\n غَفَــرَ اللهُ لَكَ\\nGaferAll-llahu leke\\n“Allahu t’i faltë mëkatet.”\\n\\nوَلَكَ\\n",
        "latin": "Ve Leke",
        "albanian": "Edhe ty.",
        "reference": "Shënojnë Ahmedi 5/82 dhe Nesaiu në “Amel el-Jevmi ve Lejleh” fq.218, nr. 421 me recensimin e dr. Faruk Hamades."
      }
    ]
  },
  {
    "id": 87,
    "chapter_name": "87.Duaja për atë i cili ta bën ndonjë të mirë",
    "invocations": [
      {
        "id": 190,
        "audio": "/audios/087_01.mp3",
        "arabic": "جَزاكَ اللهُ خَـيْراً",
        "latin": "XhezakAll-llahu hajren",
        "albanian": "Allahu të shpërbleftë me të mira.",
        "reference": "Tirmidhiu nr. 2035, “Sahih el-Xhamiu” #6244 dhe “Sahih et-Tirmidhi” 2/200."
      }
    ]
  },
  {
    "id": 88,
    "chapter_name": "88.Dhikri me të cilin allahu të mbron prej dexhallit",
    "invocations": [
      {
        "id": 271,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "Thotë i Dërguari (a.s) : “Kush i mëson përmendësh dhjetë ajetet e para të sures “Kehf”, është i mbrojtur prej dexhallit.” \\nSi dhe të kërkuarit mbrojtje nga Allahu i Madhëruar nga sprova e dexhallit pas teshehudit të fundit në çdo namaz. \\n",
        "reference": "Shënon Muslimi 1/555 dhe në transmetimin tjetër: “Dhjetë Ajetet e fundit të sures Kehf”, 1/556.\\nShih hadithet nën fusnotën: 75 dhe 76.\\n"
      }
    ]
  },
  {
    "id": 89,
    "chapter_name": "89.Duaja për atë i cili të thotë",
    "invocations": [
      {
        "id": 191,
        "audio": "/audios/089_01.mp3",
        "arabic": "Duaja për atë i cili të thotë\\nإِنِّي أُحِبُّكَ فِي اللهِ\\nInni uhibbuke fil-lah\\n“Unë të dua për hir të Allahut.”\\n\\nأَحَبَّكَ الَّذِي أَحْبَبْتَنِي لَهُ\\n\\n",
        "latin": "Ehabbekel-ledhi ahbebteni leh",
        "albanian": "Të dashtë Ai për të cilin më deshe.",
        "reference": "Ebu Davudi 4/333, i mirë (hasen) sipas shejh Albanit, shih “Sahih Sunen Ebi Davud” 3/965."
      }
    ]
  },
  {
    "id": 90,
    "chapter_name": "90.Duaja për atë i cili të ofron pasuri",
    "invocations": [
      {
        "id": 192,
        "audio": "/audios/090_01.mp3",
        "arabic": "بارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِك",
        "latin": "BarekAll-llahu leke fi Ehlike ve malike",
        "albanian": "Të bekoftë Allahu në familjen dhe pasurinë Tënde.",
        "reference": "Buhariu me “Fet’h” 4/88."
      }
    ]
  },
  {
    "id": 91,
    "chapter_name": "91.Duaja e atij i cili të ka borxh kur ta kthen atë",
    "invocations": [
      {
        "id": 193,
        "audio": "/audios/091_01.mp3",
        "arabic": "بارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِك، إِنَّما جَـزاءُ السَّلَفِ الْحَمْدُ والأَدَاء",
        "latin": "BarekAll-llahu leke fi Ehlike ve malike, inn-ema xhezaus-selefi el hamdu vel-edau",
        "albanian": "Të bekoftë Allahu në familjen dhe pasurinë Tënde, vërtetë shpërblimi i borxhit është falënderimi dhe kthimi.",
        "reference": "Nesaiu në “Amel el-Jevmi ve Lejleh” fq. 300 dhe Ibën Maxheh 2/809, “Sahih Ibën Maxheh” 2/55"
      }
    ]
  },
  {
    "id": 92,
    "chapter_name": "92.Duaja e frikës nga shirku",
    "invocations": [
      {
        "id": 194,
        "audio": "/audios/092_01.mp3",
        "arabic": "اللّهُـمَّ  إِنّـي أَعـوذُبِكَ أَنْ أُشْـرِكَ بِكَ وَأَنا أَعْـلَمْ، وَأَسْتَـغْفِرُكَ لِما لا أَعْـلَم",
        "latin": "All-llahumme inni eudhu bike en ushrike bike ve ene a’ëlemu ve estagfiruke lima la a’ëlemu",
        "albanian": "O Allahu im, kërkoj mbrojtjen Tënde nga shirku të cilin e di dhe kërkoj faljen Tënde për atë që nuk e di.",
        "reference": "Ahmedi 4/403 dhe të tjerë, “Sahih el-Xhamiu” 3/233 dhe “Sahih et-Tergib vet-Terhib” të autorit Albani 1/19."
      }
    ]
  },
  {
    "id": 93,
    "chapter_name": "93.Duaja për atë i cili të thotë",
    "invocations": [
      {
        "id": 195,
        "audio": "/audios/.mp3",
        "arabic": "Duaja për atë i cili të thotë\\nبَارَكَ اللهُ فِيكَ\\nBarekAll-llahu fike\\n“Allahu të bekoftë.”\\n\\nوَفِيكَ بَارَكَ اللهُ\\n",
        "latin": "Ve fike barekAll-llahu",
        "albanian": "Edhe ty të bekoftë Allahu.",
        "reference": "Ibën Sunnij fq. 138, nr. 278 “Vabil es-Sajjib” të Ibën Kajjimit fq. 304, me recensimin e Beshir Muhamed Nuajm."
      }
    ]
  },
  {
    "id": 94,
    "chapter_name": "94.Duaja e urrejtjes së parashikimit të keq",
    "invocations": [
      {
        "id": 196,
        "audio": "/audios/094_01.mp3",
        "arabic": "اللّهُـمَّ لا طَيْـرَ إِلاّ طَيْـرُك، وَلا خَـيْرَ إِلاّ خَـيْرُك، وَلا إِلهَ غَيْـرُك",
        "latin": "All-llahumme la tajre il-la tajruke ve la hajre il-la hajruke, ve la ilahe gajruke",
        "albanian": "O Allahu im, nuk ka tajre  përveç tajres Tënde, nuk ka të mirë përveç të mirës Tënde dhe nuk ka të adhuruar tjetër përveç Teje.",
        "reference": "Mbështetje në ogure, në parashenja të këqija ose të mira. \\nAhmedi 2/220 dhe Ibën Sunnij nr. 292, i vërtetë sipas Albanit, shih “Silsileh Ehadith es-Sahiha” 3/54, nr. 1065, kurse sa i përket parashikimit të së mirës (që ara-bët e përdorin termin fe’lun sh.p.) kjo fjalë i pëlqente të të Dërguarit dhe kur e dëgjoi një fjalë të mirë prej një personi dhe i pëlqeu i tha: “E morëm fjalën tënde të mirë (fe’lin), nga goja jote”. Ebu Davudi dhe Ahmedi. sahih sipas shejh Albanit, shih “Silsileh Ehadith Es-Sahiha” 2/363.\\n"
      }
    ]
  },
  {
    "id": 95,
    "chapter_name": "95.Duaja gjatë hipjes në mjetin e udhëtimit",
    "invocations": [
      {
        "id": 197,
        "audio": "/audios/095_01.mp3",
        "arabic": "بِسْـمِ اللهِ وَالْحَمْـدُ لله، سُـبْحانَ الّذي سَخَّـرَ لَنا هذا وَما كُنّا لَهُ مُقْـرِنين، وَإِنّا إِلى رَبِّنا لَمُنـقَلِبون، الحَمْـدُ لله، الحَمْـدُ لله،\\n\\n الحَمْـدُ لله، اللهُ أكْـبَر، اللهُ أكْـبَر، اللهُ أكْـبَر، سُـبْحانَكَ اللّهُـمَّ  إِنّي ظَلَـمْتُ نَفْسي فَاغْـفِرْ لي، فَإِنَّهُ لا يَغْفِـرُ الذُّنوبَ إِلاّ أَنْـت ",
        "latin": "Bismil-lah, vElhamdulil-lah [Subhanel-ledhi sehare lena hadha ve ma kunna lehu mukrinin ve inna ila Rabbina le munka-libun], El-Hamdulil-lah, (3 herë), All-llahu Ekber, (3 herë), Subhaneke All-llahumme inni dhalemtu nefsi fagfir li, fe innehu la jagfirudh-dhunube il-la Ente.",
        "albanian": "Me emrin e Allahut, Falënderimi i takon Allahut, i Lartmadhëruar qoftë Ai i Cili i nënshtroi këto për ne, sepse ne nuk do të kishim mundësi ta bënim këtë; ne me të vërtetë tek Zoti ynë do të kthehemi; Falënderimi i qoftë Allahut, Falënderimi i qoftë Allahut. Falënderimi i qoftë Allahut, Allahu është më i Madhi, Allahu është më i Madhi; Allahu është më i Madhi, i Lartësuar qofsh o Allahu im, unë i kam bërë dëm vetvetes, prandaj më fal mua, sepse askush përveç teje nuk mund t’i falë mëkatet.",
        "reference": "Ebu Davudi 3/34, Tirmidhiu 5/501 “Sahih et-Tirmidhi” 3/156."
      },
      {
        "id": 234,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "Thotë i Dërguari (a.s) : “Kush i mëson përmendësh dhjetë ajetet e para të sures “Kehf”, është i mbrojtur prej dexhallit.” \\nSi dhe të kërkuarit mbrojtje nga Allahu i Madhëruar nga sprova e dexhallit pas teshehudit të fundit në çdo namaz. \\n",
        "reference": "Shënon Muslimi 1/555 dhe në transmetimin tjetër: “Dhjetë Ajetet e fundit të sures Kehf”, 1/556.\\nShih hadithet nën fusnotën: 75 dhe 76.\\n"
      }
    ]
  },
  {
    "id": 96,
    "chapter_name": "96.Duaja e udhëtimit",
    "invocations": [
      {
        "id": 198,
        "audio": "/audios/096_01.mp3",
        "arabic": "اَللَّهُ أَكْبَرُ، اَللَّهُ أَكْبَرُ، اَللَّهُ أَكْبَرُ، ﴿سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ۞ وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ﴾ اَللَّهُمَّ إِنّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا البِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اَللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ، اَللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَليفَةُ فِي الْأَهْلِ، اَللَّهُمَّ إِنِّي أَعُوذُبِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ\\n\\nI Dërguari i Allahut (a.s) kur kthehej nga udhëtimi, i thoshte të njëjtat fjalë dhe shtonte:\\nآيِبُونَ، تائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ\\n",
        "latin": "All-llahu ekber, All-llahu ekber, All-llahu ekber! Subhanel-ledhi sehare lena hadha ve ma kunna lehu mukrinin ve inna ila Rabbina le munkalibun. All-llahumme inna nes’eluke fi seferina hadha el-birre vet-takva ve minel-ameli ma terda, All-llahumme hevvin alejna seferena hadha vetvi anna bu’deh, All-llahumme entes-sahibu fis-seferi vel-halifetu fil ehli, All-llahumme inní eudhu bike min vua’thais-sefer ve keabetil-mendhar ve su’il-munkalebi fil-mali vel-ehl\\n\\nAjibune taibune abidune li Rabbina hamidune",
        "albanian": "“Allahu është më i madhi!” (3 herë). I Lartmadhëruar qoftë Ai që i nënshtroi këto për ne, sepse ne nuk do të kishim mundësi ta bënim këtë. Ne me të vërtetë tek Zoti ynë do të kthehemi. O Allahu ynë, të lutemi që në udhëtimin tonë të na mundësosh të bëjmë mirësi dhe të jemi të devotshëm, të bëjmë vepra me të cilat Ti je i kënaqur. O Allah, na e lehtëso neve udhëtimin tonë dhe na e bëj të rehatshme rrugën tonë. O Allahu im, Ti je shoqërues në udhëtim dhe mbrojtës i familjes sonë. O Allahu im, kërkoj që të më mbrosh nga vështirësitë e udhëtimit dhe nga kënaqësitë e tij, nga shikimet qëllim këqija dhe nga telashet me pasuri dhe familje.\\n\\nU kthyem me pendim dhe përkushtim, duke i bërë Zotit tonë Falënderim.",
        "reference": "Shënon Muslimi 2/998"
      }
    ]
  },
  {
    "id": 97,
    "chapter_name": "97.Duaja e hyrjes në ndonjë fshat apo qytet",
    "invocations": [
      {
        "id": 199,
        "audio": "/audios/097_01.mp3",
        "arabic": "أللّـهُمَّ رَبَّ السَّـمواتِ السّـبْعِ وَما أَظْلَلَـنَ، وَرَبَّ الأَراضيـنَ السّـبْعِ وَما أقْلَلْـنَ، وَرَبَّ الشَّيـاطينِ وَما أَضْلَلْـنَ، وَرَبَّ\\n\\nالرِّياحِ وَما ذَرَيْـنَ، أَسْـأَلُـكَ خَيْـرَ هذهِ الْقَـرْيَةِ وَخَيْـرَ أَهْلِـها، وَخَيْـرَ مَا فِيهَا، وَأَعـوذُ بِكَ مِنْ شَـرِّها وَشَـرِّ أَهْلِـها، وَشَـرِّ\\n\\nمَا فِيهَا ",
        "latin": "All-llahumme Rabbes-semavatis-seb’i ve ma adhlelne, ve Rabbel-eredines-seb’i ve eklelne, Rabbesh-shejatini ve ma adlelne, ve Rabber-rijahi ve ma dherejne. Es’eluke hajre hadhihil-karjeti ve hajre ehliha, ve hajre ma fíha, ve eudhu bike min sherriha ve sherri ehliha, ve sherri ma fiiha",
        "albanian": "O Allahu im, Zot i shtatë qiejve dhe i asaj që i mbulojnë, Zot i shtatë tokave dhe i asaj që ato e mbajnë, Zot i shejtanëve dhe atyre që ata i kanë dërguar në humbje, Zot i erës dhe i asaj që ato shpërndajnë, të lutem të më japësh të mirën e këtij fshati, mirësinë e banorëve të tij, të mirën e asaj që gjendet në të dhe kërkoj që të më mbrosh nga dëmi i këtij fshati, dëmi i banorëve të tij dhe dëmi i asaj që gjendet në të.",
        "reference": "Hakimi, i cili e ka vërtetuar dhe e ka pëlqyer Dhehebiu 2/100, si dhe Ibën Sunnij nr. 524. Ibën Haxheri në “Edhkar” 5/154 e ka bërë të mirë. Ibën Bazi thotë: “Këtë hadith e shënon Nesaiu me sened të mirë në Tuhfetul-Ahjar, fq. 37.”"
      }
    ]
  },
  {
    "id": 98,
    "chapter_name": "98.Duaja e hyrjes në treg",
    "invocations": [
      {
        "id": 200,
        "audio": "/audios/098_01.mp3",
        "arabic": "لا إلهَ إلاّ اللّه وحدَهُ لا شريكَ لهُ، لهُ المُلْـكُ ولهُ الحَمْـد، يُحْيـي وَيُميـتُ  وَهُوَ حَيٌّ لا يَمُـوت، بِيَـدِهِ الْخَـيْرُ وَهوَ عَلىَ كلّ\\n\\nشيءٍ قَدِيرٌ ",
        "latin": "La ilahe il-lAll-llahu vahdehu la sherike leh, lehul-Mulku ve lehul-hamdu, juhji ve jumitu, ve Huve hajjun la jemutu bi jedihi el-hajru ve Huve ala kul-li shej’in Kadir",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut, Ai është Një dhe i pa rival; Atij i takon sundimi dhe vetëm Atij i takon falënderimi; Ai jep jetë dhe vdekje, ndërsa Ai është i Gjalli i Cili nuk vdes kurrë. Në Dorën e Tij është gjithë e mira dhe Ai është i Plotfuqishëm mbi çdo gjë.",
        "reference": "Tirmidhiu 5/291, Hakimi 1/538, i mirë sipas Albanit, “Sahih Ibën Maxheh” 2/21 dhe “Sahih et-Tirmidhi” 3/152."
      }
    ]
  },
  {
    "id": 99,
    "chapter_name": "99.Duaja kur të pengohet mjeti i udhëtimit",
    "invocations": [
      {
        "id": 201,
        "audio": "/audios/069_01.mp3",
        "arabic": "بِسْـمِ اللهِ",
        "latin": "Bismil-lah",
        "albanian": "Me emrin e Allahut.",
        "reference": "Ebu Davudi 4/296, i vërtetë sipas Albanit, shih “Sahih Ebu Davud” 3/941."
      }
    ]
  },
  {
    "id": 100,
    "chapter_name": "100.Duaja e udhëtarit për atë i cili nuk udhëton",
    "invocations": [
      {
        "id": 202,
        "audio": "/audios/100_01.mp3",
        "arabic": "أَسْتَـوْدِعُكُـمُ اللَّهَ الَّذي لا تَضِـيعُ وَدائِعُـهُ ",
        "latin": "Estevdi ukumull-llahe el-ledhi la tedi’u ve-dai’uhu.",
        "albanian": "Ju lë nën kujdes të Allahut, i Cili nuk i humb porositë e Tij.",
        "reference": "Ahmedi 2/403, Ibën Maxheh 2/943 “Sahih Ibën Maxheh” 2/133."
      }
    ]
  },
  {
    "id": 101,
    "chapter_name": "101.Duaja e atij që nuk udhëton për udhëtarin",
    "invocations": [
      {
        "id": 203,
        "audio": "/audios/101_01.mp3",
        "arabic": "أَسْتَـوْدِعُ اللَّهَ دِيـنَكَ وَأَمانَتَـكَ، وَخَـواتيـمَ عَمَـلِكَ  ",
        "latin": "Estevdi ull-llahe dineke ve emaneteke, ve havatime amelike",
        "albanian": "Në mbrojtjen e Allahut qofshin feja jote, besa jote dhe përfundimi i punëve tuaja.",
        "reference": "Ahmedi 2/7, Tirmidhiu 5/499 ”Sahih et-Tirmidhi” 2/155.”"
      },
      {
        "id": 204,
        "audio": "/audios/101_02.mp3",
        "arabic": "زَوَّدَكَ اللَّهُ التقْوى، وَغَفَـرَذَنْـبَكَ، وَيَسَّـرَ لَكَ الخَـيْرَ حَيْـثُما كُنْـت",
        "latin": "Zevvedeke All-llahu et-takva, ve Gafere dhenbeke, ve jessere lekel-hajre hajthu ma kunte",
        "albanian": "Të furnizoftë Allahu me devotshmëri, t’i faltë mëkatet dhe t’i lehtësoftë punët e mira kudo që të jesh.",
        "reference": "Tirmidhiu në “Sahih et-Tirmidhi” 3/155."
      }
    ]
  },
  {
    "id": 102,
    "chapter_name": "102.Tekbiri dhe tesbihu gjatë udhëtimit",
    "invocations": [
      {
        "id": 272,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "Shënohet nga Xhabiri (r.a) , i cili ka thënë: “Kur hipnim përpjetë, merrnim tekbir, thonim All-llahu Ekber, ndërsa kur zbrisnim bënim tesbih, thonim SubhanAll-llah.” ",
        "reference": "Buhariu, “Fet’hul-Bari” 6/135"
      }
    ]
  },
  {
    "id": 103,
    "chapter_name": "103.Duaja e udhëtarit para agimit të mëngjesit",
    "invocations": [
      {
        "id": 205,
        "audio": "/audios/.mp3",
        "arabic": "سَمِـعَ سـامِعُ بِحَمْـدِ اللهِ وَحُسْـنِ بَلائِـهِ عَلَيْـنا. رَبَّنـا صـاحِبْـنا وَأَفْـضِل عَلَيْـنا عائِذاً باللهِ مِنَ النّـار",
        "latin": "Semmi’a sami’un bi hamdil-lahi, ve husni belaihi alejna. Rabbena Sahibna ve efdil alejna aidhen bil-lahi minen-nari",
        "albanian": "Le të dëgjoj çdo dëgjues për Falënderimin tonë ndaj Allahut, si dhe për begatitë e Tij dhe mirësitë e Tij ndaj nesh; O Zoti ynë, na shoqëro dhe na jep dhunti duke kërkuar mbrojtjen Tënde prej zjarrit.",
        "reference": "Muslimi 4/2086. Shih Komentimin e Neveviut 4/2080."
      }
    ]
  },
  {
    "id": 104,
    "chapter_name": "104.Duaja kur të ndalesh në ndonjë vend, qoftë në udhëtim apo jo",
    "invocations": [
      {
        "id": 206,
        "audio": "/audios/104_01.mp3",
        "arabic": "أَعـوذُ بِكَلِـماتِ اللّهِ التّـامّاتِ مِنْ شَـرِّ ما خَلَـق",
        "latin": "Eudhu bi kelimatil-lahit-tammati min sherri ma halaka",
        "albanian": "Kërkoj mbrojtje me fjalët e përsosura të Allahut nga e keqja që e ka krijuar.",
        "reference": "Muslimi 4/2080. Këtë e thoshte kur kthehej prej ndonjë beteje ose kur kthehej nga haxhi."
      }
    ]
  },
  {
    "id": 105,
    "chapter_name": "105.Dhikri i kthimit nga udhëtimi",
    "invocations": [
      {
        "id": 207,
        "audio": "/audios/105_01.mp3",
        "arabic": "اَلهُ  أَكْبَرُ، اَللهُ أَكْبَرُ، اَللهُ َكْبَرُ لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنا حَامِدُونَ، صَدَقَ اللهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزابَ وَحْدَهُ",
        "latin": "All-llahu Ekber, All-llahu Ekber, All-llahu Ekber: La ilahe il-lAll-llahu vahdehu la sherike leh, lehul mulku ve lehul hamdu ve huve ala kul-li shej’in kadir ajibúne taibúne abidúne li Rabbina hamidun. SadekAll-llahu va’deh, ve nesare abdeh, ve hezemel-ahzabe vahdeh",
        "albanian": "Allahu është më i Madhi, Allahu është më i Madhi, Allahu është më i Madhi: Nuk ka hyjni që meriton të adhurohet përveç Allahut, të Vetëm e i pa rival. Atij i takon sundimi dhe Lavdërimi, Ai është i Plotfuqishëm mbi çdo gjë. U kthyem me pendim dhe përkushtim, duke i bërë Zotit tonë Falënderim, Allahu e përmbushi premtimin e Tij, e ndihmoi robin e Tij dhe i mposhti grupacionet i Vetëm.",
        "reference": "Buhariu 7/163, Muslimi 2/980."
      }
    ]
  },
  {
    "id": 106,
    "chapter_name": "106.Çfarë duhet të thotë ai të cilit i vjen diç që e gëzon apo që e urren",
    "invocations": [
      {
        "id": 273,
        "audio": "/audios/106_01.mp3",
        "arabic": "I Dërguari i Allahut (a.s) kur i vinte ndonjë çështje e cila e gëzonte thoshte:\\nاَلْحَمْدُ لِلهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ\\n\\nNdërsa kur i vinte ndonjë çështje të cilën e urrente, thoshte:\\nاَلْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ\\n",
        "latin": "Elhamdulil-lahil-ledhi bi ni’ëmetihi tetimmus-salihat\\n\\nElhamdulil-lahi ala kul-li hal",
        "albanian": "Falënderimi i qoftë Allahut, i Cili me begatinë e Tij i plotëson punët e mira.\\n\\nFalënderimi i takon Allahut për çdo gjendje.",
        "reference": "Ibën Sunnij në “Amel el-Jevmi ve Lejleh” dhe Hakimi, i cili e ka vërtetuar 1/499. Gjithashtu shejh Albani e ka autentifikuar në “Sahih el-Xhamiu” 4/201."
      }
    ]
  },
  {
    "id": 107,
    "chapter_name": "107.Vlera e salavatit mbi të dërguarin",
    "invocations": [
      {
        "id": 274,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "1. I Dërguari i Allahut (a.s) ka thënë: “Kush më dërgon mua një salavat, Allahu i Madhëruar ka për t’i dërguar atij për atë salavat, dhjetë salavate.” \\n2. Pastaj ai ka vazhduar duke thënë: “Mos e bëni varrin tim festë për vizita, por bini salavat mbi mua, se salavati i juaj më arrin mua kudo që të jeni.” \\n3. Për këtë ai (a.s) po ashtu ka thënë: “Koprrac është ai i cili kur përmendem pranë tij nuk bie salavat mbi mua.” \\n4. Ai (a.s) gjithashtu ka thënë: “Allahu ka melaike, të cilat shëtisin nëpër tokë dhe m’i përcjellin përshëndetjet e umetit tim.” \\n5. Si dhe: “Nuk më përshëndet askush e që Allahu të mos ma kthejë shpirtin derisa t’ia kthej përshëndetjen.” \\n",
        "reference": "Muslimi 1/288.\\nEbu Davudi 2/218, Ahmedi 2/367. I vërtetë sipas Albanit “Sahih Ebu Davud” 2/383.\\nTirmidhiu dhe të tjerë “Sahih el-Xhamiu” 3/25 dhe “Sahih et-Tirmidhi” 3/177.\\nNesaiu dhe Hakimi 2/421. I vërtetë sipas Albanit, shih “Sahih En-Nesai” 1/274.\\nEbu Davudi nr.2041, i mirë sipas Albanit, shih “Sahih Ebu Davud”.\\n"
      }
    ]
  },
  {
    "id": 108,
    "chapter_name": "108.Përhapja e selamit",
    "invocations": [
      {
        "id": 235,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "Shënohet nga Xhabiri (r.a), i cili ka thënë: “Kur hipnim përpjetë, merrnim tekbir, thonim All-llahu Ekber, ndërsa kur zbrisnim bënim tesbih, thonim SubhanAll-llah.”",
        "reference": "Buhariu, “Fet’hul-Bari” 6/135"
      }
    ]
  },
  {
    "id": 109,
    "chapter_name": "109.Si duhet kthyer selamin jobesimtarëve, nëse japin selam",
    "invocations": [
      {
        "id": 208,
        "audio": "/audios/109_01.mp3",
        "arabic": "Transmetohet se i Dërguari i Allahut (a.s) ka thënë: “Nëse u japin selam Ehli Kitabët  thuajuni:\\n\\nوَعَلَيْكُمْ\\n",
        "latin": "Ve alejkum",
        "albanian": "Edhe mbi ju.",
        "reference": "Buhariu me “Fet’h” 11/42, Muslimi 4/1795."
      },
      {
        "id": 236,
        "audio": "/audios/.mp3",
        "arabic": "I Dërguari i Allahut (a.s) kur i vinte ndonjë çështje e cila e gëzonte thoshte:\\nاَلْحَمْدُ لِلهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ\\n\\nNdërsa kur i vinte ndonjë çështje të cilën e urrente, thoshte:\\nاَلْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ\\n",
        "latin": "Elhamdulil-lahil-ledhi bi ni’ëmetihi tetimmus-salihat\\n\\nElhamdulil-lahi ala kul-li hal",
        "albanian": "Falënderimi i qoftë Allahut, i Cili me begatinë e Tij i plotëson punët e mira.\\n\\nFalënderimi i takon Allahut për çdo gjendje.",
        "reference": "Ibën Sunnij në “Amel el-Jevmi ve Lejleh” dhe Hakimi, i cili e ka vërtetuar 1/499. Gjithashtu shejh Albani e ka autentifikuar në “Sahih el-Xhamiu” 4/201."
      }
    ]
  },
  {
    "id": 110,
    "chapter_name": "110.Çfarë duhet thënë kur të këndon gjeli dhe të pëllet gomari",
    "invocations": [
      {
        "id": 237,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "1. I Dërguari i Allahut (a.s) ka thënë: “Kush më dërgon mua një salavat, Allahu i Madhëruar ka për t’i dërguar atij për atë salavat, dhjetë salavate.” \\n2. Pastaj ai ka vazhduar duke thënë: “Mos e bëni varrin tim festë për vizita, por bini salavat mbi mua, se salavati i juaj më arrin mua kudo që të jeni.” \\n3. Për këtë ai (a.s) po ashtu ka thënë: “Koprrac është ai i cili kur përmendem pranë tij nuk bie salavat mbi mua.” \\n4. Ai (a.s) gjithashtu ka thënë: “Allahu ka melaike, të cilat shëtisin nëpër tokë dhe m’i përcjellin përshëndetjet e umetit tim.” \\n5. Si dhe: “Nuk më përshëndet askush e që Allahu të mos ma kthejë shpirtin derisa t’ia kthej përshëndetjen.” \\n",
        "reference": "Muslimi 1/288.\\nEbu Davudi 2/218, Ahmedi 2/367. I vërtetë sipas Albanit “Sahih Ebu Davud” 2/383.\\nTirmidhiu dhe të tjerë “Sahih el-Xhamiu” 3/25 dhe “Sahih et-Tirmidhi” 3/177.\\nNesaiu dhe Hakimi 2/421. I vërtetë sipas Albanit, shih “Sahih En-Nesai” 1/274.\\nEbu Davudi nr.2041, i mirë sipas Albanit, shih “Sahih Ebu Davud”.\\n"
      }
    ]
  },
  {
    "id": 111,
    "chapter_name": "111.Çfarë duhet thënë kur të lehin qentë natën",
    "invocations": [
      {
        "id": 238,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "1. I Dërguari (a.s) ka thënë: “Nuk keni për të hyrë në Xhenet, derisa të besoni dhe nuk keni besuar derisa të duheni. A t’ju udhëzoj në një gjë, të cilën nëse e veproni keni për t’u dashur. Përhapeni selamin ndërmjet jush.” \\n2. “Kush i tubon tri cilësi, e ka përfshirë besimin: ‘Të qenit joegoist, dhënia e selamit njerëzve dhe dhënia e lëmoshës në skamje.’” \\n3. Shënohet nga Abdullah ibën Omeri (r.a) se një njeri e ka pyetur të Dërguarin : “Cili është Islami më i mirë?” I Dërguari i Allahut (a.s) i tha: “T’i ushqesh nevojtarët, t’i japësh selam atij që e njeh dhe atij që nuk e njeh.” ",
        "reference": "Muslimi 1/74 dhe të tjerë.\\nBuhariu me “Fet’h” 1/82, nga Amari   mevkuf.\\nBuhariu me “Fet’h” 1/55, Muslimi 1/65.\\n"
      },
      {
        "id": 239,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "Shënohet se i Dërguari i Allahut (a.s) ka thënë: “Kur ta dëgjoni gjelin duke kënduar, luteni Allahun që t’ju jap nga të mirat e Tij, sepse gjeli e ka parë melekun, ndërsa kur ta dëgjoni palljen e gomarit, kërkoni mbrojtjen e Allahut prej shejtanit, sepse ai e ka parë shejtanin.”",
        "reference": "Buhariu “Fet’h” 6/350, Muslimi 4/2092."
      }
    ]
  },
  {
    "id": 112,
    "chapter_name": "112.Duaja për atë të cilin e ke ofenduar",
    "invocations": [
      {
        "id": 209,
        "audio": "/audios/112_01.mp3",
        "arabic": "اللهُمَّ فأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لهُ قُرْبةً إليكَ يَوْمَ القِيَامةِ",
        "latin": "All-llahumme fe ejjuma mu’minin sebebtuhu fexh’al dhalike lehu kurbeten ilejke jevmel kijameti",
        "albanian": "O Allahu im, cilindo besimtar që e kam ofenduar, bëja këtë ofendim atij afrim tek Ti Ditën e Gjykimit.",
        "reference": "Buhariu “Fet’hul-Bari” 11/171” dhe Muslimi 4/2007."
      },
      {
        "id": 240,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "Shënohet se i Dërguari i Allahut (a.s) ka thënë: “Kur t’i dëgjoni të lehurat e qenve dhe palljet e gomarëve në mbrëmje, kërkoni mbrojtjen e Allahut prej tyre, sepse ata shohin atë që ju nuk e shihni.” ",
        "reference": "Ebu Davudi 4/327 dhe Ahmedi 3/306, shejh Albani e ka bërë të vërtetë në librin “Sahih Ebi Davud”."
      }
    ]
  },
  {
    "id": 113,
    "chapter_name": "113.Çfarë thotë muslimani kur ta lavdërojë muslimanin",
    "invocations": [
      {
        "id": 210,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "I Dërguari i Allahut (a.s) ka thënë: “Nëse ndonjëri prej jush e lavdëron shokun e tij, le të thotë: “E konsideroj filanin të këtillë, Allahu e di më së miri për të dhe nuk e lavdëroj askënd para Allahut, e konsideroj kështu dhe kështu.”",
        "reference": "Muslimi 4/2296."
      }
    ]
  },
  {
    "id": 114,
    "chapter_name": "114.Çfarë duhet të thotë muslimani kur të lavdërohet prej ndokujt",
    "invocations": [
      {
        "id": 212,
        "audio": "/audios/114_01.mp3",
        "arabic": "اللَّهُمّ لاَ تُؤاَخِذْنِي ِبَما يَقُولُونُ ، وَاغْفِرْ لِي مَالا يَعْلَمُونَ [وَاجْعَلْنِي خَيْراً مِمَّا َيظُنُّونَ]",
        "latin": "All-llahumme la tuahidhni bima jeku-lun, vagfir li ma la ja’ëlemun [vexh-alni hajren mimma jedhunnun]",
        "albanian": "O Allahu im, mos më dëno për atë që thonë, m’i fal ato që nuk i di, [dhe më bën më të mirë se sa më mendojnë të tjerët].",
        "reference": "Buhariu në “Edebul Mufred” #761, senedin e këtij hadithi e ka autentifikuar Albani në “Sahih Edebul Mufred” #585, ndërsa ajo që është ndërmjet kllapave është pjesa e Bejhekiut e marrë nga libri i tij “Shuabul-Iman” 4/228, me rrugë tjetër të transmetimit."
      }
    ]
  },
  {
    "id": 115,
    "chapter_name": "115.Telbia për haxhxh dhe umre",
    "invocations": [
      {
        "id": 213,
        "audio": "/audios/115_01.mp3",
        "arabic": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ ، لا شَرِيكَ لَكَ لَبَّيْكَ ،إنَّ الْحَمْدَ ،وَالنِّعْمَةَ ،لَكَ وَالْمُلْكُ ، لا شَرِيكَ لَكَ",
        "latin": "Lebbejke All-llahumme Lebbejk, Leb-bejke La sherike Leke Lebbejk, innel-Hamde ven-ni’ëmete leke vel-Mulk La sherike Lek",
        "albanian": "Të përgjigjem o Allahu im, të përgjigjem Ty, Ti je i pa rival, vetëm Ty të përgjigjem, Falënderimi të takon vetëm Ty. Të gjitha begatitë dhe e tërë pasuria është e Jotja, Ti je i pa rival.",
        "reference": "Buhariu “Fet’hul-Bari” 3/408, 2/841 dhe Muslimi."
      }
    ]
  },
  {
    "id": 116,
    "chapter_name": "116.Tekbiri me rastin e afrimit të haxherul-esvedit",
    "invocations": [
      {
        "id": 241,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "I Dërguari i Allahut (a.s) ka bërë tavaf rreth Qabes i hipur mbi deve dhe sa herë që vinte te Haxherul-esvedi ia drejtonte atë që e kishte në dorë dhe merrte tekbir.",
        "reference": "Buhariu “Fet’hul-Bari” 3/476 dhe 3/472."
      }
    ]
  },
  {
    "id": 117,
    "chapter_name": "117.Duaja ndërmjet ruknul-jemanit dhe haxherul-esvedit",
    "invocations": [
      {
        "id": 214,
        "audio": "/audios/117_01.mp3",
        "arabic": "رَبَّنَا آتِنَا في الدُّنْيَا حسَنَةً وفي الآخِرَةِ حسَنةً وقِنَا عذَابَ النَّارِ",
        "latin": "Rabbena atina fid-dunja haseneten ve fil-ahireti haseneten vekina adhaben-nar",
        "albanian": "O Zoti ynë, na jep të mira në këtë botë dhe të mira në Ahiret, si dhe na ruaj prej dënimit të Xhehenemit.",
        "reference": "Ebu Davudi 2/179, Ahmedi 3/411 dhe Begaviu në “Sherh es-Sunneh” 7/128. Shejh Albani e ka bërë të mirë në “Sahih Ebi Davud” 1/354, ndërsa ajeti është në suren Bekare 201."
      }
    ]
  },
  {
    "id": 118,
    "chapter_name": "118.Duaja e qëndrimit mbi saffa dhe merve",
    "invocations": [
      {
        "id": 215,
        "audio": "/audios/118_01.mp3",
        "arabic": "Atëherë kur i është afruar i Dërguari i Allahut Safas e ka lexuar ajetin:\\n۞إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَآئِرِ اللهِ۞\\n\\nGjithashtu i Dërguari ka thënë: \\nأَبْدَأُ بِمَا بَدَأَ اللهُ بِهِ\\n",
        "latin": "Innes-saf-fa vel-mervete min she’airil-lah\\n\\nebdeu bima bedeAll-llahu bihi...",
        "albanian": "Po filloj me atë që ka filluar Allahu.",
        "reference": ""
      },
      {
        "id": 242,
        "audio": "/audios/118_02.mp3",
        "arabic": "Ka filluar nga Safaja, është ngjitur mbi të derisa e ka parë Qaben, është drejtuar nga kibla e ka madhëruar njësinë e Allahut, ka marrë tekbir dhe ka thënë:\\nلاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ \\nوَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ\\n",
        "latin": "La ilahe il-lAll-llahu vahdehu la sherike leh, lehul-Mulku ve lehul-Hamdu ve Huve ala kul-li shej’in Kadir, La ilahe il-lAll-llahu vahdehu, enxheze va’dehu, ve nesare abdehu, ve hezemel-ahzabu vahdeh",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut, të Vetëm e i pa rival. Atij i takon Sundimi dhe Lavdërimi dhe Ai është i Gjithëfuqishëm mbi çdo gjë; e përmbushi premtimin e Tij, e ndihmoi robin e Tij dhe i Vetëm i mposhti grupacionet.",
        "reference": "Muslimi 2/888."
      }
    ]
  },
  {
    "id": 119,
    "chapter_name": "119.Duaja në ditën e arafatit",
    "invocations": [
      {
        "id": 243,
        "audio": "/audios/119_01.mp3",
        "arabic": "I Dërguari (a.s) ka thënë: “Fjala më e mirë të cilën e kam thënë unë dhe të Dërguarit para meje, është:\\nلاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\\n",
        "latin": "La ilahe il-lAll-llahu vahdehu la sherike leh, lehul-Mulku ve lehul-Hamdu ve Huve ala kul-li shej’in Kadír",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut, të Vetëm e i pa rival. Atij i takon Sundimi dhe Lavdërimi dhe Ai është i Gjithëfuqishëm mbi çdo gjë.",
        "reference": "Tirmidhiu. Shejh Albani e ka bërë të mirë “Sahih et-Tirmidhi” 3/184 dhe “Silsileh Ehadith es-Sahiha” 4/6."
      }
    ]
  },
  {
    "id": 120,
    "chapter_name": "120.Të përkujtuarit e allahut tek mesh’aril-harami (muzdelife)",
    "invocations": [
      {
        "id": 244,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "I Dërguari i Allahut (a.s) i hipi devesë derisa arriti tek Mesh’aril-harami, iu drejtua kibles, u lut, mori tekbire, lartësoi madhërinë e Allahut dhe njësinë e Tij. Kështu vazhdoi përderisa nuk u bë qielli shumë i kuqërremtë dhe u largua para se të perëndojë dielli.",
        "reference": "Muslimi 2/891."
      }
    ]
  },
  {
    "id": 121,
    "chapter_name": "121.Marrja e tekbireve gjatë gjuajtjes së çdo guraleci në xhemerat",
    "invocations": [
      {
        "id": 245,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "Sa herë që i Dërguari i Allahut (a.s) e gjuante një gurë në Mina në cilindo nga tri gjuajtjet (xhemeratet), ecte pak, ndalej dhe me duar të ngritura bënte dua i kthyer nga Kibla. Këtë e bënte gjatës gjuajtjes së gurit të parë dhe të dytë, ndërsa kur bënte gjuajtjen e tretë, në çdo guri të hedhur merrte tekbir dhe largohej duke mos u ndalur fare tek ai. ",
        "reference": "Buhariu “Fet’hul-Bari” 3/581, 3/583, 3/584” dhe Muslimi."
      }
    ]
  },
  {
    "id": 122,
    "chapter_name": "122.Duaja me rastin e dëgjimit të ndonjë lajmi të çuditshëm apo të gëzueshëm",
    "invocations": [
      {
        "id": 216,
        "audio": "/audios/122_01.mp3",
        "arabic": "سُبْحَانَ اللهِ",
        "latin": "SubhanAll-llah",
        "albanian": "I Lartësuar qoftë Allahu, sa i pa të metë është Ai.",
        "reference": "Buhariu “Fet’hul-Bari” 1/210, 390, 414” dhe Muslimi 4/1857."
      },
      {
        "id": 217,
        "audio": "/audios/122_02.mp3",
        "arabic": "اللهُ أَكْبرُ",
        "latin": "All-llahu Ekber",
        "albanian": "Allahu është më i madhi.",
        "reference": "Buhariu “Fet’hul-Bari” 8/441, “Sahih et-Tirmidhi” 3/103 dhe 2/235 dhe shih Musnedin e Imam Ahmedit, 5/218."
      }
    ]
  },
  {
    "id": 123,
    "chapter_name": "123.Çfarë duhet të veprojë ai të cilit i ndodh diç që e gëzon",
    "invocations": [
      {
        "id": 221,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "I Dërguari i Allahut (a.s) kur i ndodhte ndonjë gjë e cila e gëzonte, përulej në sexhde, në shenjë falënderimi për Allahun e Madhëruar. ",
        "reference": "Transmetojnë autorët e katër Suneneve përveç Nesaiut “Sahih ibën Maxheh”, 1/233 dhe “Irvaul-Galil”, 2/226."
      }
    ]
  },
  {
    "id": 124,
    "chapter_name": "124.Çfarë duhet të thotë ai i cili ndien dhimbje në trupin e tij",
    "invocations": [
      {
        "id": 246,
        "audio": "/audios/124_01.mp3",
        "arabic": "Vendos dorën në vendin që të dhemb dhe thuaj:\\nبِسْمِ اللهِ\\n\\nDhe pastaj thuaj:\\nأَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ\\n",
        "latin": "Bismil-lah. (3 herë)\\n\\nEudhu bil-lahi ve kudretihi min sherri ma exhidu ve uhadhiru (7 herë)",
        "albanian": "Në emër të Allahut.\\n\\nKërkoj mbrojtjen e Allahut me fuqinë e Tij nga e keqja e kësaj që ndiej dhe frikohem.",
        "reference": "Muslimi 4/1728."
      }
    ]
  },
  {
    "id": 125,
    "chapter_name": "125.Duaja e atij i cili frikohet se mos po merr mësysh diçka me syrin e tij",
    "invocations": [
      {
        "id": 247,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "Nëse ndokush prej jush sheh diç e cila i pëlqen tek vëllai i tij, në veten e tij apo në pasurinë e tij, le të lutet që Allahu t’ia bekojë këtë gjë, sepse syri është i vërtetë. ",
        "reference": "Ahmedi në Musnedin e tij 4/447, Ibën Maxheh dhe Ma-liku. Albani e ka vërtetuar në “Sahih el-Xhamiu” 1/212. Shih recensionin e librit “Zadul-Me’ad” të Shuajb dhe Abdulkadër Arnautit 4/170."
      }
    ]
  },
  {
    "id": 126,
    "chapter_name": "126.Çfarë duhet thënë në raste të frikës",
    "invocations": [
      {
        "id": 248,
        "audio": "/audios/126_01.mp3",
        "arabic": "لاَ إِلَهَ إِلاَّ اللهُ",
        "latin": "La Ilahe il-lAll-llah",
        "albanian": "Nuk ka të adhuruar tjetër përveç Allahut.",
        "reference": "Buhariu “Fet’hul-Bari” 6/181 dhe Muslimi 4/2208."
      }
    ]
  },
  {
    "id": 127,
    "chapter_name": "127.Çfarë duhet thënë me rastin e therjes së kafshëve apo të kurbanit",
    "invocations": [
      {
        "id": 249,
        "audio": "/audios/127_01.mp3",
        "arabic": "بِسْمِ اللهِ وَاللهُ أَكْبَرُ [اَللَّهُمَّ مِنْكَ وَلَكَ] اَللَّهُمَّ تَقَبَّلْ مِنِّي",
        "latin": "Bismil-lah, vAll-llahu Ekber, [All-llahumme minke ve leke] All-llahumme tekabbel minni",
        "albanian": "Me emrin e Allahut, Allahu është më i madhi [O Allahu im kjo është nga Ti dhe për Ty], O Allahu im, pranoje këtë nga unë.",
        "reference": "Muslimi 3/1557 dhe Bejhekiu 9/287, pjesa e hadithit ndërmjet kllapave gjendet te Bejhekiu 9/287. Fjalinë e fundit e kam cekur në bazë të kuptimit nga transmetimi i Muslimit."
      }
    ]
  },
  {
    "id": 128,
    "chapter_name": "128.Çfarë thuhet për largimin e kurtheve të shejtanëve",
    "invocations": [
      {
        "id": 250,
        "audio": "/audios/128_01.mp3",
        "arabic": "أَعُوذُ بكَلِمَاتِ اللهِ التَّامَّاتِ الَّتِي لاَ يُجَاوِزُهُنَّ بَرٌّ وَلاَ فَاجِرٌ: مِنْ شَرِّ مَا خَلَقَ، وَبَرَأَ وَذَرَأَ، وَمِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وَمِنْ شَرِّ مَا يَعْرُجُ فيهَا، وَمِنْ شَرِّ مَا ذَرَأَ فِي الْأَرْضِ، وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ، وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلاَّ طَارِقاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ",
        "latin": "Eudhu bi kelimatil-lahi Et-tammati el-leti la juxhavizu hunne berrun ve la faxhirun min sherri ma halaka, ve bere’e ve dher’e, ve min sherri ma jenzilu mines-semái, ve min sherri ma je’ëruxhu fíha, ve min sherri ma dhere’e fil-erdi, ve min sherri ma jahruxhu minha, ve min sherri fitenil-lejli ven-nehar, ve min sherri kul-li tarikin il-la tarikan, jatruku bi hajrin, ja Rahmanu",
        "albanian": "Kërkoj mbrojtje me fjalët e përsosura të Allahut, të cilat nuk mund t’i tejkalojë asnjë bamirës e as i prishur, nga dëmi i asaj që ka krijuar, nga dëmi i asaj që zbret nga qielli, nga dëmi i asaj që ngjitet në të, nga dëmi i asaj që është mbi tokë dhe i asaj që del nga ajo, nga dëmi i sprovave të natës dhe të ditës, si dhe nga dëmi i çdo udhëtari të natës përveç Atij i cili do të vijë me të mirë, o i Gjithëmëshirshëm.",
        "reference": "Ahmedi 3/419 me sened të vërtetë. Gjithashtu e shënoj Ibën Sunnijj nr. 637. Abdulkadër Arnauti e ka vërtetuar senedin e tij në vlerësimin e tij të librit të Tahaviut fq.133 dhe “Mexhmeuz-Zevaid” 1/127."
      }
    ]
  },
  {
    "id": 129,
    "chapter_name": "129.Të kërkuarit falje dhe pendim",
    "invocations": [
      {
        "id": 251,
        "audio": "/audios/129_01.mp3",
        "arabic": "أَسْتَغْفِرُ اللهَ الْعَظيمَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ القَيّوُمُ وَأَتُوبُ إِلَيهِ",
        "latin": "Estagfirull-llahe el-Adhim el-ledhi la ilahe il-la Huve, El-Hajjul-Kajjumu ve etubu ilejhi",
        "albanian": "1.Ebu Hurejra (r.a) thotë: “E kam dëgjuar të Dërguarin (a.s) duke thënë: “Pasha Allahun, unë kërkoj falje prej Allahut dhe pendohem tek Ai më tepër se shtatëdhjetë herë në ditë.” \\n\\n2.I Dërguari (a.s) gjithashtu ka thënë: “O ju njerëz, pendohuni tek Allahu, sepse unë pendohem njëqind herë në ditë.” \\n\\n3.Po ashtu i Dërguari (a.s) ka thënë: “Kush thotë: “Kërkoj faljen e Allahut të Madhërueshëm, e të Cilit nuk ka të adhuruar tjetër përveç Tij, që është i Gjallë përgjithmonë dhe Mbikëqyrës i Përhershëm dhe vetëm tek Ai pendohem.”\\nAllahu do t’ia falë atij edhe nëqoftëse ka ikur nga beteja.”\\n \\n4. I Dërguari (a.s) gjithashtu ka thënë: “Allahu më së tepërmi i afrohet robit të Vet në pjesën e fundit të natës, nëse ke mundësi të jesh prej atyre të cilët e përmendin Allahun në atë moment, bëhu.” \\n\\n5. Po ashtu i Dërguari i Allahut (a.s) ka thënë: “Robi është më afër Zotit të Tij kur është në sexhde, pra shpeshtoni lutjet në sexhde.” \\n\\n6. Dhe i Dërguari (a.s) ka thënë: “Me të vërtetë disa herë zemrën time e kaplon pakujdesia, andaj kërkoj falje prej Allahut njëqind herë në ditë.” \\n",
        "reference": "Buhariu “Fet’hul-Bari” 11/101.\\nMuslimi 4/2076.\\nEbu Davudi 2/85, Tirmidhiu 5/569 dhe Hakimi, i cili e ka vërtetuar, kurse Dhehebiu e ka pëlqyer 1/511. Gjithashtu Albani e ka autentifikuar në “Sahih et-Tirmidhi” 3/183. Shih po ashtu “Xhamiu Usul li Ehadith er-Resul” 4/389, 390 me recension të Arnautit.\\nTirmidhiu, Nesaiu 1/279 dhe Hakimi “Sahih et-Tirmidhi” 3/183 dhe “Xhamiu Usul” me recension të Arnautit 4/144.\\nMuslimi 1/350.\\nMuslimi, “Xhamiu Usul”, 4/386.\\n\\n"
      }
    ]
  },
  {
    "id": 130,
    "chapter_name": "130.Vlera e tesbihut, tahmidit, tehlilit dhe e tekbirit",
    "invocations": [
      {
        "id": 254,
        "audio": "/audios/130_01.mp3",
        "arabic": "I Dërguari i Allahut (a.s) ka thënë: “Kush thotë:\\nسُبْحَانَ اللهِ وَبِحَمْدِهِ\\n",
        "latin": "SubhanAll-llahi ve bihamdihi",
        "albanian": "“I Lartësuar qoftë Allahu dhe Atij i takon falënderimi, njëqind herë në ditë, i fshihen mëkatet edhe nëse ato janë të shumta aq sa shkuma e detit.”",
        "reference": "Buhariu 7/168 dhe Muslimi 4/2071."
      },
      {
        "id": 255,
        "audio": "/audios/130_02.mp3",
        "arabic": "I Dërguari (a.s) ka thënë: “Kush thotë:  \\nلاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\\n",
        "latin": "La Ilahe il-lAll-llahu vahdehu la sherike Lehu, Lehul mulku ve Lehul hamdu ve Huve ala kul-li shej’in kadir. (10 herë)",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut, të Vetëm e i pa rival. Atij i takon Sundimi dhe Lavdërimi dhe Ai është i Gjithëfuqishëm mbi çdo gjë.\\n\\n\"Ka shpërblimin sikur t’i ketë liruar katër persona nga bijtë e Ismailit.\"",
        "reference": "Buhariu 7/167 dhe Muslimi 4/2071."
      },
      {
        "id": 256,
        "audio": "/audios/130_03.mp3",
        "arabic": "I Dërguari i Allahut (a.s) ka thënë: “Dy fjalë janë të lehta për gjuhën, të rënda në peshojë, e të dashura te i Gjithmëshirshmi.”\\nسُبْحَانَ اللهِ وَبِحَمْدِهِ، سُبْحانَ اللهِ الْعَظِيمِ\\n",
        "latin": "SubhanAll-llahi ve bihamdihi, SubhanAll-llahil-Adhim",
        "albanian": "I Lartësuar qoftë Allahu, vetëm Atij i takon Falënderimi. I Lartësuar qoftë Allahu, vetëm Atij i takon Madhërimi.",
        "reference": "Buhariu 7/168 dhe Muslimi 4/2072."
      },
      {
        "id": 257,
        "audio": "/audios/130_04.mp3",
        "arabic": "I Dërguari i Allahut (a.s) ka thënë: “Të them: \\nسُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلاَ إِلَهَ إِلاَّ اللهُ، وَاللهُ أَكْبَرُ",
        "latin": "SubhanAll-llahi, vElhamdulil-lahi, ve la ilahe il-lAll-llahu, vAll-llahu Ekber",
        "albanian": "I Lartësuar qoftë Allahu, Falënderimi i takon Allahut. Nuk ka hyjni që meriton të adhurohet përveç Allahut, Allahu është më i Madhi\\n\\n\"Është më e dashur për mua se sa e tërë ajo që e rrezaton dielli.\"",
        "reference": "Muslimi 4/2072."
      },
      {
        "id": 258,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "Gjithashtu i Dërguari i Allahut (a.s) ka thënë: “A nuk dëshironi që çdo ditë t’i fitoni nga njëmijë sevape? Njëri prej të pranishmëve e pyeti: Si t’i fitojmë njëmijë sevape? Ai i tha: Thuaj njëqind herë SubhanAll-llah, e të shkruhen njëmijë të mira, apo të shlyhen një mijë mëkate.” \\n",
        "reference": "Muslimi 4/2073."
      },
      {
        "id": 259,
        "audio": "/audios/130_05.mp3",
        "arabic": "Kush thotë:\\nسُبْحَانَ اللهِ الْعَظِيمِ وَبِحَمْدِهِ\\n",
        "latin": "SubhanAll-llahil-Adhim ve bihamdihi",
        "albanian": "I Lartësuar qoftë Allahu dhe Atij i takon falënderimi dhe madhërimi\\n\\n“I mbjellët një pemë në xhenet.”",
        "reference": "Tirmidhiu 5/511, Hakimi 1/501 e ka bërë të vërtetë, kurse Dhehebiu e ka pëlqyer. “Sahih el-Xhamiu” 5/531 dhe “Sahih et-Tirmidhi” 3/160.”"
      },
      {
        "id": 260,
        "audio": "/audios/130_06.mp3",
        "arabic": "Po ashtu i Dërguari i Allahut (a.s) ka thënë: “O Abdullah ibën Kajs, a dëshiron që të të udhëzoj tek një thesar prej thesareve të Xhenetit? Unë i thashë: “Po, o i Dërguari i Allahut”. Ai më tha: “Thuaj:\\nلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ\\n",
        "latin": "La Havle ve la kuvvete il-la bil-lah",
        "albanian": "Nuk ka ndryshim e as forcë pa ndihmën e Allahut.",
        "reference": "Buhariu me Fet’h 11/213 dhe Muslimi 4/2076."
      },
      {
        "id": 261,
        "audio": "/audios/130_07.mp3",
        "arabic": "I Dërguari i Allahut (a.s) ka thënë edhe këtë: “Fjalët më të dashura tek Allahu janë katër:\\nسُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلاَ إِلَهَ إِلاَّ اللهُ، وَاللهُ أَكْبَرُ\\n",
        "latin": "SubhanAll-llah, vElhamdulil-lah, ve La ilahe il-lAll-llah, vAll-llahu Ekber",
        "albanian": "I Lartësuar qoftë Allahu, Falënderimi i takon Allahut. Nuk ka hyjni që meriton të adhurohet përveç Allahut, Allahu është më i Madhi\\n\\n\"Nuk të bëhet dëm me cilëndo prej tyre që të fillosh.\"",
        "reference": "Muslimi 3/1685."
      },
      {
        "id": 262,
        "audio": "/audios/130_08.mp3",
        "arabic": "Ka ardhur një beduin te i Dërguari (a.s) dhe i ka thënë: “Ma mëso një fjalë të cilën gjithmonë do ta them”. I Dërguari i Allahut i tha: “Thuaj:\\nلاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، اللهُ أَكْبَرُ كَبِيراً، وَالْحَمْدُ لِلهِ كَثِيراً، سُبْحَانَ اللهِ رَبِّ العَالَمِينَ، لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ الْعَزِيزِ الْحَكِيمِ\\n\\nBeduini tha: “Këto janë për Zotin tim, e çka të them për mua? I Dërguari i Allahut (a.s) i tha, thuaj:\\nاَللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَارْزُقْنِي\\n",
        "latin": "La ilahe il-lAll-llahu vahdehu la sherike lehu, All-llahu Ekberu kebira, vElhamdulil-lahi kethira, SubhanAll-llahi Rabbil-Alemin, La Havle ve La Kuvvete il-la bil-lahil-Azizil-Hakim\\n\\nAll-llahummeg-fir li, ver-hamni, veh-dini, ver-zukni",
        "albanian": "Nuk ka hyjni që meriton të adhurohet përveç Allahut, Një dhe i pashoq, Allahu është më i Madhi, Falënderimi i shumtë i takon Allahut, i Lartësuar qoftë Allahu, Zoti i botëve. Nuk ka ndryshim e as forcë pa ndihmën e Allahut.\\n\\nO Allahu im, më fal mua, më mëshiro, më udhëzo dhe më furnizo.",
        "reference": "Muslimi 4/2072, ndërsa Ebu Davudi ka shtuar: “Pasi e ka kthyer shpinën beduini, i Dërguari ka thënë: I ka mbushur të dy duart me mirësi.” 1/220"
      },
      {
        "id": 263,
        "audio": "/audios/130_09.mp3",
        "arabic": "Kur ndonjë njeri e pranonte fenë Islame, i Dërguari i Allahut (a.s) ia mësonte namazin, pastaj e urdhëronte që të lutet me këto fjalë:\\nاَللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَارْزُقْنِي\\n",
        "latin": "All-llahummag-fir li, ver-hamni, veh-dini, ver-zukni",
        "albanian": "O Allahu im, më fal mua, më mëshiro, më udhëzo dhe më furnizo.",
        "reference": "Muslimi 4/2073 dhe në një transmetim tjetër të Muslimit: “Sepse me të vërtetë këto fjalë i bashkojnë këtë botë dhe ahiretin.”"
      },
      {
        "id": 264,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "Duaja më e vlefshme është: Elhamdulil-lah, kurse dhikri më i mirë është: La ilahe il-lAll-llah.",
        "reference": "Tirmidhiu 5/462, Ibën Maxheh 2.1249 dhe Hakimi 1/503 të cilin ky e ka bërë të vërtetë, kurse Dhehebiu e ka pëlqyer “Sahih El Xhamiu”, 1/362."
      },
      {
        "id": 265,
        "audio": "/audios/130_10.mp3",
        "arabic": "Fjalët më të mira dhe më të sinqerta të cilat mbesin përgjithmonë janë:\\nسُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلاَ إِلَهَ إِلاَّ اللهُ، وَاللهُ أَكْبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ\\n",
        "latin": "SubhanAll-llah, vElhamdulil-lah, ve La Ilahe il-lAll-llah, vAll-llahu Ekber, ve La havle ve la kuvvete il-la bil-lah",
        "albanian": "I Lartësuar qoftë Allahu, Falënderimi i takon Allahut. Nuk ka hyjni që meriton të adhurohet përveç Allahut, Allahu është më i Madhi dhe se nuk ka ndryshim e as forcë përveç se me ndihmën e Allahut.",
        "reference": "Ahmedi nën nr. 513. Sipas renditjes së Ahmed Shakirit edhe isnadi i këtij hadithi është i vërtetë “Mexhmeuz-Zevaid” 1/297, Ibën Haxheri në “Bulugul-Meram” thotë se e Nesaiu me transmetimin e Ebi Seidit. Hadithin e kanë bërë të vërtetë edhe Ibën Hibbani dhe Hakimi."
      }
    ]
  },
  {
    "id": 131,
    "chapter_name": "131.Si bënte tesbih i dërguari i allahut",
    "invocations": [
      {
        "id": 252,
        "audio": "/audios/.mp3",
        "arabic": "",
        "latin": "",
        "albanian": "Shënohet nga Abdullah ibën Omeri (r.a) të ketë thënë: “E kam parë të Dërguarin e Allahut duke bërë tesbih me dorën e djathtë.” ",
        "reference": "Ebu Davudi 2/81, Tirmidhiu 5/521, “Sahih el-Xhamiu” 4/27 #4865."
      }
    ]
  },
  {
    "id": 132,
    "chapter_name": "132.Disa vepra të mira dhe rregulla të përgjithshme",
    "invocations": [
      {
        "id": 253,
        "audio": "/audios/.mp3",
        "arabic": "وَصَلَّى اللهُ وَسَلَّمَ وَبَارَكَ عَلَى نَبِيِّنَا مُحَمَّدٍ وَعَلَى آلِهِ وَأَصْحَابِهِ أَجْمَعِينَ",
        "latin": "Ve sal-lAll-llahu ve sel-leme ve bareke ala nebij-jina Muhammedin ve ala alihi ve as-habihi exhme’in.",
        "albanian": "Kur të arrijë mbrëmja, ndaloni fëmijët e juaj, sepse shejtanët shpërndahen në atë kohë, ndërsa kur të kalojë një pjesë e natës, atëherë lëshoni ata, mbyllni dyert dhe përmendeni Allahun [thuani bismil-lah], sepse shejtani nuk e hapë derën e mbyllur; lidhni vorbat dhe përmendeni emrin e Allahut, mbuloni enët dhe përmendeni emrin e Allahut ose mund të vendosni mbi to diçka për së gjëri (p.sh. ndonjë thupër sh.p.) dhe fikni llambat tuaja (d.m.th. fike dritën, zjarrin). \\n\\nMëshira, shpëtimi dhe bekimi i Allahut qofshin mbi të Dërguarin tonë Muhammedin, familjen e tij dhe mbi të gjithë shokët e tij!\\n",
        "reference": "Buhariu “Fet’hul-Bari” 10/88 dhe Muslimi 3/1595."
      }
    ]
  }
]
